
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.50
 Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Tue May 31 17:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k gost89_cfb_decrypt.v gost89_ecb_encrypt.v gost89_round.v gost89_sbox.v

yosys> verific -vlog2k gost89_cfb_decrypt.v gost89_ecb_encrypt.v gost89_round.v gost89_sbox.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Tue May 31 17:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_cfb_decrypt.v'
VERIFIC-INFO [VERI-2561] gost89_cfb_decrypt.v:17: undeclared symbol 'reset_ecb', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_ecb_encrypt.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_round.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_sbox.v'

yosys> synth_rs -top gost89_cfb_decrypt -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.59

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top gost89_cfb_decrypt

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] gost89_cfb_decrypt.v:1: compiling module 'gost89_cfb_decrypt'
VERIFIC-INFO [VERI-1018] gost89_ecb_encrypt.v:1: compiling module 'gost89_ecb_encrypt'
VERIFIC-INFO [VERI-1018] gost89_round.v:1: compiling module 'gost89_round'
VERIFIC-INFO [VERI-1018] gost89_sbox.v:1: compiling module 'gost89_sbox'
VERIFIC-WARNING [VERI-1209] gost89_ecb_encrypt.v:33: expression size 7 truncated to fit in target size 6
Importing module gost89_cfb_decrypt.
Importing module gost89_ecb_encrypt.
Importing module gost89_round.
Importing module gost89_sbox.

3.3.1. Analyzing design hierarchy..
Top module:  \gost89_cfb_decrypt
Used module:     \gost89_ecb_encrypt
Used module:         \gost89_round
Used module:             \gost89_sbox

3.3.2. Analyzing design hierarchy..
Top module:  \gost89_cfb_decrypt
Used module:     \gost89_ecb_encrypt
Used module:         \gost89_round
Used module:             \gost89_sbox
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_sbox.
Optimizing module gost89_round.
Optimizing module gost89_ecb_encrypt.
<suppressed ~3 debug messages>
Optimizing module gost89_cfb_decrypt.

yosys> bmuxmap

3.5. Executing BMUXMAP pass.

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).
Deleting now unused module gost89_ecb_encrypt.
Deleting now unused module gost89_round.
Deleting now unused module gost89_sbox.
<suppressed ~10 debug messages>

yosys> bmuxmap

3.8. Executing BMUXMAP pass.

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 2344 unused wires.
<suppressed ~28 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module gost89_cfb_decrypt...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.15. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.15.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.15.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.15.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.15.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
    New ctrl vector for $pmux cell $flatten\ecb_encrypt.$verific$select_114$gost89_ecb_encrypt.v:80$1811: { $auto$opt_reduce.cc:134:opt_pmux$2452 $auto$opt_reduce.cc:134:opt_pmux$2450 $auto$opt_reduce.cc:134:opt_pmux$2448 $auto$opt_reduce.cc:134:opt_pmux$2446 $auto$opt_reduce.cc:134:opt_pmux$2444 $auto$opt_reduce.cc:134:opt_pmux$2442 $auto$opt_reduce.cc:134:opt_pmux$2440 $auto$opt_reduce.cc:134:opt_pmux$2438 $flatten\ecb_encrypt.$verific$n1897$1004 }
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 1 changes.

yosys> opt_merge

3.15.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$out_reg$gost89_cfb_decrypt.v:38$954 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $verific$in_value_reg$gost89_cfb_decrypt.v:38$953 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $verific$gamma_reg$gost89_cfb_decrypt.v:38$951 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$round_num_reg$gost89_ecb_encrypt.v:44$1774 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$round_key_reg$gost89_ecb_encrypt.v:80$1812 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$out_reg$gost89_ecb_encrypt.v:44$1775 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$n2_reg$gost89_ecb_encrypt.v:44$1772 ($aldff) from module gost89_cfb_decrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$n1_reg$gost89_ecb_encrypt.v:44$1771 ($aldff) from module gost89_cfb_decrypt.

yosys> opt_clean

3.15.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.15.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~6 debug messages>

3.15.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.15.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.15.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.15.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.15.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 1 unused cells and 2 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.15.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

3.15.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.15.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.15.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.15.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.15.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> opt_expr

3.15.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

3.15.23. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.16. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.16.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.16.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.16.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.16.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> fsm_opt

3.16.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.16.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.16.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.16.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat -nosdff

3.17. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.17.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_merge -nomux

3.17.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.17.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.17.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.17.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$out_reg$gost89_cfb_decrypt.v:38$954 ($dff) from module gost89_cfb_decrypt (D = $verific$n413$21, Q = \out).
Adding EN signal on $verific$in_value_reg$gost89_cfb_decrypt.v:38$953 ($dff) from module gost89_cfb_decrypt (D = \in, Q = \in_value).
Adding EN signal on $verific$gamma_reg$gost89_cfb_decrypt.v:38$951 ($dff) from module gost89_cfb_decrypt (D = $verific$n544$23, Q = \gamma).
Adding EN signal on $verific$busy_reg$gost89_cfb_decrypt.v:38$952 ($dff) from module gost89_cfb_decrypt (D = $verific$n674$16, Q = \busy).
Adding EN signal on $flatten\ecb_encrypt.$verific$round_key_reg$gost89_ecb_encrypt.v:80$1812 ($dff) from module gost89_cfb_decrypt (D = $flatten\ecb_encrypt.$verific$n1898$1059, Q = \ecb_encrypt.round_key).
Adding EN signal on $flatten\ecb_encrypt.$verific$out_reg$gost89_ecb_encrypt.v:44$1775 ($dff) from module gost89_cfb_decrypt (D = { \ecb_encrypt.n1 \ecb_encrypt.out1 }, Q = \ecb_encrypt.out).

yosys> opt_clean

3.17.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 4 unused cells and 4 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.17.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~6 debug messages>

3.17.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.17.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~19 debug messages>

yosys> opt_reduce

3.17.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.17.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.17.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.17.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.17.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

3.17.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.17.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~19 debug messages>

yosys> opt_reduce

3.17.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.17.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.17.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.17.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> opt_expr

3.17.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

3.17.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.18. Executing WREDUCE pass (reducing word size of cells).
Removed top 5 bits (of 6) from port A of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$LessThan_25$gost89_ecb_encrypt.v:34$1756 ($lt).
Removed top 5 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1753 ($add).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_100$gost89_ecb_encrypt.v:67$1795 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_101$gost89_ecb_encrypt.v:68$1796 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_102$gost89_ecb_encrypt.v:69$1797 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_103$gost89_ecb_encrypt.v:70$1798 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_104$gost89_ecb_encrypt.v:71$1799 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_105$gost89_ecb_encrypt.v:72$1800 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_106$gost89_ecb_encrypt.v:73$1801 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_107$gost89_ecb_encrypt.v:74$1802 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_108$gost89_ecb_encrypt.v:75$1803 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_109$gost89_ecb_encrypt.v:76$1804 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_110$gost89_ecb_encrypt.v:77$1805 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_111$gost89_ecb_encrypt.v:78$1806 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_112$gost89_ecb_encrypt.v:79$1807 ($eq).
Removed top 5 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_82$gost89_ecb_encrypt.v:49$1777 ($eq).
Removed top 4 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_83$gost89_ecb_encrypt.v:50$1778 ($eq).
Removed top 4 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_84$gost89_ecb_encrypt.v:51$1779 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_85$gost89_ecb_encrypt.v:52$1780 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_86$gost89_ecb_encrypt.v:53$1781 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_87$gost89_ecb_encrypt.v:54$1782 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_88$gost89_ecb_encrypt.v:55$1783 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_89$gost89_ecb_encrypt.v:56$1784 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_90$gost89_ecb_encrypt.v:57$1785 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_91$gost89_ecb_encrypt.v:58$1786 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_92$gost89_ecb_encrypt.v:59$1787 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_93$gost89_ecb_encrypt.v:60$1788 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_94$gost89_ecb_encrypt.v:61$1789 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_95$gost89_ecb_encrypt.v:62$1790 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_96$gost89_ecb_encrypt.v:63$1791 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_97$gost89_ecb_encrypt.v:64$1792 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_98$gost89_ecb_encrypt.v:65$1793 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_decrypt.$flatten\ecb_encrypt.$verific$equal_99$gost89_ecb_encrypt.v:66$1794 ($eq).

yosys> peepopt

3.19. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.20. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> bmuxmap

3.21. Executing BMUXMAP pass.

yosys> demuxmap

3.22. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.23. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module gost89_cfb_decrypt:
  creating $macc model for $flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1753 ($add).
  creating $macc model for $flatten\ecb_encrypt.\rnd.$verific$add_3$gost89_round.v:12$1819 ($add).
  creating $alu model for $macc $flatten\ecb_encrypt.\rnd.$verific$add_3$gost89_round.v:12$1819.
  creating $alu model for $macc $flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1753.
  creating $alu model for $flatten\ecb_encrypt.$verific$LessThan_21$gost89_ecb_encrypt.v:32$1752 ($lt): new $alu
  creating $alu model for $flatten\ecb_encrypt.$verific$LessThan_25$gost89_ecb_encrypt.v:34$1756 ($lt): new $alu
  creating $alu model for $flatten\ecb_encrypt.$verific$equal_32$gost89_ecb_encrypt.v:38$1762 ($eq): merged with $flatten\ecb_encrypt.$verific$LessThan_21$gost89_ecb_encrypt.v:32$1752.
  creating $alu cell for $flatten\ecb_encrypt.$verific$LessThan_25$gost89_ecb_encrypt.v:34$1756: $auto$alumacc.cc:485:replace_alu$2471
  creating $alu cell for $flatten\ecb_encrypt.$verific$LessThan_21$gost89_ecb_encrypt.v:32$1752, $flatten\ecb_encrypt.$verific$equal_32$gost89_ecb_encrypt.v:38$1762: $auto$alumacc.cc:485:replace_alu$2476
  creating $alu cell for $flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1753: $auto$alumacc.cc:485:replace_alu$2487
  creating $alu cell for $flatten\ecb_encrypt.\rnd.$verific$add_3$gost89_round.v:12$1819: $auto$alumacc.cc:485:replace_alu$2490
  created 4 $alu and 0 $macc cells.

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.25. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~19 debug messages>

yosys> opt_reduce

3.27. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
    New input vector for $reduce_and cell $auto$opt_dff.cc:220:make_patterns_logic$2468: { $auto$alumacc.cc:501:replace_alu$2477 $auto$rtlil.cc:2369:Not$2466 }
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 1 changes.

yosys> opt_merge

3.28. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.29. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.30. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 1

yosys> stat

3.33. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                174
   Number of wire bits:           4539
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                214
     $alu                            4
     $and                            6
     $dff                            4
     $dffe                           6
     $eq                            31
     $logic_not                      1
     $mux                          137
     $not                            8
     $or                             1
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    2
     $reduce_or                      9
     $xor                            2


yosys> memory -nomap

3.34. Executing MEMORY pass.

yosys> opt_mem

3.34.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.34.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.34.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.34.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.34.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.34.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> memory_share

3.34.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.34.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.34.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> memory_collect

3.34.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.35. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                174
   Number of wire bits:           4539
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                214
     $alu                            4
     $and                            6
     $dff                            4
     $dffe                           6
     $eq                            31
     $logic_not                      1
     $mux                          137
     $not                            8
     $or                             1
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    2
     $reduce_or                      9
     $xor                            2


yosys> muxpack

3.36. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~138 debug messages>

yosys> opt_clean

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> pmuxtree

3.38. Executing PMUXTREE pass.

yosys> muxpack

3.39. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting gost89_cfb_decrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2509 ... gost89_cfb_decrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2511 to a pmux with 2 cases.
Converting gost89_cfb_decrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2499 ... gost89_cfb_decrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2501 to a pmux with 2 cases.
Converted 4 (p)mux cells into 2 pmux cells.
<suppressed ~146 debug messages>

yosys> memory_map

3.40. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.41. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                188
   Number of wire bits:           4832
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                225
     $alu                            4
     $and                            6
     $dff                            4
     $dffe                           6
     $eq                            31
     $logic_not                      1
     $mux                          142
     $not                            9
     $or                             3
     $pmux                           2
     $reduce_and                     2
     $reduce_bool                    2
     $reduce_or                     11
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.42. Executing TECHMAP pass (map to technology primitives).

3.42.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.42.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.42.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $or.
Using template $paramod$8fabc56b80a569262acfc42757a02ca0b8e91278\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $reduce_bool.
Using template $paramod$32efbfac1c4dc57230cf86180788fdfd12e3b511\_90_alu for cells of type $alu.
Using template $paramod$00298f3f8094950cb9a5ff2fda48d0d8bde8806c\_90_alu for cells of type $alu.
Using template $paramod$be80489e44a49c29884f59fd81c31ed03229cfc1\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
No more expansions possible.
<suppressed ~804 debug messages>

yosys> stat

3.43. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                729
   Number of wire bits:          10294
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2453
     $_AND_                        193
     $_DFFE_PP_                    289
     $_DFF_P_                       71
     $_MUX_                       1100
     $_NOT_                         91
     $_OR_                         322
     $_XOR_                        355
     adder_carry                    32


yosys> opt_expr

3.44. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~345 debug messages>

yosys> opt_merge -nomux

3.45. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~636 debug messages>
Removed a total of 212 cells.

yosys> opt_muxtree

3.46. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.47. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.48. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.49. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.50. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 50 unused cells and 556 unused wires.
<suppressed ~51 debug messages>

yosys> opt_expr

3.52. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_muxtree

3.53. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.55. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.56. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.57. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> opt_expr

3.59. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 2

yosys> opt -nodffe -fast -full -nosdff

3.60. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.60.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~131 debug messages>

yosys> opt_merge

3.60.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.60.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.60.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

3.60.5. Finished fast OPT passes.

yosys> techmap -map +/techmap.v

3.61. Executing TECHMAP pass (map to technology primitives).

3.61.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.61.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -nodffe -sat -nosdff

3.62. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.62.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_merge -nomux

3.62.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.62.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.62.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.62.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat -nosdff

3.62.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.62.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> opt_expr

3.62.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

3.62.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.63. Executing ABC pass (technology mapping using ABC).

3.63.1. Summary of detected clock domains:
  647 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$2467, arst={ }, srst={ }
  389 cells in clk=\clk, en={ }, arst={ }, srst={ }
  67 cells in clk=\clk, en=$verific$n347$15, arst={ }, srst={ }
  130 cells in clk=\clk, en=\ecb_encrypt.load_data, arst={ }, srst={ }
  67 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$2456, arst={ }, srst={ }
  561 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$2462, arst={ }, srst={ }
  3 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$2459, arst={ }, srst={ }

3.63.2. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2467
Extracted 647 gates and 1326 wires to a netlist network with 679 inputs and 97 outputs.

3.63.2.1. Executing ABC.

3.63.3. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 357 gates and 488 wires to a netlist network with 130 inputs and 111 outputs.

3.63.3.1. Executing ABC.

3.63.4. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $verific$n347$15
Extracted 67 gates and 135 wires to a netlist network with 68 inputs and 65 outputs.

3.63.4.1. Executing ABC.

3.63.5. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \ecb_encrypt.load_data
Extracted 130 gates and 197 wires to a netlist network with 67 inputs and 130 outputs.

3.63.5.1. Executing ABC.

3.63.6. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2456
Extracted 67 gates and 134 wires to a netlist network with 67 inputs and 66 outputs.

3.63.6.1. Executing ABC.

3.63.7. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2462
Extracted 561 gates and 829 wires to a netlist network with 268 inputs and 33 outputs.

3.63.7.1. Executing ABC.

3.63.8. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2459
Extracted 3 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.63.8.1. Executing ABC.

yosys> abc -dff

3.64. Executing ABC pass (technology mapping using ABC).

3.64.1. Summary of detected clock domains:
  176 cells in clk=\clk, en=$abc$7140$ecb_encrypt.load_data, arst={ }, srst={ }
  84 cells in clk=\clk, en=$abc$6944$verific$n347$15, arst={ }, srst={ }
  76 cells in clk=\clk, en=$abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467, arst={ }, srst={ }
  85 cells in clk=\clk, en=$abc$7399$auto$opt_dff.cc:194:make_patterns_logic$2456, arst={ }, srst={ }
  995 cells in clk=\clk, en={ }, arst={ }, srst={ }
  576 cells in clk=\clk, en=$abc$7595$auto$opt_dff.cc:194:make_patterns_logic$2462, arst={ }, srst={ }
  4 cells in clk=\clk, en=$abc$8202$auto$opt_dff.cc:194:make_patterns_logic$2459, arst={ }, srst={ }

3.64.2. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7140$ecb_encrypt.load_data
Extracted 176 gates and 290 wires to a netlist network with 114 inputs and 129 outputs.

3.64.2.1. Executing ABC.

3.64.3. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$6944$verific$n347$15
Extracted 84 gates and 167 wires to a netlist network with 83 inputs and 65 outputs.

3.64.3.1. Executing ABC.

3.64.4. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467
Extracted 76 gates and 153 wires to a netlist network with 77 inputs and 65 outputs.

3.64.4.1. Executing ABC.

3.64.5. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7399$auto$opt_dff.cc:194:make_patterns_logic$2456
Extracted 85 gates and 172 wires to a netlist network with 87 inputs and 65 outputs.

3.64.5.1. Executing ABC.

3.64.6. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 963 gates and 1601 wires to a netlist network with 638 inputs and 134 outputs.

3.64.6.1. Executing ABC.

3.64.7. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7595$auto$opt_dff.cc:194:make_patterns_logic$2462
Extracted 576 gates and 846 wires to a netlist network with 270 inputs and 33 outputs.

3.64.7.1. Executing ABC.

3.64.8. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8202$auto$opt_dff.cc:194:make_patterns_logic$2459
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.64.8.1. Executing ABC.

yosys> abc -dff

3.65. Executing ABC pass (technology mapping using ABC).

3.65.1. Summary of detected clock domains:
  183 cells in clk=\clk, en=$abc$8660$abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467, arst={ }, srst={ }
  157 cells in clk=\clk, en=$abc$8207$abc$7140$ecb_encrypt.load_data, arst={ }, srst={ }
  99 cells in clk=\clk, en=$abc$8856$abc$7399$auto$opt_dff.cc:194:make_patterns_logic$2456, arst={ }, srst={ }
  70 cells in clk=\clk, en=$abc$8465$abc$6944$verific$n347$15, arst={ }, srst={ }
  952 cells in clk=\clk, en={ }, arst={ }, srst={ }
  535 cells in clk=\clk, en=$abc$10122$abc$7595$auto$opt_dff.cc:194:make_patterns_logic$2462, arst={ }, srst={ }
  4 cells in clk=\clk, en=$abc$10687$abc$8202$auto$opt_dff.cc:194:make_patterns_logic$2459, arst={ }, srst={ }

3.65.2. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8660$abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467
Extracted 183 gates and 359 wires to a netlist network with 176 inputs and 69 outputs.

3.65.2.1. Executing ABC.

3.65.3. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8207$abc$7140$ecb_encrypt.load_data
Extracted 157 gates and 256 wires to a netlist network with 99 inputs and 125 outputs.

3.65.3.1. Executing ABC.

3.65.4. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8856$abc$7399$auto$opt_dff.cc:194:make_patterns_logic$2456
Extracted 99 gates and 176 wires to a netlist network with 77 inputs and 66 outputs.

3.65.4.1. Executing ABC.

3.65.5. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8465$abc$6944$verific$n347$15
Extracted 70 gates and 141 wires to a netlist network with 71 inputs and 65 outputs.

3.65.5.1. Executing ABC.

3.65.6. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 920 gates and 1498 wires to a netlist network with 578 inputs and 112 outputs.

3.65.6.1. Executing ABC.

3.65.7. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10122$abc$7595$auto$opt_dff.cc:194:make_patterns_logic$2462
Extracted 535 gates and 806 wires to a netlist network with 271 inputs and 33 outputs.

3.65.7.1. Executing ABC.

3.65.8. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10687$abc$8202$auto$opt_dff.cc:194:make_patterns_logic$2459
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.65.8.1. Executing ABC.

yosys> abc -dff

3.66. Executing ABC pass (technology mapping using ABC).

3.66.1. Summary of detected clock domains:
  224 cells in clk=\clk, en=$abc$10693$abc$8660$abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467, arst={ }, srst={ }
  112 cells in clk=\clk, en=$abc$10981$abc$8207$abc$7140$ecb_encrypt.load_data, arst={ }, srst={ }
  127 cells in clk=\clk, en=$abc$11235$abc$8856$abc$7399$auto$opt_dff.cc:194:make_patterns_logic$2456, arst={ }, srst={ }
  101 cells in clk=\clk, en=$abc$11431$abc$8465$abc$6944$verific$n347$15, arst={ }, srst={ }
  981 cells in clk=\clk, en={ }, arst={ }, srst={ }
  561 cells in clk=\clk, en=$abc$12655$abc$10122$abc$7595$auto$opt_dff.cc:194:make_patterns_logic$2462, arst={ }, srst={ }
  4 cells in clk=\clk, en=$abc$13249$abc$10687$abc$8202$auto$opt_dff.cc:194:make_patterns_logic$2459, arst={ }, srst={ }

3.66.2. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10693$abc$8660$abc$5722$auto$opt_dff.cc:219:make_patterns_logic$2467
Extracted 224 gates and 419 wires to a netlist network with 195 inputs and 70 outputs.

3.66.2.1. Executing ABC.

3.66.3. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10981$abc$8207$abc$7140$ecb_encrypt.load_data
Extracted 112 gates and 179 wires to a netlist network with 67 inputs and 112 outputs.

3.66.3.1. Executing ABC.

3.66.4. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$11235$abc$8856$abc$7399$auto$opt_dff.cc:194:make_patterns_logic$2456
Extracted 127 gates and 224 wires to a netlist network with 97 inputs and 66 outputs.

3.66.4.1. Executing ABC.

3.66.5. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$11431$abc$8465$abc$6944$verific$n347$15
Extracted 101 gates and 203 wires to a netlist network with 102 inputs and 65 outputs.

3.66.5.1. Executing ABC.

3.66.6. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 949 gates and 1515 wires to a netlist network with 566 inputs and 122 outputs.

3.66.6.1. Executing ABC.

3.66.7. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12655$abc$10122$abc$7595$auto$opt_dff.cc:194:make_patterns_logic$2462
Extracted 561 gates and 829 wires to a netlist network with 268 inputs and 33 outputs.

3.66.7.1. Executing ABC.

3.66.8. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13249$abc$10687$abc$8202$auto$opt_dff.cc:194:make_patterns_logic$2459
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.66.8.1. Executing ABC.

yosys> opt_ffinv

3.67. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat -nosdff

3.68. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.68.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~20 debug messages>

yosys> opt_merge -nomux

3.68.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~24 debug messages>
Removed a total of 8 cells.

yosys> opt_muxtree

3.68.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.68.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.68.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14266 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li64_li64, Q = $abc$14201$lo64).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14246 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li44_li44, Q = $abc$14201$lo44).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14256 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li54_li54, Q = $abc$14201$lo54).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14244 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li42_li42, Q = $abc$14201$lo42).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14263 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li61_li61, Q = $abc$14201$lo61).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14249 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li47_li47, Q = $abc$14201$lo47).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14245 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li43_li43, Q = $abc$14201$lo43).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14224 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li22_li22, Q = $abc$14201$lo22).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14222 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li20_li20, Q = $abc$14201$lo20).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14258 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li56_li56, Q = $abc$14201$lo56).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14252 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li50_li50, Q = $abc$14201$lo50).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14257 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li55_li55, Q = $abc$14201$lo55).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14211 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li09_li09, Q = $abc$14201$lo09).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14268 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li66_li66, Q = $abc$14201$lo66).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14260 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li58_li58, Q = $abc$14201$lo58).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14269 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li67_li67, Q = $abc$14201$lo67).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14250 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li48_li48, Q = $abc$14201$lo48).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14259 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li57_li57, Q = $abc$14201$lo57).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14255 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li53_li53, Q = $abc$14201$lo53).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14254 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li52_li52, Q = $abc$14201$lo52).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14251 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$14201$li49_li49, Q = $abc$14201$lo49).

yosys> opt_clean

3.68.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 13503 unused wires.
<suppressed ~17 debug messages>

yosys> opt_expr

3.68.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~42 debug messages>

3.68.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.68.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.68.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~105 debug messages>
Removed a total of 35 cells.

yosys> opt_dff -sat -nosdff

3.68.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14238 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11626$li68_li68, Q = $abc$14201$lo36).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14232 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11626$li22_li22, Q = $abc$11626$lo22).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14228 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11626$li18_li18, Q = $abc$14201$lo26).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14216 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11235$abc$9051$li61_li61, Q = $abc$14201$lo14).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14214 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11235$abc$9051$li65_li65, Q = $abc$10693$abc$9051$lo65).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14212 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11235$abc$9051$li70_li70, Q = $abc$14201$lo10).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14210 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11235$abc$9051$li52_li52, Q = $abc$10693$abc$9051$lo52).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14207 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11626$li46_li46, Q = $abc$14201$lo05).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14205 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11626$li56_li56, Q = $abc$14201$lo03).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14204 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11626$li69_li69, Q = $abc$11626$lo69).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14203 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11626$li38_li38, Q = $abc$14201$lo01).
Adding EN signal on $abc$14201$auto$blifparse.cc:362:parse_blif$14202 ($_DFF_P_) from module gost89_cfb_decrypt (D = $abc$11626$li54_li54, Q = $abc$14201$lo00).

yosys> opt_clean

3.68.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 68 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.68.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~24 debug messages>

3.68.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.68.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.68.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~36 debug messages>
Removed a total of 12 cells.

yosys> opt_dff -sat -nosdff

3.68.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.68.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 24 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.68.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

3.68.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.68.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.68.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.68.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.68.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> opt_expr

3.68.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

3.68.30. Finished OPT passes. (There is nothing left to do.)

yosys> bmuxmap

3.69. Executing BMUXMAP pass.

yosys> demuxmap

3.70. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /home/users/temp_dir/yosys_48u2kv/abc_tmp_1.scr

3.71. Executing ABC pass (technology mapping using ABC).

3.71.1. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Extracted 1737 gates and 2899 wires to a netlist network with 1161 inputs and 302 outputs.

3.71.1.1. Executing ABC.
DE:   #PIs = 1161  #Luts =   595  Max Lvl =   5  Avg Lvl =   2.28  [   0.07 sec. at Pass 0]
DE:   #PIs = 1161  #Luts =   560  Max Lvl =   5  Avg Lvl =   2.20  [   1.61 sec. at Pass 1]
DE:   #PIs = 1161  #Luts =   559  Max Lvl =   5  Avg Lvl =   2.19  [   0.43 sec. at Pass 2]
DE:   #PIs = 1161  #Luts =   559  Max Lvl =   5  Avg Lvl =   2.19  [   0.54 sec. at Pass 3]
DE:   #PIs = 1161  #Luts =   559  Max Lvl =   5  Avg Lvl =   2.19  [   0.54 sec. at Pass 4]
DE:   #PIs = 1161  #Luts =   540  Max Lvl =   5  Avg Lvl =   2.19  [   0.69 sec. at Pass 5]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.19  [   0.45 sec. at Pass 6]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.19  [   0.57 sec. at Pass 7]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.19  [   0.44 sec. at Pass 8]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.19  [   0.54 sec. at Pass 9]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.19  [   2.74 sec. at Pass 10]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.19  [   0.15 sec. at Pass 11]

yosys> opt_expr

3.72. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_merge -nomux

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.74. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.75. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.77. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.78. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.79. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 2897 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.80. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.81. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.82. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                776
   Number of wire bits:           3942
   Number of public wires:          45
   Number of public wire bits:    3148
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                929
     $_DFFE_PP_                    322
     $_DFF_P_                       38
     $lut                          537
     adder_carry                    32


yosys> shregmap -minlen 8 -maxlen 20

3.83. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.84. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.85. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                776
   Number of wire bits:           3942
   Number of public wires:          45
   Number of public wire bits:    3148
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                929
     $_DFFE_PP0P_                  322
     $_DFF_P_                       38
     $lut                          537
     adder_carry                    32


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.86. Executing TECHMAP pass (map to technology primitives).

3.86.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.86.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.86.3. Continuing TECHMAP pass.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1355 debug messages>

yosys> opt_expr -mux_undef

3.87. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~15986 debug messages>

yosys> simplemap

3.88. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.89. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_merge

3.90. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
<suppressed ~4050 debug messages>
Removed a total of 1350 cells.

yosys> opt_dff -nodffe -nosdff

3.91. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.92. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 3471 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.93. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.93.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
<suppressed ~419 debug messages>

yosys> opt_merge -nomux

3.93.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.93.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.93.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.93.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.93.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 34 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.93.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

3.93.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.93.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.93.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.93.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.93.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..

yosys> opt_expr

3.93.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

3.93.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_48u2kv/abc_tmp_2.scr

3.94. Executing ABC pass (technology mapping using ABC).

3.94.1. Extracting gate netlist of module `\gost89_cfb_decrypt' to `<abc-temp-dir>/input.blif'..
Extracted 1886 gates and 3049 wires to a netlist network with 1161 inputs and 300 outputs.

3.94.1.1. Executing ABC.
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   5  Avg Lvl =   2.19  [   0.08 sec. at Pass 0]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   4  Avg Lvl =   2.18  [   1.49 sec. at Pass 1]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   4  Avg Lvl =   2.18  [   0.43 sec. at Pass 2]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   4  Avg Lvl =   2.18  [   0.52 sec. at Pass 3]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   4  Avg Lvl =   2.18  [   0.50 sec. at Pass 4]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   4  Avg Lvl =   2.18  [   0.66 sec. at Pass 5]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   4  Avg Lvl =   2.18  [   3.05 sec. at Pass 6]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   4  Avg Lvl =   2.18  [   0.15 sec. at Pass 7]

yosys> opt_expr

3.95. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.

yosys> opt_merge -nomux

3.96. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.97. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.98. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.99. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.100. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.101. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.102. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 2650 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.103. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_decrypt.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.104. Executing HIERARCHY pass (managing design hierarchy).

3.104.1. Analyzing design hierarchy..
Top module:  \gost89_cfb_decrypt

3.104.2. Analyzing design hierarchy..
Top module:  \gost89_cfb_decrypt
Removed 0 unused modules.

yosys> stat

3.105. Printing statistics.

=== gost89_cfb_decrypt ===

   Number of wires:                776
   Number of wire bits:           3942
   Number of public wires:          45
   Number of public wire bits:    3148
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                929
     $lut                          537
     adder_carry                    32
     dffsre                        360


yosys> opt_clean -purge

3.106. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_decrypt..
Removed 0 unused cells and 24 unused wires.
<suppressed ~24 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.107. Executing Verilog backend.
Dumping module `\gost89_cfb_decrypt'.

Warnings: 1 unique messages, 1 total
End of script. Logfile hash: 0883bd33c3, CPU: user 5.02s system 0.17s, MEM: 62.86 MB peak
Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)
Time spent: 97% 6x abc (149 sec), 1% 34x opt_expr (1 sec), ...
real 28.53
user 140.90
sys 12.73
