
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.53
 Yosys 0.18+10 (git sha1 a3cbfccc4, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k gost89_pipelined_ecb_decrypt.v gost89_round.v gost89_sbox.v

yosys> verific -vlog2k gost89_pipelined_ecb_decrypt.v gost89_round.v gost89_sbox.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_pipelined_ecb_decrypt.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_round.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_sbox.v'

yosys> synth_rs -top gost89_pipelined_ecb_decrypt -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.61

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top gost89_pipelined_ecb_decrypt

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] gost89_pipelined_ecb_decrypt.v:1: compiling module 'gost89_pipelined_ecb_decrypt'
VERIFIC-INFO [VERI-1018] gost89_round.v:1: compiling module 'gost89_round'
VERIFIC-INFO [VERI-1018] gost89_sbox.v:1: compiling module 'gost89_sbox'
Importing module gost89_pipelined_ecb_decrypt.
Importing module gost89_round.
Importing module gost89_sbox.

3.3.1. Analyzing design hierarchy..
Top module:  \gost89_pipelined_ecb_decrypt
Used module:     \gost89_round
Used module:         \gost89_sbox

3.3.2. Analyzing design hierarchy..
Top module:  \gost89_pipelined_ecb_decrypt
Used module:     \gost89_round
Used module:         \gost89_sbox
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_sbox.
Optimizing module gost89_round.
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> bmuxmap

3.5. Executing BMUXMAP pass.

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).
Deleting now unused module gost89_round.
Deleting now unused module gost89_sbox.
<suppressed ~40 debug messages>

yosys> bmuxmap

3.8. Executing BMUXMAP pass.

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..
Removed 0 unused cells and 44514 unused wires.
<suppressed ~356 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module gost89_pipelined_ecb_decrypt...
Found and reported 0 problems.

yosys> opt_expr

3.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> opt_merge -nomux

3.16. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_pipelined_ecb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~256 debug messages>

yosys> opt_reduce

3.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_pipelined_ecb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.20. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.21. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$n2_reg$gost89_pipelined_ecb_decrypt.v:44$71 ($aldff) from module gost89_pipelined_ecb_decrypt.
Removing never-active async load on $verific$n1_reg$gost89_pipelined_ecb_decrypt.v:44$70 ($aldff) from module gost89_pipelined_ecb_decrypt.

yosys> opt_clean

3.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.24. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.24.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.24.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.24.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..

yosys> fsm_opt

3.24.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.24.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.24.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.24.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> opt_merge -nomux

3.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_pipelined_ecb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~256 debug messages>

yosys> opt_reduce

3.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_pipelined_ecb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.30. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.34. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

3.35. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.36. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..

yosys> bmuxmap

3.37. Executing BMUXMAP pass.

yosys> demuxmap

3.38. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.39. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module gost89_pipelined_ecb_decrypt:
  creating $macc model for $flatten\r1.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r10.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r11.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r12.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r13.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r14.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r15.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r16.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r17.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r18.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r19.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r2.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r20.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r21.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r22.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r23.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r24.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r25.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r26.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r27.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r28.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r29.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r3.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r30.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r31.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r32.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r4.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r5.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r6.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r7.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r8.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $macc model for $flatten\r9.$verific$add_3$gost89_round.v:12$21615 ($add).
  creating $alu model for $macc $flatten\r9.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r8.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r7.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r6.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r5.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r4.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r32.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r31.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r30.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r3.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r29.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r28.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r27.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r26.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r25.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r24.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r23.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r22.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r21.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r20.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r2.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r19.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r18.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r17.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r16.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r15.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r14.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r13.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r12.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r11.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r10.$verific$add_3$gost89_round.v:12$21615.
  creating $alu model for $macc $flatten\r1.$verific$add_3$gost89_round.v:12$21615.
  creating $alu cell for $flatten\r1.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22233
  creating $alu cell for $flatten\r10.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22236
  creating $alu cell for $flatten\r11.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22239
  creating $alu cell for $flatten\r12.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22242
  creating $alu cell for $flatten\r13.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22245
  creating $alu cell for $flatten\r14.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22248
  creating $alu cell for $flatten\r15.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22251
  creating $alu cell for $flatten\r16.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22254
  creating $alu cell for $flatten\r17.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22257
  creating $alu cell for $flatten\r18.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22260
  creating $alu cell for $flatten\r19.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22263
  creating $alu cell for $flatten\r2.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22266
  creating $alu cell for $flatten\r20.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22269
  creating $alu cell for $flatten\r21.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22272
  creating $alu cell for $flatten\r22.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22275
  creating $alu cell for $flatten\r23.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22278
  creating $alu cell for $flatten\r24.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22281
  creating $alu cell for $flatten\r25.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22284
  creating $alu cell for $flatten\r26.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22287
  creating $alu cell for $flatten\r27.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22290
  creating $alu cell for $flatten\r28.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22293
  creating $alu cell for $flatten\r29.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22296
  creating $alu cell for $flatten\r3.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22299
  creating $alu cell for $flatten\r30.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22302
  creating $alu cell for $flatten\r31.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22305
  creating $alu cell for $flatten\r32.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22308
  creating $alu cell for $flatten\r4.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22311
  creating $alu cell for $flatten\r5.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22314
  creating $alu cell for $flatten\r6.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22317
  creating $alu cell for $flatten\r7.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22320
  creating $alu cell for $flatten\r8.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22323
  creating $alu cell for $flatten\r9.$verific$add_3$gost89_round.v:12$21615: $auto$alumacc.cc:485:replace_alu$22326
  created 32 $alu and 0 $macc cells.

yosys> opt_expr

3.40. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> opt_merge -nomux

3.41. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_pipelined_ecb_decrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~256 debug messages>

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_pipelined_ecb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.46. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
MAX OPT ITERATION = 1

yosys> stat

3.49. Printing statistics.

=== gost89_pipelined_ecb_decrypt ===

   Number of wires:               2021
   Number of wire bits:          63393
   Number of public wires:        1189
   Number of public wire bits:   47009
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3906
     $alu                           32
     $dff                            2
     $mux                         3840
     $xor                           32


yosys> memory -nomap

3.50. Executing MEMORY pass.

yosys> opt_mem

3.50.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.50.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.50.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.50.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.50.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.50.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..

yosys> memory_share

3.50.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.50.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.50.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..

yosys> memory_collect

3.50.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.51. Printing statistics.

=== gost89_pipelined_ecb_decrypt ===

   Number of wires:               2021
   Number of wire bits:          63393
   Number of public wires:        1189
   Number of public wire bits:   47009
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3906
     $alu                           32
     $dff                            2
     $mux                         3840
     $xor                           32


yosys> muxpack

3.52. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~1856 debug messages>

yosys> opt_clean

3.53. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..

yosys> pmuxtree

3.54. Executing PMUXTREE pass.

yosys> muxpack

3.55. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~1856 debug messages>

yosys> memory_map

3.56. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.57. Printing statistics.

=== gost89_pipelined_ecb_decrypt ===

   Number of wires:               2021
   Number of wire bits:          63393
   Number of public wires:        1189
   Number of public wire bits:   47009
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3906
     $alu                           32
     $dff                            2
     $mux                         3840
     $xor                           32


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.58. Executing TECHMAP pass (map to technology primitives).

3.58.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.58.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.58.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $xor.
Using template $paramod$be80489e44a49c29884f59fd81c31ed03229cfc1\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $pos.
No more expansions possible.
<suppressed ~4296 debug messages>

yosys> stat

3.59. Printing statistics.

=== gost89_pipelined_ecb_decrypt ===

   Number of wires:               2725
   Number of wire bits:          78017
   Number of public wires:        1189
   Number of public wire bits:   47009
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              22656
     $_DFF_P_                     2048
     $_MUX_                      16448
     $_NOT_                       1024
     $_XOR_                       2112
     adder_carry                  1024


yosys> opt_expr

3.60. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
<suppressed ~1024 debug messages>

yosys> opt_merge -nomux

3.61. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
<suppressed ~1824 debug messages>
Removed a total of 608 cells.

yosys> opt_muxtree

3.62. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_pipelined_ecb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.63. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_pipelined_ecb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.64. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.65. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.66. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.67. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..
Removed 448 unused cells and 672 unused wires.
<suppressed ~449 debug messages>

yosys> opt_expr

3.68. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> opt_muxtree

3.69. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_pipelined_ecb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.70. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_pipelined_ecb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.71. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.72. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.73. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.74. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..

yosys> opt_expr

3.75. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.76. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> techmap -map +/techmap.v

3.77. Executing TECHMAP pass (map to technology primitives).

3.77.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.77.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.78. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> opt_merge -nomux

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.80. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_pipelined_ecb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.81. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_pipelined_ecb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.82. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.83. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.84. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..

yosys> opt_expr

3.85. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
MAX OPT ITERATION = 1

yosys> abc -dff

3.86. Executing ABC pass (technology mapping using ABC).

3.86.1. Summary of detected clock domains:
  20576 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.86.2. Extracting gate netlist of module `\gost89_pipelined_ecb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 19552 gates and 21376 wires to a netlist network with 1824 inputs and 1804 outputs.

3.86.2.1. Executing ABC.

yosys> abc -dff

3.87. Executing ABC pass (technology mapping using ABC).

3.87.1. Summary of detected clock domains:
  25863 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.87.2. Extracting gate netlist of module `\gost89_pipelined_ecb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 24839 gates and 26663 wires to a netlist network with 1824 inputs and 1804 outputs.

3.87.2.1. Executing ABC.

yosys> abc -dff

3.88. Executing ABC pass (technology mapping using ABC).

3.88.1. Summary of detected clock domains:
  25933 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.88.2. Extracting gate netlist of module `\gost89_pipelined_ecb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 24909 gates and 26733 wires to a netlist network with 1824 inputs and 1804 outputs.

3.88.2.1. Executing ABC.

yosys> abc -dff

3.89. Executing ABC pass (technology mapping using ABC).

3.89.1. Summary of detected clock domains:
  25896 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.89.2. Extracting gate netlist of module `\gost89_pipelined_ecb_decrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 24872 gates and 26696 wires to a netlist network with 1824 inputs and 1804 outputs.

3.89.2.1. Executing ABC.

yosys> opt_ffinv

3.90. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.91. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
<suppressed ~33 debug messages>

yosys> opt_merge -nomux

3.92. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.93. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_pipelined_ecb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.94. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_pipelined_ecb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.95. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.96. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.97. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.98. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..
Removed 5 unused cells and 92253 unused wires.
<suppressed ~294 debug messages>

yosys> opt_expr

3.99. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> opt_muxtree

3.100. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_pipelined_ecb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.101. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_pipelined_ecb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.102. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.103. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.104. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.105. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..

yosys> opt_expr

3.106. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
MAX OPT ITERATION = 2

yosys> bmuxmap

3.107. Executing BMUXMAP pass.

yosys> demuxmap

3.108. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_VT6RXF/abc_tmp_1.scr

3.109. Executing ABC pass (technology mapping using ABC).

3.109.1. Extracting gate netlist of module `\gost89_pipelined_ecb_decrypt' to `<abc-temp-dir>/input.blif'..
Extracted 23347 gates and 27155 wires to a netlist network with 3808 inputs and 1984 outputs.

3.109.1.1. Executing ABC.
DE:   #PIs = 3808  #Luts =  8003  Max Lvl =   4  Avg Lvl =   2.25  [   0.46 sec. at Pass 0]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [  25.22 sec. at Pass 1]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [   7.84 sec. at Pass 2]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [   9.25 sec. at Pass 3]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [  14.49 sec. at Pass 4]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [  12.36 sec. at Pass 5]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [   2.89 sec. at Pass 6]

yosys> opt_expr

3.110. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> opt_merge -nomux

3.111. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.112. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_pipelined_ecb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.113. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_pipelined_ecb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.114. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.115. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.116. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.117. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..
Removed 0 unused cells and 27155 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.118. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.119. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.120. Printing statistics.

=== gost89_pipelined_ecb_decrypt ===

   Number of wires:               8409
   Number of wire bits:          54485
   Number of public wires:         901
   Number of public wire bits:   44961
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              10240
     $_DFF_P_                     2048
     $lut                         7168
     adder_carry                  1024


yosys> shregmap -minlen 8 -maxlen 20

3.121. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.122. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.123. Printing statistics.

=== gost89_pipelined_ecb_decrypt ===

   Number of wires:               8409
   Number of wire bits:          54485
   Number of public wires:         901
   Number of public wire bits:   44961
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              10240
     $_DFF_P_                     2048
     $lut                         7168
     adder_carry                  1024


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.124. Executing TECHMAP pass (map to technology primitives).

3.124.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.124.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.124.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
No more expansions possible.
<suppressed ~9352 debug messages>

yosys> opt_expr -mux_undef

3.125. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
<suppressed ~303260 debug messages>

yosys> simplemap

3.126. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.127. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> opt_merge

3.128. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
<suppressed ~15399 debug messages>
Removed a total of 5133 cells.

yosys> opt_dff -nodffe -nosdff

3.129. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.130. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..
Removed 0 unused cells and 33207 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.131. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
<suppressed ~1563 debug messages>

yosys> opt_merge -nomux

3.132. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.133. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_pipelined_ecb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.134. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_pipelined_ecb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.135. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.136. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.137. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.138. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..
Removed 0 unused cells and 102 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.139. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_VT6RXF/abc_tmp_2.scr

3.140. Executing ABC pass (technology mapping using ABC).

3.140.1. Extracting gate netlist of module `\gost89_pipelined_ecb_decrypt' to `<abc-temp-dir>/input.blif'..
Extracted 21464 gates and 25274 wires to a netlist network with 3808 inputs and 1984 outputs.

3.140.1.1. Executing ABC.
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [   0.81 sec. at Pass 0]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [  40.17 sec. at Pass 1]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [  13.52 sec. at Pass 2]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [  18.53 sec. at Pass 3]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [  13.73 sec. at Pass 4]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [  15.83 sec. at Pass 5]
DE:   #PIs = 3808  #Luts =  7168  Max Lvl =   3  Avg Lvl =   2.03  [   2.41 sec. at Pass 6]

yosys> opt_expr

3.141. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.

yosys> opt_merge -nomux

3.142. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.143. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_pipelined_ecb_decrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.144. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_pipelined_ecb_decrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.145. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_pipelined_ecb_decrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.146. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.147. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.148. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..
Removed 0 unused cells and 19037 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.149. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_pipelined_ecb_decrypt.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.150. Executing HIERARCHY pass (managing design hierarchy).

3.150.1. Analyzing design hierarchy..
Top module:  \gost89_pipelined_ecb_decrypt

3.150.2. Analyzing design hierarchy..
Top module:  \gost89_pipelined_ecb_decrypt
Removed 0 unused modules.

yosys> stat

3.151. Printing statistics.

=== gost89_pipelined_ecb_decrypt ===

   Number of wires:               8409
   Number of wire bits:          54485
   Number of public wires:         901
   Number of public wire bits:   44961
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              10240
     $lut                         7168
     adder_carry                  1024
     dffsre                       2048


yosys> opt_clean -purge

3.152. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_pipelined_ecb_decrypt..
Removed 0 unused cells and 614 unused wires.
<suppressed ~614 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.153. Executing Verilog backend.
Dumping module `\gost89_pipelined_ecb_decrypt'.

End of script. Logfile hash: e105ffba53, CPU: user 59.46s system 0.54s, MEM: 683.29 MB peak
Yosys 0.18+10 (git sha1 a3cbfccc4, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 91% 6x abc (558 sec), 3% 25x opt_expr (21 sec), ...
real 297.72
user 552.01
sys 60.50
