
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.70
 Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k cf_cordic_v_32_32_32.v

yosys> verific -vlog2k cf_cordic_v_32_32_32.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cf_cordic_v_32_32_32.v'

yosys> synth_rs -top cf_cordic_v_32_32_32 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.69

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top cf_cordic_v_32_32_32

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:74: compiling module 'cf_cordic_v_32_32_32'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:93: compiling module 'cf_cordic_v_32_32_32_1'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3892: compiling module 'cf_cordic_v_32_32_32_55'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:4026: compiling module 'cf_cordic_v_32_32_32_56'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:518: compiling module 'cf_cordic_v_32_32_32_6'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3750: compiling module 'cf_cordic_v_32_32_32_53'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3870: compiling module 'cf_cordic_v_32_32_32_54'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1315: compiling module 'cf_cordic_v_32_32_32_16'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3622: compiling module 'cf_cordic_v_32_32_32_51'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3728: compiling module 'cf_cordic_v_32_32_32_52'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2049: compiling module 'cf_cordic_v_32_32_32_26'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3508: compiling module 'cf_cordic_v_32_32_32_49'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3600: compiling module 'cf_cordic_v_32_32_32_50'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2720: compiling module 'cf_cordic_v_32_32_32_36'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3406: compiling module 'cf_cordic_v_32_32_32_47'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3486: compiling module 'cf_cordic_v_32_32_32_48'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3328: compiling module 'cf_cordic_v_32_32_32_46'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3236: compiling module 'cf_cordic_v_32_32_32_44'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3300: compiling module 'cf_cordic_v_32_32_32_45'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3145: compiling module 'cf_cordic_v_32_32_32_42'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3209: compiling module 'cf_cordic_v_32_32_32_43'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3055: compiling module 'cf_cordic_v_32_32_32_40'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:3119: compiling module 'cf_cordic_v_32_32_32_41'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2957: compiling module 'cf_cordic_v_32_32_32_39'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2861: compiling module 'cf_cordic_v_32_32_32_38'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2767: compiling module 'cf_cordic_v_32_32_32_37'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2621: compiling module 'cf_cordic_v_32_32_32_34'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2685: compiling module 'cf_cordic_v_32_32_32_35'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2523: compiling module 'cf_cordic_v_32_32_32_32'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2587: compiling module 'cf_cordic_v_32_32_32_33'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2426: compiling module 'cf_cordic_v_32_32_32_30'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2490: compiling module 'cf_cordic_v_32_32_32_31'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2314: compiling module 'cf_cordic_v_32_32_32_29'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2204: compiling module 'cf_cordic_v_32_32_32_28'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2096: compiling module 'cf_cordic_v_32_32_32_27'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1943: compiling module 'cf_cordic_v_32_32_32_24'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:2007: compiling module 'cf_cordic_v_32_32_32_25'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1838: compiling module 'cf_cordic_v_32_32_32_22'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1902: compiling module 'cf_cordic_v_32_32_32_23'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1734: compiling module 'cf_cordic_v_32_32_32_20'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1798: compiling module 'cf_cordic_v_32_32_32_21'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1608: compiling module 'cf_cordic_v_32_32_32_19'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1484: compiling module 'cf_cordic_v_32_32_32_18'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1362: compiling module 'cf_cordic_v_32_32_32_17'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1202: compiling module 'cf_cordic_v_32_32_32_14'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1266: compiling module 'cf_cordic_v_32_32_32_15'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1090: compiling module 'cf_cordic_v_32_32_32_12'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1154: compiling module 'cf_cordic_v_32_32_32_13'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:979: compiling module 'cf_cordic_v_32_32_32_10'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:1043: compiling module 'cf_cordic_v_32_32_32_11'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:839: compiling module 'cf_cordic_v_32_32_32_9'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:701: compiling module 'cf_cordic_v_32_32_32_8'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:565: compiling module 'cf_cordic_v_32_32_32_7'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:386: compiling module 'cf_cordic_v_32_32_32_5'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:260: compiling module 'cf_cordic_v_32_32_32_4'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:205: compiling module 'cf_cordic_v_32_32_32_3'
VERIFIC-INFO [VERI-1018] cf_cordic_v_32_32_32.v:151: compiling module 'cf_cordic_v_32_32_32_2'
Importing module cf_cordic_v_32_32_32.
Importing module cf_cordic_v_32_32_32_1.
Importing module cf_cordic_v_32_32_32_2.
Importing module cf_cordic_v_32_32_32_3.
Importing module cf_cordic_v_32_32_32_4.
Importing module cf_cordic_v_32_32_32_5.
Importing module cf_cordic_v_32_32_32_55.
Importing module cf_cordic_v_32_32_32_56.
Importing module cf_cordic_v_32_32_32_6.
Importing module cf_cordic_v_32_32_32_10.
Importing module cf_cordic_v_32_32_32_11.
Importing module cf_cordic_v_32_32_32_12.
Importing module cf_cordic_v_32_32_32_13.
Importing module cf_cordic_v_32_32_32_14.
Importing module cf_cordic_v_32_32_32_15.
Importing module cf_cordic_v_32_32_32_16.
Importing module cf_cordic_v_32_32_32_17.
Importing module cf_cordic_v_32_32_32_18.
Importing module cf_cordic_v_32_32_32_19.
Importing module cf_cordic_v_32_32_32_20.
Importing module cf_cordic_v_32_32_32_21.
Importing module cf_cordic_v_32_32_32_22.
Importing module cf_cordic_v_32_32_32_23.
Importing module cf_cordic_v_32_32_32_24.
Importing module cf_cordic_v_32_32_32_25.
Importing module cf_cordic_v_32_32_32_26.
Importing module cf_cordic_v_32_32_32_27.
Importing module cf_cordic_v_32_32_32_28.
Importing module cf_cordic_v_32_32_32_29.
Importing module cf_cordic_v_32_32_32_30.
Importing module cf_cordic_v_32_32_32_31.
Importing module cf_cordic_v_32_32_32_32.
Importing module cf_cordic_v_32_32_32_33.
Importing module cf_cordic_v_32_32_32_34.
Importing module cf_cordic_v_32_32_32_35.
Importing module cf_cordic_v_32_32_32_36.
Importing module cf_cordic_v_32_32_32_37.
Importing module cf_cordic_v_32_32_32_38.
Importing module cf_cordic_v_32_32_32_39.
Importing module cf_cordic_v_32_32_32_40.
Importing module cf_cordic_v_32_32_32_41.
Importing module cf_cordic_v_32_32_32_42.
Importing module cf_cordic_v_32_32_32_43.
Importing module cf_cordic_v_32_32_32_44.
Importing module cf_cordic_v_32_32_32_45.
Importing module cf_cordic_v_32_32_32_46.
Importing module cf_cordic_v_32_32_32_47.
Importing module cf_cordic_v_32_32_32_48.
Importing module cf_cordic_v_32_32_32_49.
Importing module cf_cordic_v_32_32_32_50.
Importing module cf_cordic_v_32_32_32_51.
Importing module cf_cordic_v_32_32_32_52.
Importing module cf_cordic_v_32_32_32_53.
Importing module cf_cordic_v_32_32_32_54.
Importing module cf_cordic_v_32_32_32_7.
Importing module cf_cordic_v_32_32_32_8.
Importing module cf_cordic_v_32_32_32_9.

3.4.1. Analyzing design hierarchy..
Top module:  \cf_cordic_v_32_32_32
Used module:     \cf_cordic_v_32_32_32_1
Used module:         \cf_cordic_v_32_32_32_2
Used module:         \cf_cordic_v_32_32_32_3
Used module:         \cf_cordic_v_32_32_32_4
Used module:             \cf_cordic_v_32_32_32_56
Used module:         \cf_cordic_v_32_32_32_5
Used module:         \cf_cordic_v_32_32_32_6
Used module:             \cf_cordic_v_32_32_32_7
Used module:             \cf_cordic_v_32_32_32_8
Used module:             \cf_cordic_v_32_32_32_9
Used module:             \cf_cordic_v_32_32_32_10
Used module:                 \cf_cordic_v_32_32_32_11
Used module:             \cf_cordic_v_32_32_32_12
Used module:                 \cf_cordic_v_32_32_32_13
Used module:             \cf_cordic_v_32_32_32_14
Used module:                 \cf_cordic_v_32_32_32_15
Used module:             \cf_cordic_v_32_32_32_16
Used module:                 \cf_cordic_v_32_32_32_17
Used module:                     \cf_cordic_v_32_32_32_54
Used module:                 \cf_cordic_v_32_32_32_18
Used module:                 \cf_cordic_v_32_32_32_19
Used module:                 \cf_cordic_v_32_32_32_20
Used module:                     \cf_cordic_v_32_32_32_21
Used module:                 \cf_cordic_v_32_32_32_22
Used module:                     \cf_cordic_v_32_32_32_23
Used module:                 \cf_cordic_v_32_32_32_24
Used module:                     \cf_cordic_v_32_32_32_25
Used module:                 \cf_cordic_v_32_32_32_26
Used module:                     \cf_cordic_v_32_32_32_27
Used module:                         \cf_cordic_v_32_32_32_52
Used module:                     \cf_cordic_v_32_32_32_28
Used module:                     \cf_cordic_v_32_32_32_29
Used module:                     \cf_cordic_v_32_32_32_30
Used module:                         \cf_cordic_v_32_32_32_31
Used module:                     \cf_cordic_v_32_32_32_32
Used module:                         \cf_cordic_v_32_32_32_33
Used module:                     \cf_cordic_v_32_32_32_34
Used module:                         \cf_cordic_v_32_32_32_35
Used module:                     \cf_cordic_v_32_32_32_36
Used module:                         \cf_cordic_v_32_32_32_37
Used module:                             \cf_cordic_v_32_32_32_50
Used module:                         \cf_cordic_v_32_32_32_38
Used module:                         \cf_cordic_v_32_32_32_39
Used module:                         \cf_cordic_v_32_32_32_40
Used module:                             \cf_cordic_v_32_32_32_41
Used module:                         \cf_cordic_v_32_32_32_42
Used module:                             \cf_cordic_v_32_32_32_43
Used module:                         \cf_cordic_v_32_32_32_44
Used module:                             \cf_cordic_v_32_32_32_45
Used module:                         \cf_cordic_v_32_32_32_46
Used module:                             \cf_cordic_v_32_32_32_48
Used module:                         \cf_cordic_v_32_32_32_47
Used module:                     \cf_cordic_v_32_32_32_49
Used module:                 \cf_cordic_v_32_32_32_51
Used module:             \cf_cordic_v_32_32_32_53
Used module:         \cf_cordic_v_32_32_32_55

3.4.2. Analyzing design hierarchy..
Top module:  \cf_cordic_v_32_32_32
Used module:     \cf_cordic_v_32_32_32_1
Used module:         \cf_cordic_v_32_32_32_2
Used module:         \cf_cordic_v_32_32_32_3
Used module:         \cf_cordic_v_32_32_32_4
Used module:             \cf_cordic_v_32_32_32_56
Used module:         \cf_cordic_v_32_32_32_5
Used module:         \cf_cordic_v_32_32_32_6
Used module:             \cf_cordic_v_32_32_32_7
Used module:             \cf_cordic_v_32_32_32_8
Used module:             \cf_cordic_v_32_32_32_9
Used module:             \cf_cordic_v_32_32_32_10
Used module:                 \cf_cordic_v_32_32_32_11
Used module:             \cf_cordic_v_32_32_32_12
Used module:                 \cf_cordic_v_32_32_32_13
Used module:             \cf_cordic_v_32_32_32_14
Used module:                 \cf_cordic_v_32_32_32_15
Used module:             \cf_cordic_v_32_32_32_16
Used module:                 \cf_cordic_v_32_32_32_17
Used module:                     \cf_cordic_v_32_32_32_54
Used module:                 \cf_cordic_v_32_32_32_18
Used module:                 \cf_cordic_v_32_32_32_19
Used module:                 \cf_cordic_v_32_32_32_20
Used module:                     \cf_cordic_v_32_32_32_21
Used module:                 \cf_cordic_v_32_32_32_22
Used module:                     \cf_cordic_v_32_32_32_23
Used module:                 \cf_cordic_v_32_32_32_24
Used module:                     \cf_cordic_v_32_32_32_25
Used module:                 \cf_cordic_v_32_32_32_26
Used module:                     \cf_cordic_v_32_32_32_27
Used module:                         \cf_cordic_v_32_32_32_52
Used module:                     \cf_cordic_v_32_32_32_28
Used module:                     \cf_cordic_v_32_32_32_29
Used module:                     \cf_cordic_v_32_32_32_30
Used module:                         \cf_cordic_v_32_32_32_31
Used module:                     \cf_cordic_v_32_32_32_32
Used module:                         \cf_cordic_v_32_32_32_33
Used module:                     \cf_cordic_v_32_32_32_34
Used module:                         \cf_cordic_v_32_32_32_35
Used module:                     \cf_cordic_v_32_32_32_36
Used module:                         \cf_cordic_v_32_32_32_37
Used module:                             \cf_cordic_v_32_32_32_50
Used module:                         \cf_cordic_v_32_32_32_38
Used module:                         \cf_cordic_v_32_32_32_39
Used module:                         \cf_cordic_v_32_32_32_40
Used module:                             \cf_cordic_v_32_32_32_41
Used module:                         \cf_cordic_v_32_32_32_42
Used module:                             \cf_cordic_v_32_32_32_43
Used module:                         \cf_cordic_v_32_32_32_44
Used module:                             \cf_cordic_v_32_32_32_45
Used module:                         \cf_cordic_v_32_32_32_46
Used module:                             \cf_cordic_v_32_32_32_48
Used module:                         \cf_cordic_v_32_32_32_47
Used module:                     \cf_cordic_v_32_32_32_49
Used module:                 \cf_cordic_v_32_32_32_51
Used module:             \cf_cordic_v_32_32_32_53
Used module:         \cf_cordic_v_32_32_32_55
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32_9.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_8.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_7.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_54.
Optimizing module cf_cordic_v_32_32_32_53.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_52.
Optimizing module cf_cordic_v_32_32_32_51.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_50.
Optimizing module cf_cordic_v_32_32_32_49.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_48.
Optimizing module cf_cordic_v_32_32_32_47.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_46.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_45.
Optimizing module cf_cordic_v_32_32_32_44.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_43.
Optimizing module cf_cordic_v_32_32_32_42.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_41.
Optimizing module cf_cordic_v_32_32_32_40.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_39.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_38.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_37.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_36.
Optimizing module cf_cordic_v_32_32_32_35.
Optimizing module cf_cordic_v_32_32_32_34.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_33.
Optimizing module cf_cordic_v_32_32_32_32.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_31.
Optimizing module cf_cordic_v_32_32_32_30.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_29.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_28.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_27.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_26.
Optimizing module cf_cordic_v_32_32_32_25.
Optimizing module cf_cordic_v_32_32_32_24.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_23.
Optimizing module cf_cordic_v_32_32_32_22.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_21.
Optimizing module cf_cordic_v_32_32_32_20.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_19.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_18.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_17.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_16.
Optimizing module cf_cordic_v_32_32_32_15.
Optimizing module cf_cordic_v_32_32_32_14.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_13.
Optimizing module cf_cordic_v_32_32_32_12.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_11.
Optimizing module cf_cordic_v_32_32_32_10.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_6.
Optimizing module cf_cordic_v_32_32_32_56.
<suppressed ~1 debug messages>
Optimizing module cf_cordic_v_32_32_32_55.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_5.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_4.
<suppressed ~2 debug messages>
Optimizing module cf_cordic_v_32_32_32_3.
<suppressed ~4 debug messages>
Optimizing module cf_cordic_v_32_32_32_2.
<suppressed ~1 debug messages>
Optimizing module cf_cordic_v_32_32_32_1.
<suppressed ~1 debug messages>
Optimizing module cf_cordic_v_32_32_32.

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module cf_cordic_v_32_32_32_1.
Deleting now unused module cf_cordic_v_32_32_32_10.
Deleting now unused module cf_cordic_v_32_32_32_11.
Deleting now unused module cf_cordic_v_32_32_32_12.
Deleting now unused module cf_cordic_v_32_32_32_13.
Deleting now unused module cf_cordic_v_32_32_32_14.
Deleting now unused module cf_cordic_v_32_32_32_15.
Deleting now unused module cf_cordic_v_32_32_32_16.
Deleting now unused module cf_cordic_v_32_32_32_17.
Deleting now unused module cf_cordic_v_32_32_32_18.
Deleting now unused module cf_cordic_v_32_32_32_19.
Deleting now unused module cf_cordic_v_32_32_32_2.
Deleting now unused module cf_cordic_v_32_32_32_20.
Deleting now unused module cf_cordic_v_32_32_32_21.
Deleting now unused module cf_cordic_v_32_32_32_22.
Deleting now unused module cf_cordic_v_32_32_32_23.
Deleting now unused module cf_cordic_v_32_32_32_24.
Deleting now unused module cf_cordic_v_32_32_32_25.
Deleting now unused module cf_cordic_v_32_32_32_26.
Deleting now unused module cf_cordic_v_32_32_32_27.
Deleting now unused module cf_cordic_v_32_32_32_28.
Deleting now unused module cf_cordic_v_32_32_32_29.
Deleting now unused module cf_cordic_v_32_32_32_3.
Deleting now unused module cf_cordic_v_32_32_32_30.
Deleting now unused module cf_cordic_v_32_32_32_31.
Deleting now unused module cf_cordic_v_32_32_32_32.
Deleting now unused module cf_cordic_v_32_32_32_33.
Deleting now unused module cf_cordic_v_32_32_32_34.
Deleting now unused module cf_cordic_v_32_32_32_35.
Deleting now unused module cf_cordic_v_32_32_32_36.
Deleting now unused module cf_cordic_v_32_32_32_37.
Deleting now unused module cf_cordic_v_32_32_32_38.
Deleting now unused module cf_cordic_v_32_32_32_39.
Deleting now unused module cf_cordic_v_32_32_32_4.
Deleting now unused module cf_cordic_v_32_32_32_40.
Deleting now unused module cf_cordic_v_32_32_32_41.
Deleting now unused module cf_cordic_v_32_32_32_42.
Deleting now unused module cf_cordic_v_32_32_32_43.
Deleting now unused module cf_cordic_v_32_32_32_44.
Deleting now unused module cf_cordic_v_32_32_32_45.
Deleting now unused module cf_cordic_v_32_32_32_46.
Deleting now unused module cf_cordic_v_32_32_32_47.
Deleting now unused module cf_cordic_v_32_32_32_48.
Deleting now unused module cf_cordic_v_32_32_32_49.
Deleting now unused module cf_cordic_v_32_32_32_5.
Deleting now unused module cf_cordic_v_32_32_32_50.
Deleting now unused module cf_cordic_v_32_32_32_51.
Deleting now unused module cf_cordic_v_32_32_32_52.
Deleting now unused module cf_cordic_v_32_32_32_53.
Deleting now unused module cf_cordic_v_32_32_32_54.
Deleting now unused module cf_cordic_v_32_32_32_55.
Deleting now unused module cf_cordic_v_32_32_32_56.
Deleting now unused module cf_cordic_v_32_32_32_6.
Deleting now unused module cf_cordic_v_32_32_32_7.
Deleting now unused module cf_cordic_v_32_32_32_8.
Deleting now unused module cf_cordic_v_32_32_32_9.
<suppressed ~135 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
<suppressed ~2 debug messages>

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 0 unused cells and 12290 unused wires.
<suppressed ~2087 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module cf_cordic_v_32_32_32...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
<suppressed ~33 debug messages>

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~102 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s4.$verific$mux_11$cf_cordic_v_32_32_32.v:3960$1543 in front of them:
        $flatten\s1.\s4.$verific$add_7$cf_cordic_v_32_32_32.v:3958$1539
        $flatten\s1.\s4.$verific$sub_9$cf_cordic_v_32_32_32.v:3959$1541

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s4.$verific$mux_31$cf_cordic_v_32_32_32.v:4003$1560 in front of them:
        $flatten\s1.\s4.$verific$sub_29$cf_cordic_v_32_32_32.v:4002$1558
        $flatten\s1.\s4.$verific$add_27$cf_cordic_v_32_32_32.v:4001$1556

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s4.$verific$mux_46$cf_cordic_v_32_32_32.v:4013$1571 in front of them:
        $flatten\s1.\s4.$verific$add_42$cf_cordic_v_32_32_32.v:4011$1567
        $flatten\s1.\s4.$verific$sub_44$cf_cordic_v_32_32_32.v:4012$1569

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s1.$verific$mux_10$cf_cordic_v_32_32_32.v:3810$12817 in front of them:
        $flatten\s1.\s5.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3808$12813
        $flatten\s1.\s5.\s1.$verific$sub_8$cf_cordic_v_32_32_32.v:3809$12815

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s1.$verific$mux_29$cf_cordic_v_32_32_32.v:3845$12833 in front of them:
        $flatten\s1.\s5.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3844$12831
        $flatten\s1.\s5.\s1.$verific$add_25$cf_cordic_v_32_32_32.v:3843$12829

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s1.$verific$mux_44$cf_cordic_v_32_32_32.v:3855$12844 in front of them:
        $flatten\s1.\s5.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3853$12840
        $flatten\s1.\s5.\s1.$verific$sub_42$cf_cordic_v_32_32_32.v:3854$12842

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s1.$verific$mux_10$cf_cordic_v_32_32_32.v:3675$12663 in front of them:
        $flatten\s1.\s5.\s2.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3673$12659
        $flatten\s1.\s5.\s2.\s1.$verific$sub_8$cf_cordic_v_32_32_32.v:3674$12661

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s1.$verific$mux_29$cf_cordic_v_32_32_32.v:3703$12679 in front of them:
        $flatten\s1.\s5.\s2.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3702$12677
        $flatten\s1.\s5.\s2.\s1.$verific$add_25$cf_cordic_v_32_32_32.v:3701$12675

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s1.$verific$mux_44$cf_cordic_v_32_32_32.v:3713$12690 in front of them:
        $flatten\s1.\s5.\s2.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3711$12686
        $flatten\s1.\s5.\s2.\s1.$verific$sub_42$cf_cordic_v_32_32_32.v:3712$12688

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s1.$verific$mux_10$cf_cordic_v_32_32_32.v:3554$12488 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3552$12484
        $flatten\s1.\s5.\s2.\s2.\s1.$verific$sub_8$cf_cordic_v_32_32_32.v:3553$12486

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s1.$verific$mux_29$cf_cordic_v_32_32_32.v:3575$12504 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3574$12502
        $flatten\s1.\s5.\s2.\s2.\s1.$verific$add_25$cf_cordic_v_32_32_32.v:3573$12500

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s1.$verific$mux_44$cf_cordic_v_32_32_32.v:3585$12515 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3583$12511
        $flatten\s1.\s5.\s2.\s2.\s1.$verific$sub_42$cf_cordic_v_32_32_32.v:3584$12513

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$mux_11$cf_cordic_v_32_32_32.v:3447$12291 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$add_7$cf_cordic_v_32_32_32.v:3445$12287
        $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$sub_9$cf_cordic_v_32_32_32.v:3446$12289

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$mux_31$cf_cordic_v_32_32_32.v:3461$12308 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$sub_29$cf_cordic_v_32_32_32.v:3460$12306
        $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$add_27$cf_cordic_v_32_32_32.v:3459$12304

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$mux_10$cf_cordic_v_32_32_32.v:3367$12128 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$add_6$cf_cordic_v_32_32_32.v:3365$12124
        $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$sub_8$cf_cordic_v_32_32_32.v:3366$12126

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$mux_29$cf_cordic_v_32_32_32.v:3381$12144 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$sub_27$cf_cordic_v_32_32_32.v:3380$12142
        $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$add_25$cf_cordic_v_32_32_32.v:3379$12140

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$mux_44$cf_cordic_v_32_32_32.v:3391$12155 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$add_40$cf_cordic_v_32_32_32.v:3389$12151
        $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$sub_42$cf_cordic_v_32_32_32.v:3390$12153

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$mux_23$cf_cordic_v_32_32_32.v:3275$11880 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:3274$11878
        $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$add_19$cf_cordic_v_32_32_32.v:3273$11876

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$mux_38$cf_cordic_v_32_32_32.v:3285$11891 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:3283$11887
        $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$sub_36$cf_cordic_v_32_32_32.v:3284$11889

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$mux_7$cf_cordic_v_32_32_32.v:3265$11867 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:3263$11863
        $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$sub_5$cf_cordic_v_32_32_32.v:3264$11865

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$mux_23$cf_cordic_v_32_32_32.v:3184$11623 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:3183$11621
        $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$add_19$cf_cordic_v_32_32_32.v:3182$11619

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$mux_38$cf_cordic_v_32_32_32.v:3194$11634 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:3192$11630
        $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$sub_36$cf_cordic_v_32_32_32.v:3193$11632

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$mux_7$cf_cordic_v_32_32_32.v:3174$11610 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:3172$11606
        $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$sub_5$cf_cordic_v_32_32_32.v:3173$11608

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$mux_23$cf_cordic_v_32_32_32.v:3094$11367 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:3093$11365
        $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$add_19$cf_cordic_v_32_32_32.v:3092$11363

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$mux_38$cf_cordic_v_32_32_32.v:3104$11378 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:3102$11374
        $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$sub_36$cf_cordic_v_32_32_32.v:3103$11376

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$mux_7$cf_cordic_v_32_32_32.v:3084$11354 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:3082$11350
        $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$sub_5$cf_cordic_v_32_32_32.v:3083$11352

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$mux_13$cf_cordic_v_32_32_32.v:3009$11204 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:3007$11200
        $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$sub_11$cf_cordic_v_32_32_32.v:3008$11202

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$mux_35$cf_cordic_v_32_32_32.v:3030$11223 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:3029$11221
        $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$add_31$cf_cordic_v_32_32_32.v:3028$11219

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$mux_50$cf_cordic_v_32_32_32.v:3040$11234 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:3038$11230
        $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$sub_48$cf_cordic_v_32_32_32.v:3039$11232

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$mux_12$cf_cordic_v_32_32_32.v:2911$11049 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:2909$11045
        $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$sub_10$cf_cordic_v_32_32_32.v:2910$11047

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$mux_33$cf_cordic_v_32_32_32.v:2932$11067 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:2931$11065
        $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$add_29$cf_cordic_v_32_32_32.v:2930$11063

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$mux_48$cf_cordic_v_32_32_32.v:2942$11078 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:2940$11074
        $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$sub_46$cf_cordic_v_32_32_32.v:2941$11076

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$mux_11$cf_cordic_v_32_32_32.v:2815$10896 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:2813$10892
        $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$sub_9$cf_cordic_v_32_32_32.v:2814$10894

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$mux_31$cf_cordic_v_32_32_32.v:2836$10913 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:2835$10911
        $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$add_27$cf_cordic_v_32_32_32.v:2834$10909

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$mux_46$cf_cordic_v_32_32_32.v:2846$10924 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:2844$10920
        $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$sub_44$cf_cordic_v_32_32_32.v:2845$10922

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s3.$verific$mux_23$cf_cordic_v_32_32_32.v:2660$9091 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:2659$9089
        $flatten\s1.\s5.\s2.\s2.\s3.$verific$add_19$cf_cordic_v_32_32_32.v:2658$9087

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s3.$verific$mux_38$cf_cordic_v_32_32_32.v:2670$9102 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:2668$9098
        $flatten\s1.\s5.\s2.\s2.\s3.$verific$sub_36$cf_cordic_v_32_32_32.v:2669$9100

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s3.$verific$mux_7$cf_cordic_v_32_32_32.v:2650$9078 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:2648$9074
        $flatten\s1.\s5.\s2.\s2.\s3.$verific$sub_5$cf_cordic_v_32_32_32.v:2649$9076

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s4.$verific$mux_23$cf_cordic_v_32_32_32.v:2562$8841 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:2561$8839
        $flatten\s1.\s5.\s2.\s2.\s4.$verific$add_19$cf_cordic_v_32_32_32.v:2560$8837

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s4.$verific$mux_38$cf_cordic_v_32_32_32.v:2572$8852 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:2570$8848
        $flatten\s1.\s5.\s2.\s2.\s4.$verific$sub_36$cf_cordic_v_32_32_32.v:2571$8850

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s4.$verific$mux_7$cf_cordic_v_32_32_32.v:2552$8828 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:2550$8824
        $flatten\s1.\s5.\s2.\s2.\s4.$verific$sub_5$cf_cordic_v_32_32_32.v:2551$8826

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s5.$verific$mux_23$cf_cordic_v_32_32_32.v:2465$8592 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:2464$8590
        $flatten\s1.\s5.\s2.\s2.\s5.$verific$add_19$cf_cordic_v_32_32_32.v:2463$8588

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s5.$verific$mux_38$cf_cordic_v_32_32_32.v:2475$8603 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:2473$8599
        $flatten\s1.\s5.\s2.\s2.\s5.$verific$sub_36$cf_cordic_v_32_32_32.v:2474$8601

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s5.$verific$mux_7$cf_cordic_v_32_32_32.v:2455$8579 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:2453$8575
        $flatten\s1.\s5.\s2.\s2.\s5.$verific$sub_5$cf_cordic_v_32_32_32.v:2454$8577

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s6.$verific$mux_13$cf_cordic_v_32_32_32.v:2373$8443 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:2371$8439
        $flatten\s1.\s5.\s2.\s2.\s6.$verific$sub_11$cf_cordic_v_32_32_32.v:2372$8441

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s6.$verific$mux_35$cf_cordic_v_32_32_32.v:2401$8462 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:2400$8460
        $flatten\s1.\s5.\s2.\s2.\s6.$verific$add_31$cf_cordic_v_32_32_32.v:2399$8458

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s6.$verific$mux_50$cf_cordic_v_32_32_32.v:2411$8473 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:2409$8469
        $flatten\s1.\s5.\s2.\s2.\s6.$verific$sub_48$cf_cordic_v_32_32_32.v:2410$8471

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s7.$verific$mux_12$cf_cordic_v_32_32_32.v:2261$8302 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:2259$8298
        $flatten\s1.\s5.\s2.\s2.\s7.$verific$sub_10$cf_cordic_v_32_32_32.v:2260$8300

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s7.$verific$mux_33$cf_cordic_v_32_32_32.v:2289$8320 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:2288$8318
        $flatten\s1.\s5.\s2.\s2.\s7.$verific$add_29$cf_cordic_v_32_32_32.v:2287$8316

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s7.$verific$mux_48$cf_cordic_v_32_32_32.v:2299$8331 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:2297$8327
        $flatten\s1.\s5.\s2.\s2.\s7.$verific$sub_46$cf_cordic_v_32_32_32.v:2298$8329

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s8.$verific$mux_11$cf_cordic_v_32_32_32.v:2151$8163 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:2149$8159
        $flatten\s1.\s5.\s2.\s2.\s8.$verific$sub_9$cf_cordic_v_32_32_32.v:2150$8161

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s8.$verific$mux_31$cf_cordic_v_32_32_32.v:2179$8180 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:2178$8178
        $flatten\s1.\s5.\s2.\s2.\s8.$verific$add_27$cf_cordic_v_32_32_32.v:2177$8176

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s2.\s8.$verific$mux_46$cf_cordic_v_32_32_32.v:2189$8191 in front of them:
        $flatten\s1.\s5.\s2.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:2187$8187
        $flatten\s1.\s5.\s2.\s2.\s8.$verific$sub_44$cf_cordic_v_32_32_32.v:2188$8189

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s3.$verific$mux_23$cf_cordic_v_32_32_32.v:1982$6365 in front of them:
        $flatten\s1.\s5.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:1981$6363
        $flatten\s1.\s5.\s2.\s3.$verific$add_19$cf_cordic_v_32_32_32.v:1980$6361

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s3.$verific$mux_38$cf_cordic_v_32_32_32.v:1992$6376 in front of them:
        $flatten\s1.\s5.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:1990$6372
        $flatten\s1.\s5.\s2.\s3.$verific$sub_36$cf_cordic_v_32_32_32.v:1991$6374

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s3.$verific$mux_7$cf_cordic_v_32_32_32.v:1972$6352 in front of them:
        $flatten\s1.\s5.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:1970$6348
        $flatten\s1.\s5.\s2.\s3.$verific$sub_5$cf_cordic_v_32_32_32.v:1971$6350

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s4.$verific$mux_23$cf_cordic_v_32_32_32.v:1877$6122 in front of them:
        $flatten\s1.\s5.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:1876$6120
        $flatten\s1.\s5.\s2.\s4.$verific$add_19$cf_cordic_v_32_32_32.v:1875$6118

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s4.$verific$mux_38$cf_cordic_v_32_32_32.v:1887$6133 in front of them:
        $flatten\s1.\s5.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:1885$6129
        $flatten\s1.\s5.\s2.\s4.$verific$sub_36$cf_cordic_v_32_32_32.v:1886$6131

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s4.$verific$mux_7$cf_cordic_v_32_32_32.v:1867$6109 in front of them:
        $flatten\s1.\s5.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:1865$6105
        $flatten\s1.\s5.\s2.\s4.$verific$sub_5$cf_cordic_v_32_32_32.v:1866$6107

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s5.$verific$mux_23$cf_cordic_v_32_32_32.v:1773$5880 in front of them:
        $flatten\s1.\s5.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:1772$5878
        $flatten\s1.\s5.\s2.\s5.$verific$add_19$cf_cordic_v_32_32_32.v:1771$5876

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s5.$verific$mux_38$cf_cordic_v_32_32_32.v:1783$5891 in front of them:
        $flatten\s1.\s5.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:1781$5887
        $flatten\s1.\s5.\s2.\s5.$verific$sub_36$cf_cordic_v_32_32_32.v:1782$5889

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s5.$verific$mux_7$cf_cordic_v_32_32_32.v:1763$5867 in front of them:
        $flatten\s1.\s5.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:1761$5863
        $flatten\s1.\s5.\s2.\s5.$verific$sub_5$cf_cordic_v_32_32_32.v:1762$5865

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s6.$verific$mux_13$cf_cordic_v_32_32_32.v:1674$5745 in front of them:
        $flatten\s1.\s5.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:1672$5741
        $flatten\s1.\s5.\s2.\s6.$verific$sub_11$cf_cordic_v_32_32_32.v:1673$5743

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s6.$verific$mux_35$cf_cordic_v_32_32_32.v:1709$5764 in front of them:
        $flatten\s1.\s5.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:1708$5762
        $flatten\s1.\s5.\s2.\s6.$verific$add_31$cf_cordic_v_32_32_32.v:1707$5760

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s6.$verific$mux_50$cf_cordic_v_32_32_32.v:1719$5775 in front of them:
        $flatten\s1.\s5.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:1717$5771
        $flatten\s1.\s5.\s2.\s6.$verific$sub_48$cf_cordic_v_32_32_32.v:1718$5773

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s7.$verific$mux_12$cf_cordic_v_32_32_32.v:1548$5618 in front of them:
        $flatten\s1.\s5.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:1546$5614
        $flatten\s1.\s5.\s2.\s7.$verific$sub_10$cf_cordic_v_32_32_32.v:1547$5616

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s7.$verific$mux_33$cf_cordic_v_32_32_32.v:1583$5636 in front of them:
        $flatten\s1.\s5.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:1582$5634
        $flatten\s1.\s5.\s2.\s7.$verific$add_29$cf_cordic_v_32_32_32.v:1581$5632

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s7.$verific$mux_48$cf_cordic_v_32_32_32.v:1593$5647 in front of them:
        $flatten\s1.\s5.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:1591$5643
        $flatten\s1.\s5.\s2.\s7.$verific$sub_46$cf_cordic_v_32_32_32.v:1592$5645

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s8.$verific$mux_11$cf_cordic_v_32_32_32.v:1424$5493 in front of them:
        $flatten\s1.\s5.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:1422$5489
        $flatten\s1.\s5.\s2.\s8.$verific$sub_9$cf_cordic_v_32_32_32.v:1423$5491

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s8.$verific$mux_31$cf_cordic_v_32_32_32.v:1459$5510 in front of them:
        $flatten\s1.\s5.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:1458$5508
        $flatten\s1.\s5.\s2.\s8.$verific$add_27$cf_cordic_v_32_32_32.v:1457$5506

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s2.\s8.$verific$mux_46$cf_cordic_v_32_32_32.v:1469$5521 in front of them:
        $flatten\s1.\s5.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:1467$5517
        $flatten\s1.\s5.\s2.\s8.$verific$sub_44$cf_cordic_v_32_32_32.v:1468$5519

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s3.$verific$mux_23$cf_cordic_v_32_32_32.v:1241$3704 in front of them:
        $flatten\s1.\s5.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:1240$3702
        $flatten\s1.\s5.\s3.$verific$add_19$cf_cordic_v_32_32_32.v:1239$3700

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s3.$verific$mux_38$cf_cordic_v_32_32_32.v:1251$3715 in front of them:
        $flatten\s1.\s5.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:1249$3711
        $flatten\s1.\s5.\s3.$verific$sub_36$cf_cordic_v_32_32_32.v:1250$3713

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s3.$verific$mux_7$cf_cordic_v_32_32_32.v:1231$3691 in front of them:
        $flatten\s1.\s5.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:1229$3687
        $flatten\s1.\s5.\s3.$verific$sub_5$cf_cordic_v_32_32_32.v:1230$3689

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s4.$verific$mux_23$cf_cordic_v_32_32_32.v:1129$3470 in front of them:
        $flatten\s1.\s5.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:1128$3468
        $flatten\s1.\s5.\s4.$verific$add_19$cf_cordic_v_32_32_32.v:1127$3466

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s4.$verific$mux_38$cf_cordic_v_32_32_32.v:1139$3481 in front of them:
        $flatten\s1.\s5.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:1137$3477
        $flatten\s1.\s5.\s4.$verific$sub_36$cf_cordic_v_32_32_32.v:1138$3479

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s4.$verific$mux_7$cf_cordic_v_32_32_32.v:1119$3457 in front of them:
        $flatten\s1.\s5.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:1117$3453
        $flatten\s1.\s5.\s4.$verific$sub_5$cf_cordic_v_32_32_32.v:1118$3455

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s5.$verific$mux_23$cf_cordic_v_32_32_32.v:1018$3237 in front of them:
        $flatten\s1.\s5.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:1017$3235
        $flatten\s1.\s5.\s5.$verific$add_19$cf_cordic_v_32_32_32.v:1016$3233

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s5.$verific$mux_38$cf_cordic_v_32_32_32.v:1028$3248 in front of them:
        $flatten\s1.\s5.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:1026$3244
        $flatten\s1.\s5.\s5.$verific$sub_36$cf_cordic_v_32_32_32.v:1027$3246

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s5.$verific$mux_7$cf_cordic_v_32_32_32.v:1008$3224 in front of them:
        $flatten\s1.\s5.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:1006$3220
        $flatten\s1.\s5.\s5.$verific$sub_5$cf_cordic_v_32_32_32.v:1007$3222

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s6.$verific$mux_14$cf_cordic_v_32_32_32.v:913$13166 in front of them:
        $flatten\s1.\s5.\s6.$verific$add_10$cf_cordic_v_32_32_32.v:911$13162
        $flatten\s1.\s5.\s6.$verific$sub_12$cf_cordic_v_32_32_32.v:912$13164

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s6.$verific$mux_37$cf_cordic_v_32_32_32.v:956$13186 in front of them:
        $flatten\s1.\s5.\s6.$verific$sub_35$cf_cordic_v_32_32_32.v:955$13184
        $flatten\s1.\s5.\s6.$verific$add_33$cf_cordic_v_32_32_32.v:954$13182

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s6.$verific$mux_52$cf_cordic_v_32_32_32.v:966$13197 in front of them:
        $flatten\s1.\s5.\s6.$verific$add_48$cf_cordic_v_32_32_32.v:964$13193
        $flatten\s1.\s5.\s6.$verific$sub_50$cf_cordic_v_32_32_32.v:965$13195

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s7.$verific$mux_13$cf_cordic_v_32_32_32.v:773$13057 in front of them:
        $flatten\s1.\s5.\s7.$verific$add_9$cf_cordic_v_32_32_32.v:771$13053
        $flatten\s1.\s5.\s7.$verific$sub_11$cf_cordic_v_32_32_32.v:772$13055

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s7.$verific$mux_35$cf_cordic_v_32_32_32.v:816$13076 in front of them:
        $flatten\s1.\s5.\s7.$verific$sub_33$cf_cordic_v_32_32_32.v:815$13074
        $flatten\s1.\s5.\s7.$verific$add_31$cf_cordic_v_32_32_32.v:814$13072

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s7.$verific$mux_50$cf_cordic_v_32_32_32.v:826$13087 in front of them:
        $flatten\s1.\s5.\s7.$verific$add_46$cf_cordic_v_32_32_32.v:824$13083
        $flatten\s1.\s5.\s7.$verific$sub_48$cf_cordic_v_32_32_32.v:825$13085

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s8.$verific$mux_12$cf_cordic_v_32_32_32.v:635$12950 in front of them:
        $flatten\s1.\s5.\s8.$verific$add_8$cf_cordic_v_32_32_32.v:633$12946
        $flatten\s1.\s5.\s8.$verific$sub_10$cf_cordic_v_32_32_32.v:634$12948

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s8.$verific$mux_33$cf_cordic_v_32_32_32.v:678$12968 in front of them:
        $flatten\s1.\s5.\s8.$verific$sub_31$cf_cordic_v_32_32_32.v:677$12966
        $flatten\s1.\s5.\s8.$verific$add_29$cf_cordic_v_32_32_32.v:676$12964

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s5.\s8.$verific$mux_48$cf_cordic_v_32_32_32.v:688$12979 in front of them:
        $flatten\s1.\s5.\s8.$verific$add_44$cf_cordic_v_32_32_32.v:686$12975
        $flatten\s1.\s5.\s8.$verific$sub_46$cf_cordic_v_32_32_32.v:687$12977

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s6.$verific$mux_10$cf_cordic_v_32_32_32.v:452$1440 in front of them:
        $flatten\s1.\s6.$verific$add_6$cf_cordic_v_32_32_32.v:450$1436
        $flatten\s1.\s6.$verific$sub_8$cf_cordic_v_32_32_32.v:451$1438

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s6.$verific$mux_29$cf_cordic_v_32_32_32.v:495$1456 in front of them:
        $flatten\s1.\s6.$verific$sub_27$cf_cordic_v_32_32_32.v:494$1454
        $flatten\s1.\s6.$verific$add_25$cf_cordic_v_32_32_32.v:493$1452

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s6.$verific$mux_44$cf_cordic_v_32_32_32.v:505$1467 in front of them:
        $flatten\s1.\s6.$verific$add_40$cf_cordic_v_32_32_32.v:503$1463
        $flatten\s1.\s6.$verific$sub_42$cf_cordic_v_32_32_32.v:504$1465

    Found cells that share an operand and can be merged by moving the $mux $flatten\s1.\s7.$verific$mux_40$cf_cordic_v_32_32_32.v:373$1365 in front of them:
        $flatten\s1.\s7.$verific$add_36$cf_cordic_v_32_32_32.v:371$1361
        $flatten\s1.\s7.$verific$sub_38$cf_cordic_v_32_32_32.v:372$1363


yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\s1.\s8.$verific$n9_reg$cf_cordic_v_32_32_32.v:246$1298 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s8.$verific$n7_reg$cf_cordic_v_32_32_32.v:239$1292 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s8.$verific$n11_reg$cf_cordic_v_32_32_32.v:253$1304 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s7.$verific$n5_reg$cf_cordic_v_32_32_32.v:327$1346 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s7.$verific$n16_reg$cf_cordic_v_32_32_32.v:379$1370 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s7.$verific$n11_reg$cf_cordic_v_32_32_32.v:369$1359 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s6.$verific$n7_reg$cf_cordic_v_32_32_32.v:458$1446 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s6.$verific$n20_reg$cf_cordic_v_32_32_32.v:511$1472 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s6.$verific$n15_reg$cf_cordic_v_32_32_32.v:501$1461 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s8.$verific$n9_reg$cf_cordic_v_32_32_32.v:641$12956 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s8.$verific$n24_reg$cf_cordic_v_32_32_32.v:694$12984 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s8.$verific$n19_reg$cf_cordic_v_32_32_32.v:684$12973 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s7.$verific$n26_reg$cf_cordic_v_32_32_32.v:832$13092 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s7.$verific$n21_reg$cf_cordic_v_32_32_32.v:822$13081 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s7.$verific$n10_reg$cf_cordic_v_32_32_32.v:779$13063 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s6.$verific$n28_reg$cf_cordic_v_32_32_32.v:972$13202 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s6.$verific$n23_reg$cf_cordic_v_32_32_32.v:962$13191 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s6.$verific$n11_reg$cf_cordic_v_32_32_32.v:919$13172 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s5.$verific$n9_reg$cf_cordic_v_32_32_32.v:1024$3242 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s5.$verific$n4_reg$cf_cordic_v_32_32_32.v:1014$3230 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s5.$verific$n14_reg$cf_cordic_v_32_32_32.v:1034$3253 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s4.$verific$n9_reg$cf_cordic_v_32_32_32.v:1135$3475 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s4.$verific$n4_reg$cf_cordic_v_32_32_32.v:1125$3463 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s4.$verific$n14_reg$cf_cordic_v_32_32_32.v:1145$3486 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s3.$verific$n9_reg$cf_cordic_v_32_32_32.v:1247$3709 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s3.$verific$n4_reg$cf_cordic_v_32_32_32.v:1237$3697 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s3.$verific$n14_reg$cf_cordic_v_32_32_32.v:1257$3720 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s8.$verific$n8_reg$cf_cordic_v_32_32_32.v:1430$5499 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s8.$verific$n22_reg$cf_cordic_v_32_32_32.v:1475$5526 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s8.$verific$n17_reg$cf_cordic_v_32_32_32.v:1465$5515 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s7.$verific$n9_reg$cf_cordic_v_32_32_32.v:1554$5624 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s7.$verific$n24_reg$cf_cordic_v_32_32_32.v:1599$5652 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s7.$verific$n19_reg$cf_cordic_v_32_32_32.v:1589$5641 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s6.$verific$n26_reg$cf_cordic_v_32_32_32.v:1725$5780 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s6.$verific$n21_reg$cf_cordic_v_32_32_32.v:1715$5769 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s6.$verific$n10_reg$cf_cordic_v_32_32_32.v:1680$5751 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s5.$verific$n9_reg$cf_cordic_v_32_32_32.v:1779$5885 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s5.$verific$n4_reg$cf_cordic_v_32_32_32.v:1769$5873 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s5.$verific$n14_reg$cf_cordic_v_32_32_32.v:1789$5896 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s4.$verific$n9_reg$cf_cordic_v_32_32_32.v:1883$6127 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s4.$verific$n4_reg$cf_cordic_v_32_32_32.v:1873$6115 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s4.$verific$n14_reg$cf_cordic_v_32_32_32.v:1893$6138 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s3.$verific$n9_reg$cf_cordic_v_32_32_32.v:1988$6370 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s3.$verific$n4_reg$cf_cordic_v_32_32_32.v:1978$6358 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s3.$verific$n14_reg$cf_cordic_v_32_32_32.v:1998$6381 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s8.$verific$n8_reg$cf_cordic_v_32_32_32.v:2157$8169 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s8.$verific$n22_reg$cf_cordic_v_32_32_32.v:2195$8196 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s8.$verific$n17_reg$cf_cordic_v_32_32_32.v:2185$8185 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s7.$verific$n9_reg$cf_cordic_v_32_32_32.v:2267$8308 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s7.$verific$n24_reg$cf_cordic_v_32_32_32.v:2305$8336 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s7.$verific$n19_reg$cf_cordic_v_32_32_32.v:2295$8325 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s6.$verific$n26_reg$cf_cordic_v_32_32_32.v:2417$8478 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s6.$verific$n21_reg$cf_cordic_v_32_32_32.v:2407$8467 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s6.$verific$n10_reg$cf_cordic_v_32_32_32.v:2379$8449 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s5.$verific$n9_reg$cf_cordic_v_32_32_32.v:2471$8597 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s5.$verific$n4_reg$cf_cordic_v_32_32_32.v:2461$8585 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s5.$verific$n14_reg$cf_cordic_v_32_32_32.v:2481$8608 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s4.$verific$n9_reg$cf_cordic_v_32_32_32.v:2568$8846 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s4.$verific$n4_reg$cf_cordic_v_32_32_32.v:2558$8834 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s4.$verific$n14_reg$cf_cordic_v_32_32_32.v:2578$8857 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s3.$verific$n9_reg$cf_cordic_v_32_32_32.v:2666$9096 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s3.$verific$n4_reg$cf_cordic_v_32_32_32.v:2656$9084 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s3.$verific$n14_reg$cf_cordic_v_32_32_32.v:2676$9107 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$n8_reg$cf_cordic_v_32_32_32.v:2821$10902 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$n22_reg$cf_cordic_v_32_32_32.v:2852$10929 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$n17_reg$cf_cordic_v_32_32_32.v:2842$10918 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$n9_reg$cf_cordic_v_32_32_32.v:2917$11055 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$n24_reg$cf_cordic_v_32_32_32.v:2948$11083 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$n19_reg$cf_cordic_v_32_32_32.v:2938$11072 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$n26_reg$cf_cordic_v_32_32_32.v:3046$11239 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$n21_reg$cf_cordic_v_32_32_32.v:3036$11228 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$n10_reg$cf_cordic_v_32_32_32.v:3015$11210 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$n9_reg$cf_cordic_v_32_32_32.v:3100$11372 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$n4_reg$cf_cordic_v_32_32_32.v:3090$11360 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$n14_reg$cf_cordic_v_32_32_32.v:3110$11383 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$n9_reg$cf_cordic_v_32_32_32.v:3190$11628 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$n4_reg$cf_cordic_v_32_32_32.v:3180$11616 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$n14_reg$cf_cordic_v_32_32_32.v:3200$11639 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$n9_reg$cf_cordic_v_32_32_32.v:3281$11885 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$n4_reg$cf_cordic_v_32_32_32.v:3271$11873 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$n14_reg$cf_cordic_v_32_32_32.v:3291$11896 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$n7_reg$cf_cordic_v_32_32_32.v:3373$12134 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$n20_reg$cf_cordic_v_32_32_32.v:3397$12160 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$n15_reg$cf_cordic_v_32_32_32.v:3387$12149 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$n8_reg$cf_cordic_v_32_32_32.v:3453$12297 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$n22_reg$cf_cordic_v_32_32_32.v:3477$12324 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$n17_reg$cf_cordic_v_32_32_32.v:3467$12313 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s1.$verific$n7_reg$cf_cordic_v_32_32_32.v:3560$12494 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s1.$verific$n20_reg$cf_cordic_v_32_32_32.v:3591$12520 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s2.\s1.$verific$n15_reg$cf_cordic_v_32_32_32.v:3581$12509 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s1.$verific$n7_reg$cf_cordic_v_32_32_32.v:3681$12669 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s1.$verific$n20_reg$cf_cordic_v_32_32_32.v:3719$12695 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s2.\s1.$verific$n15_reg$cf_cordic_v_32_32_32.v:3709$12684 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s1.$verific$n7_reg$cf_cordic_v_32_32_32.v:3816$12823 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s1.$verific$n20_reg$cf_cordic_v_32_32_32.v:3861$12849 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s5.\s1.$verific$n15_reg$cf_cordic_v_32_32_32.v:3851$12838 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s4.$verific$n8_reg$cf_cordic_v_32_32_32.v:3966$1549 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s4.$verific$n22_reg$cf_cordic_v_32_32_32.v:4019$1576 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.\s4.$verific$n17_reg$cf_cordic_v_32_32_32.v:4009$1565 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.$verific$n3_reg$cf_cordic_v_32_32_32.v:139$225 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.$verific$n2_reg$cf_cordic_v_32_32_32.v:133$221 ($aldff) from module cf_cordic_v_32_32_32.
Removing never-active async load on $flatten\s1.$verific$n1_reg$cf_cordic_v_32_32_32.v:127$217 ($aldff) from module cf_cordic_v_32_32_32.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 32 unused cells and 218 unused wires.
<suppressed ~250 debug messages>

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
<suppressed ~124 debug messages>

yosys> opt_muxtree

3.25. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~195 debug messages>

yosys> opt_reduce

3.26. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_share

3.28. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.29. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 0 unused cells and 124 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.31. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.32. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.32.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.32.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.32.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.32.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..

yosys> fsm_opt

3.32.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.32.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.32.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.32.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.

yosys> opt_merge -nomux

3.34. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~195 debug messages>

yosys> opt_reduce

3.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_share

3.38. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.39. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\s1.\s8.$verific$n9_reg$cf_cordic_v_32_32_32.v:246$1298 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s8.$verific$n679$1270, Q = \s1.s8.n9).
Adding EN signal on $flatten\s1.\s8.$verific$n7_reg$cf_cordic_v_32_32_32.v:239$1292 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s8.$verific$n445$1266, Q = \s1.s8.n7).
Adding EN signal on $flatten\s1.\s8.$verific$n11_reg$cf_cordic_v_32_32_32.v:253$1304 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s8.$verific$n913$1274, Q = \s1.s8.n11).
Adding EN signal on $flatten\s1.\s7.$verific$n5_reg$cf_cordic_v_32_32_32.v:327$1346 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s7.$verific$n351$1319, Q = \s1.s7.n5).
Adding EN signal on $flatten\s1.\s7.$verific$n16_reg$cf_cordic_v_32_32_32.v:379$1370 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s7.$verific$n1153$1331, Q = \s1.s7.n16).
Adding EN signal on $flatten\s1.\s7.$verific$n11_reg$cf_cordic_v_32_32_32.v:369$1359 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s7.$verific$n753$1325, Q = \s1.s7.n11).
Adding EN signal on $flatten\s1.\s6.$verific$n7_reg$cf_cordic_v_32_32_32.v:458$1446 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s6.$verific$n388$1417, Q = \s1.s6.n7).
Adding EN signal on $flatten\s1.\s6.$verific$n20_reg$cf_cordic_v_32_32_32.v:511$1472 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s6.$verific$n1223$1429, Q = \s1.s6.n20).
Adding EN signal on $flatten\s1.\s6.$verific$n15_reg$cf_cordic_v_32_32_32.v:501$1461 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s6.$verific$n823$1423, Q = \s1.s6.n15).
Adding EN signal on $flatten\s1.\s5.\s8.$verific$n9_reg$cf_cordic_v_32_32_32.v:641$12956 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s8.$verific$n397$12925, Q = \s1.s5.s8.n9).
Adding EN signal on $flatten\s1.\s5.\s8.$verific$n24_reg$cf_cordic_v_32_32_32.v:694$12984 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s8.$verific$n1237$12937, Q = \s1.s5.s8.n24).
Adding EN signal on $flatten\s1.\s5.\s8.$verific$n19_reg$cf_cordic_v_32_32_32.v:684$12973 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s8.$verific$n837$12931, Q = \s1.s5.s8.n19).
Adding EN signal on $flatten\s1.\s5.\s7.$verific$n26_reg$cf_cordic_v_32_32_32.v:832$13092 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s7.$verific$n1247$13043, Q = \s1.s5.s7.n26).
Adding EN signal on $flatten\s1.\s5.\s7.$verific$n21_reg$cf_cordic_v_32_32_32.v:822$13081 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s7.$verific$n847$13037, Q = \s1.s5.s7.n21).
Adding EN signal on $flatten\s1.\s5.\s7.$verific$n10_reg$cf_cordic_v_32_32_32.v:779$13063 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s7.$verific$n403$13031, Q = \s1.s5.s7.n10).
Adding EN signal on $flatten\s1.\s5.\s6.$verific$n28_reg$cf_cordic_v_32_32_32.v:972$13202 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s6.$verific$n1259$13151, Q = \s1.s5.s6.n28).
Adding EN signal on $flatten\s1.\s5.\s6.$verific$n23_reg$cf_cordic_v_32_32_32.v:962$13191 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s6.$verific$n859$13145, Q = \s1.s5.s6.n23).
Adding EN signal on $flatten\s1.\s5.\s6.$verific$n11_reg$cf_cordic_v_32_32_32.v:919$13172 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s6.$verific$n410$13139, Q = \s1.s5.s6.n11).
Adding EN signal on $flatten\s1.\s5.\s5.$verific$n9_reg$cf_cordic_v_32_32_32.v:1024$3242 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s5.$verific$n685$3210, Q = \s1.s5.s5.n9).
Adding EN signal on $flatten\s1.\s5.\s5.$verific$n4_reg$cf_cordic_v_32_32_32.v:1014$3230 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s5.$verific$n316$3204, Q = \s1.s5.s5.n4).
Adding EN signal on $flatten\s1.\s5.\s5.$verific$n14_reg$cf_cordic_v_32_32_32.v:1034$3253 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s5.$verific$n1085$3216, Q = \s1.s5.s5.n14).
Adding EN signal on $flatten\s1.\s5.\s4.$verific$n9_reg$cf_cordic_v_32_32_32.v:1135$3475 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s4.$verific$n685$3443, Q = \s1.s5.s4.n9).
Adding EN signal on $flatten\s1.\s5.\s4.$verific$n4_reg$cf_cordic_v_32_32_32.v:1125$3463 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s4.$verific$n316$3437, Q = \s1.s5.s4.n4).
Adding EN signal on $flatten\s1.\s5.\s4.$verific$n14_reg$cf_cordic_v_32_32_32.v:1145$3486 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s4.$verific$n1085$3449, Q = \s1.s5.s4.n14).
Adding EN signal on $flatten\s1.\s5.\s3.$verific$n9_reg$cf_cordic_v_32_32_32.v:1247$3709 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s3.$verific$n685$3677, Q = \s1.s5.s3.n9).
Adding EN signal on $flatten\s1.\s5.\s3.$verific$n4_reg$cf_cordic_v_32_32_32.v:1237$3697 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s3.$verific$n316$3671, Q = \s1.s5.s3.n4).
Adding EN signal on $flatten\s1.\s5.\s3.$verific$n14_reg$cf_cordic_v_32_32_32.v:1257$3720 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s3.$verific$n1085$3683, Q = \s1.s5.s3.n14).
Adding EN signal on $flatten\s1.\s5.\s2.\s8.$verific$n8_reg$cf_cordic_v_32_32_32.v:1430$5499 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s8.$verific$n392$5469, Q = \s1.s5.s2.s8.n8).
Adding EN signal on $flatten\s1.\s5.\s2.\s8.$verific$n22_reg$cf_cordic_v_32_32_32.v:1475$5526 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s8.$verific$n1229$5481, Q = \s1.s5.s2.s8.n22).
Adding EN signal on $flatten\s1.\s5.\s2.\s8.$verific$n17_reg$cf_cordic_v_32_32_32.v:1465$5515 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s8.$verific$n829$5475, Q = \s1.s5.s2.s8.n17).
Adding EN signal on $flatten\s1.\s5.\s2.\s7.$verific$n9_reg$cf_cordic_v_32_32_32.v:1554$5624 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s7.$verific$n405$5593, Q = \s1.s5.s2.s7.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s7.$verific$n24_reg$cf_cordic_v_32_32_32.v:1599$5652 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s7.$verific$n1253$5605, Q = \s1.s5.s2.s7.n24).
Adding EN signal on $flatten\s1.\s5.\s2.\s7.$verific$n19_reg$cf_cordic_v_32_32_32.v:1589$5641 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s7.$verific$n853$5599, Q = \s1.s5.s2.s7.n19).
Adding EN signal on $flatten\s1.\s5.\s2.\s6.$verific$n26_reg$cf_cordic_v_32_32_32.v:1725$5780 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s6.$verific$n1279$5731, Q = \s1.s5.s2.s6.n26).
Adding EN signal on $flatten\s1.\s5.\s2.\s6.$verific$n21_reg$cf_cordic_v_32_32_32.v:1715$5769 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s6.$verific$n879$5725, Q = \s1.s5.s2.s6.n21).
Adding EN signal on $flatten\s1.\s5.\s2.\s6.$verific$n10_reg$cf_cordic_v_32_32_32.v:1680$5751 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s6.$verific$n419$5719, Q = \s1.s5.s2.s6.n10).
Adding EN signal on $flatten\s1.\s5.\s2.\s5.$verific$n9_reg$cf_cordic_v_32_32_32.v:1779$5885 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s5.$verific$n685$5853, Q = \s1.s5.s2.s5.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s5.$verific$n4_reg$cf_cordic_v_32_32_32.v:1769$5873 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s5.$verific$n316$5847, Q = \s1.s5.s2.s5.n4).
Adding EN signal on $flatten\s1.\s5.\s2.\s5.$verific$n14_reg$cf_cordic_v_32_32_32.v:1789$5896 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s5.$verific$n1085$5859, Q = \s1.s5.s2.s5.n14).
Adding EN signal on $flatten\s1.\s5.\s2.\s4.$verific$n9_reg$cf_cordic_v_32_32_32.v:1883$6127 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s4.$verific$n685$6095, Q = \s1.s5.s2.s4.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s4.$verific$n4_reg$cf_cordic_v_32_32_32.v:1873$6115 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s4.$verific$n316$6089, Q = \s1.s5.s2.s4.n4).
Adding EN signal on $flatten\s1.\s5.\s2.\s4.$verific$n14_reg$cf_cordic_v_32_32_32.v:1893$6138 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s4.$verific$n1085$6101, Q = \s1.s5.s2.s4.n14).
Adding EN signal on $flatten\s1.\s5.\s2.\s3.$verific$n9_reg$cf_cordic_v_32_32_32.v:1988$6370 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s3.$verific$n685$6338, Q = \s1.s5.s2.s3.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s3.$verific$n4_reg$cf_cordic_v_32_32_32.v:1978$6358 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s3.$verific$n316$6332, Q = \s1.s5.s2.s3.n4).
Adding EN signal on $flatten\s1.\s5.\s2.\s3.$verific$n14_reg$cf_cordic_v_32_32_32.v:1998$6381 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s3.$verific$n1085$6344, Q = \s1.s5.s2.s3.n14).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s8.$verific$n8_reg$cf_cordic_v_32_32_32.v:2157$8169 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s8.$verific$n392$8139, Q = \s1.s5.s2.s2.s8.n8).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s8.$verific$n22_reg$cf_cordic_v_32_32_32.v:2195$8196 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s8.$verific$n1229$8151, Q = \s1.s5.s2.s2.s8.n22).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s8.$verific$n17_reg$cf_cordic_v_32_32_32.v:2185$8185 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s8.$verific$n829$8145, Q = \s1.s5.s2.s2.s8.n17).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s7.$verific$n9_reg$cf_cordic_v_32_32_32.v:2267$8308 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s7.$verific$n412$8277, Q = \s1.s5.s2.s2.s7.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s7.$verific$n24_reg$cf_cordic_v_32_32_32.v:2305$8336 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s7.$verific$n1267$8289, Q = \s1.s5.s2.s2.s7.n24).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s7.$verific$n19_reg$cf_cordic_v_32_32_32.v:2295$8325 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s7.$verific$n867$8283, Q = \s1.s5.s2.s2.s7.n19).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s6.$verific$n26_reg$cf_cordic_v_32_32_32.v:2417$8478 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s6.$verific$n1307$8429, Q = \s1.s5.s2.s2.s6.n26).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s6.$verific$n21_reg$cf_cordic_v_32_32_32.v:2407$8467 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s6.$verific$n907$8423, Q = \s1.s5.s2.s2.s6.n21).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s6.$verific$n10_reg$cf_cordic_v_32_32_32.v:2379$8449 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s6.$verific$n433$8417, Q = \s1.s5.s2.s2.s6.n10).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s5.$verific$n9_reg$cf_cordic_v_32_32_32.v:2471$8597 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s5.$verific$n685$8565, Q = \s1.s5.s2.s2.s5.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s5.$verific$n4_reg$cf_cordic_v_32_32_32.v:2461$8585 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s5.$verific$n316$8559, Q = \s1.s5.s2.s2.s5.n4).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s5.$verific$n14_reg$cf_cordic_v_32_32_32.v:2481$8608 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s5.$verific$n1085$8571, Q = \s1.s5.s2.s2.s5.n14).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s4.$verific$n9_reg$cf_cordic_v_32_32_32.v:2568$8846 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s4.$verific$n685$8814, Q = \s1.s5.s2.s2.s4.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s4.$verific$n4_reg$cf_cordic_v_32_32_32.v:2558$8834 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s4.$verific$n316$8808, Q = \s1.s5.s2.s2.s4.n4).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s4.$verific$n14_reg$cf_cordic_v_32_32_32.v:2578$8857 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s4.$verific$n1085$8820, Q = \s1.s5.s2.s2.s4.n14).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s3.$verific$n9_reg$cf_cordic_v_32_32_32.v:2666$9096 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s3.$verific$n685$9064, Q = \s1.s5.s2.s2.s3.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s3.$verific$n4_reg$cf_cordic_v_32_32_32.v:2656$9084 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s3.$verific$n316$9058, Q = \s1.s5.s2.s2.s3.n4).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s3.$verific$n14_reg$cf_cordic_v_32_32_32.v:2676$9107 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s3.$verific$n1085$9070, Q = \s1.s5.s2.s2.s3.n14).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$n8_reg$cf_cordic_v_32_32_32.v:2821$10902 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$n392$10872, Q = \s1.s5.s2.s2.s2.s8.n8).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$n22_reg$cf_cordic_v_32_32_32.v:2852$10929 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$n1229$10884, Q = \s1.s5.s2.s2.s2.s8.n22).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$n17_reg$cf_cordic_v_32_32_32.v:2842$10918 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$n829$10878, Q = \s1.s5.s2.s2.s2.s8.n17).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$n9_reg$cf_cordic_v_32_32_32.v:2917$11055 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$n419$11024, Q = \s1.s5.s2.s2.s2.s7.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$n24_reg$cf_cordic_v_32_32_32.v:2948$11083 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$n1281$11036, Q = \s1.s5.s2.s2.s2.s7.n24).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$n19_reg$cf_cordic_v_32_32_32.v:2938$11072 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$n881$11030, Q = \s1.s5.s2.s2.s2.s7.n19).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$n26_reg$cf_cordic_v_32_32_32.v:3046$11239 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$n1335$11190, Q = \s1.s5.s2.s2.s2.s6.n26).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$n21_reg$cf_cordic_v_32_32_32.v:3036$11228 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$n935$11184, Q = \s1.s5.s2.s2.s2.s6.n21).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$n10_reg$cf_cordic_v_32_32_32.v:3015$11210 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$n447$11178, Q = \s1.s5.s2.s2.s2.s6.n10).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$n9_reg$cf_cordic_v_32_32_32.v:3100$11372 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$n685$11340, Q = \s1.s5.s2.s2.s2.s5.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$n4_reg$cf_cordic_v_32_32_32.v:3090$11360 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$n316$11334, Q = \s1.s5.s2.s2.s2.s5.n4).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$n14_reg$cf_cordic_v_32_32_32.v:3110$11383 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$n1085$11346, Q = \s1.s5.s2.s2.s2.s5.n14).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$n9_reg$cf_cordic_v_32_32_32.v:3190$11628 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$n685$11596, Q = \s1.s5.s2.s2.s2.s4.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$n4_reg$cf_cordic_v_32_32_32.v:3180$11616 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$n316$11590, Q = \s1.s5.s2.s2.s2.s4.n4).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$n14_reg$cf_cordic_v_32_32_32.v:3200$11639 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$n1085$11602, Q = \s1.s5.s2.s2.s2.s4.n14).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$n9_reg$cf_cordic_v_32_32_32.v:3281$11885 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$n685$11853, Q = \s1.s5.s2.s2.s2.s3.n9).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$n4_reg$cf_cordic_v_32_32_32.v:3271$11873 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$n316$11847, Q = \s1.s5.s2.s2.s2.s3.n4).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$n14_reg$cf_cordic_v_32_32_32.v:3291$11896 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$n1085$11859, Q = \s1.s5.s2.s2.s2.s3.n14).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$n7_reg$cf_cordic_v_32_32_32.v:3373$12134 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$n359$12105, Q = \s1.s5.s2.s2.s2.s2.n7).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$n20_reg$cf_cordic_v_32_32_32.v:3397$12160 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$n1165$12117, Q = \s1.s5.s2.s2.s2.s2.n20).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$n15_reg$cf_cordic_v_32_32_32.v:3387$12149 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$n765$12111, Q = \s1.s5.s2.s2.s2.s2.n15).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$n8_reg$cf_cordic_v_32_32_32.v:3453$12297 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$n391$12268, Q = \s1.s5.s2.s2.s2.s1.n8).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$n22_reg$cf_cordic_v_32_32_32.v:3477$12324 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$n1227$12280, Q = \s1.s5.s2.s2.s2.s1.n22).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$n17_reg$cf_cordic_v_32_32_32.v:3467$12313 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$n827$12274, Q = \s1.s5.s2.s2.s2.s1.n17).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s1.$verific$n7_reg$cf_cordic_v_32_32_32.v:3560$12494 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s1.$verific$n366$12465, Q = \s1.s5.s2.s2.s1.n7).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s1.$verific$n20_reg$cf_cordic_v_32_32_32.v:3591$12520 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s1.$verific$n1179$12477, Q = \s1.s5.s2.s2.s1.n20).
Adding EN signal on $flatten\s1.\s5.\s2.\s2.\s1.$verific$n15_reg$cf_cordic_v_32_32_32.v:3581$12509 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s2.\s1.$verific$n779$12471, Q = \s1.s5.s2.s2.s1.n15).
Adding EN signal on $flatten\s1.\s5.\s2.\s1.$verific$n7_reg$cf_cordic_v_32_32_32.v:3681$12669 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s1.$verific$n373$12640, Q = \s1.s5.s2.s1.n7).
Adding EN signal on $flatten\s1.\s5.\s2.\s1.$verific$n20_reg$cf_cordic_v_32_32_32.v:3719$12695 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s1.$verific$n1193$12652, Q = \s1.s5.s2.s1.n20).
Adding EN signal on $flatten\s1.\s5.\s2.\s1.$verific$n15_reg$cf_cordic_v_32_32_32.v:3709$12684 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s2.\s1.$verific$n793$12646, Q = \s1.s5.s2.s1.n15).
Adding EN signal on $flatten\s1.\s5.\s1.$verific$n7_reg$cf_cordic_v_32_32_32.v:3816$12823 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s1.$verific$n380$12794, Q = \s1.s5.s1.n7).
Adding EN signal on $flatten\s1.\s5.\s1.$verific$n20_reg$cf_cordic_v_32_32_32.v:3861$12849 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s1.$verific$n1207$12806, Q = \s1.s5.s1.n20).
Adding EN signal on $flatten\s1.\s5.\s1.$verific$n15_reg$cf_cordic_v_32_32_32.v:3851$12838 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s5.\s1.$verific$n807$12800, Q = \s1.s5.s1.n15).
Adding EN signal on $flatten\s1.\s4.$verific$n8_reg$cf_cordic_v_32_32_32.v:3966$1549 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s4.$verific$n392$1519, Q = \s1.s4.n8).
Adding EN signal on $flatten\s1.\s4.$verific$n22_reg$cf_cordic_v_32_32_32.v:4019$1576 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s4.$verific$n1229$1531, Q = \s1.s4.n22).
Adding EN signal on $flatten\s1.\s4.$verific$n17_reg$cf_cordic_v_32_32_32.v:4009$1565 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.\s4.$verific$n829$1525, Q = \s1.s4.n17).
Adding EN signal on $flatten\s1.$verific$n3_reg$cf_cordic_v_32_32_32.v:139$225 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.$verific$n442$210, Q = \s1.n3).
Adding EN signal on $flatten\s1.$verific$n2_reg$cf_cordic_v_32_32_32.v:133$221 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.$verific$n274$207, Q = \s1.n2).
Adding EN signal on $flatten\s1.$verific$n1_reg$cf_cordic_v_32_32_32.v:127$217 ($dff) from module cf_cordic_v_32_32_32 (D = $flatten\s1.$verific$n106$204, Q = \s1.n1).

yosys> opt_clean

3.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
<suppressed ~102 debug messages>

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~195 debug messages>

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
<suppressed ~303 debug messages>
Removed a total of 101 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.46. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 0 unused cells and 101 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.

yosys> opt_muxtree

3.49. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~195 debug messages>

yosys> opt_reduce

3.50. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.51. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_share

3.52. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.53. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..

yosys> opt_expr

3.55. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
MAX OPT ITERATION = 3

yosys> wreduce -keepdc

3.56. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s1.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s1.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s2.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s2.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 31 bits (of 32) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s8.$verific$sub_7$cf_cordic_v_32_32_32.v:231$1282 ($sub).
Removed top 31 bits (of 32) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s8.$verific$sub_4$cf_cordic_v_32_32_32.v:229$1279 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s4.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s4.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s5.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s6.\s21.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s6.\s21.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s7.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s7.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
Removed top 1 bits (of 33) from port A of cell cf_cordic_v_32_32_32.$flatten\s1.\s9.$verific$sub_10$cf_cordic_v_32_32_32.v:199$1251 ($sub).
Removed top 1 bits (of 33) from port B of cell cf_cordic_v_32_32_32.$flatten\s1.\s9.$verific$sub_10$cf_cordic_v_32_32_32.v:199$1251 ($sub).

yosys> peepopt

3.57. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..

yosys> bmuxmap

3.59. Executing BMUXMAP pass.

yosys> demuxmap

3.60. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.61. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module cf_cordic_v_32_32_32:
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13239 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13244 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13254 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13259 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13269 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13274 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13284 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13289 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13299 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13304 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13309 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13314 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13324 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13334 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13339 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13349 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13354 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13364 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13369 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13374 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13384 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13389 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13399 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13404 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13414 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13424 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13429 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13439 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13444 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13454 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13459 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13464 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13474 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13479 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13489 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13494 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13504 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13514 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13519 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13529 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13534 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13544 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13549 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13554 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13564 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13569 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13579 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13584 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13594 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13604 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13609 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13619 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13624 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13634 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13639 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13644 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13654 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13659 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13669 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13674 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13684 ($neg).
  creating $macc model for $auto$opt_share.cc:196:merge_operators$13689 ($neg).
  creating $macc model for $flatten\s1.\s4.$verific$add_42$cf_cordic_v_32_32_32.v:4011$1567 ($add).
  creating $macc model for $flatten\s1.\s4.$verific$add_7$cf_cordic_v_32_32_32.v:3958$1539 ($add).
  creating $macc model for $flatten\s1.\s4.$verific$sub_29$cf_cordic_v_32_32_32.v:4002$1558 ($sub).
  creating $macc model for $flatten\s1.\s4.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3853$12840 ($add).
  creating $macc model for $flatten\s1.\s5.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3808$12813 ($add).
  creating $macc model for $flatten\s1.\s5.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3844$12831 ($sub).
  creating $macc model for $flatten\s1.\s5.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3711$12686 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3673$12659 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3702$12677 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3583$12511 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3552$12484 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3574$12502 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$add_7$cf_cordic_v_32_32_32.v:3445$12287 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$sub_29$cf_cordic_v_32_32_32.v:3460$12306 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s1.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$add_40$cf_cordic_v_32_32_32.v:3389$12151 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$add_6$cf_cordic_v_32_32_32.v:3365$12124 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$sub_27$cf_cordic_v_32_32_32.v:3380$12142 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s2.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:3263$11863 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:3283$11887 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:3274$11878 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:3172$11606 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:3192$11630 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:3183$11621 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:3082$11350 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:3102$11374 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:3093$11365 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:3038$11230 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:3007$11200 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:3029$11221 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:2940$11074 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:2909$11045 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:2931$11065 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:2844$10920 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:2813$10892 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:2835$10911 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:2648$9074 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:2668$9098 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:2659$9089 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:2550$8824 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:2570$8848 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:2561$8839 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:2453$8575 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:2473$8599 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:2464$8590 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:2409$8469 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:2371$8439 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:2400$8460 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:2297$8327 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:2259$8298 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:2288$8318 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:2187$8187 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:2149$8159 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:2178$8178 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:1970$6348 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:1990$6372 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:1981$6363 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:1865$6105 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:1885$6129 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:1876$6120 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:1761$5863 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:1781$5887 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:1772$5878 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:1717$5771 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:1672$5741 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:1708$5762 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:1591$5643 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:1546$5614 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:1582$5634 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:1467$5517 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:1422$5489 ($add).
  creating $macc model for $flatten\s1.\s5.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:1458$5508 ($sub).
  creating $macc model for $flatten\s1.\s5.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:1229$3687 ($add).
  creating $macc model for $flatten\s1.\s5.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:1249$3711 ($add).
  creating $macc model for $flatten\s1.\s5.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:1240$3702 ($sub).
  creating $macc model for $flatten\s1.\s5.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:1117$3453 ($add).
  creating $macc model for $flatten\s1.\s5.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:1137$3477 ($add).
  creating $macc model for $flatten\s1.\s5.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:1128$3468 ($sub).
  creating $macc model for $flatten\s1.\s5.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:1006$3220 ($add).
  creating $macc model for $flatten\s1.\s5.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:1026$3244 ($add).
  creating $macc model for $flatten\s1.\s5.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:1017$3235 ($sub).
  creating $macc model for $flatten\s1.\s5.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s6.$verific$add_10$cf_cordic_v_32_32_32.v:911$13162 ($add).
  creating $macc model for $flatten\s1.\s5.\s6.$verific$add_48$cf_cordic_v_32_32_32.v:964$13193 ($add).
  creating $macc model for $flatten\s1.\s5.\s6.$verific$sub_35$cf_cordic_v_32_32_32.v:955$13184 ($sub).
  creating $macc model for $flatten\s1.\s5.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s7.$verific$add_46$cf_cordic_v_32_32_32.v:824$13083 ($add).
  creating $macc model for $flatten\s1.\s5.\s7.$verific$add_9$cf_cordic_v_32_32_32.v:771$13053 ($add).
  creating $macc model for $flatten\s1.\s5.\s7.$verific$sub_33$cf_cordic_v_32_32_32.v:815$13074 ($sub).
  creating $macc model for $flatten\s1.\s5.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s5.\s8.$verific$add_44$cf_cordic_v_32_32_32.v:686$12975 ($add).
  creating $macc model for $flatten\s1.\s5.\s8.$verific$add_8$cf_cordic_v_32_32_32.v:633$12946 ($add).
  creating $macc model for $flatten\s1.\s5.\s8.$verific$sub_31$cf_cordic_v_32_32_32.v:677$12966 ($sub).
  creating $macc model for $flatten\s1.\s5.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s6.$verific$add_40$cf_cordic_v_32_32_32.v:503$1463 ($add).
  creating $macc model for $flatten\s1.\s6.$verific$add_6$cf_cordic_v_32_32_32.v:450$1436 ($add).
  creating $macc model for $flatten\s1.\s6.$verific$sub_27$cf_cordic_v_32_32_32.v:494$1454 ($sub).
  creating $macc model for $flatten\s1.\s6.\s21.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s7.$verific$add_21$cf_cordic_v_32_32_32.v:361$1350 ($add).
  creating $macc model for $flatten\s1.\s7.$verific$add_36$cf_cordic_v_32_32_32.v:371$1361 ($add).
  creating $macc model for $flatten\s1.\s7.$verific$sub_23$cf_cordic_v_32_32_32.v:362$1352 ($sub).
  creating $macc model for $flatten\s1.\s7.$verific$sub_6$cf_cordic_v_32_32_32.v:320$1338 ($sub).
  creating $macc model for $flatten\s1.\s7.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626 ($sub).
  creating $macc model for $flatten\s1.\s8.$verific$sub_4$cf_cordic_v_32_32_32.v:229$1279 ($sub).
  creating $macc model for $flatten\s1.\s8.$verific$sub_7$cf_cordic_v_32_32_32.v:231$1282 ($sub).
  creating $macc model for $flatten\s1.\s8.$verific$sub_9$cf_cordic_v_32_32_32.v:232$1284 ($sub).
  creating $macc model for $flatten\s1.\s9.$verific$sub_10$cf_cordic_v_32_32_32.v:199$1251 ($sub).
  creating $alu model for $macc $flatten\s1.\s9.$verific$sub_10$cf_cordic_v_32_32_32.v:199$1251.
  creating $alu model for $macc $flatten\s1.\s8.$verific$sub_9$cf_cordic_v_32_32_32.v:232$1284.
  creating $alu model for $macc $flatten\s1.\s8.$verific$sub_7$cf_cordic_v_32_32_32.v:231$1282.
  creating $alu model for $macc $flatten\s1.\s8.$verific$sub_4$cf_cordic_v_32_32_32.v:229$1279.
  creating $alu model for $macc $flatten\s1.\s7.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s7.$verific$sub_6$cf_cordic_v_32_32_32.v:320$1338.
  creating $alu model for $macc $flatten\s1.\s7.$verific$sub_23$cf_cordic_v_32_32_32.v:362$1352.
  creating $alu model for $macc $flatten\s1.\s7.$verific$add_36$cf_cordic_v_32_32_32.v:371$1361.
  creating $alu model for $macc $flatten\s1.\s7.$verific$add_21$cf_cordic_v_32_32_32.v:361$1350.
  creating $alu model for $macc $flatten\s1.\s6.\s21.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s6.$verific$sub_27$cf_cordic_v_32_32_32.v:494$1454.
  creating $alu model for $macc $flatten\s1.\s6.$verific$add_6$cf_cordic_v_32_32_32.v:450$1436.
  creating $alu model for $macc $flatten\s1.\s6.$verific$add_40$cf_cordic_v_32_32_32.v:503$1463.
  creating $alu model for $macc $flatten\s1.\s5.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s8.$verific$sub_31$cf_cordic_v_32_32_32.v:677$12966.
  creating $alu model for $macc $flatten\s1.\s5.\s8.$verific$add_8$cf_cordic_v_32_32_32.v:633$12946.
  creating $alu model for $macc $flatten\s1.\s5.\s8.$verific$add_44$cf_cordic_v_32_32_32.v:686$12975.
  creating $alu model for $macc $flatten\s1.\s5.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s7.$verific$sub_33$cf_cordic_v_32_32_32.v:815$13074.
  creating $alu model for $macc $flatten\s1.\s5.\s7.$verific$add_9$cf_cordic_v_32_32_32.v:771$13053.
  creating $alu model for $macc $flatten\s1.\s5.\s7.$verific$add_46$cf_cordic_v_32_32_32.v:824$13083.
  creating $alu model for $macc $flatten\s1.\s5.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s6.$verific$sub_35$cf_cordic_v_32_32_32.v:955$13184.
  creating $alu model for $macc $flatten\s1.\s5.\s6.$verific$add_48$cf_cordic_v_32_32_32.v:964$13193.
  creating $alu model for $macc $flatten\s1.\s5.\s6.$verific$add_10$cf_cordic_v_32_32_32.v:911$13162.
  creating $alu model for $macc $flatten\s1.\s5.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:1017$3235.
  creating $alu model for $macc $flatten\s1.\s5.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:1026$3244.
  creating $alu model for $macc $flatten\s1.\s5.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:1006$3220.
  creating $alu model for $macc $flatten\s1.\s5.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:1128$3468.
  creating $alu model for $macc $flatten\s1.\s5.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:1137$3477.
  creating $alu model for $macc $flatten\s1.\s5.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:1117$3453.
  creating $alu model for $macc $flatten\s1.\s5.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:1240$3702.
  creating $alu model for $macc $flatten\s1.\s5.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:1249$3711.
  creating $alu model for $macc $flatten\s1.\s5.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:1229$3687.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:1458$5508.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:1422$5489.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:1467$5517.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:1582$5634.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:1546$5614.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:1591$5643.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:1708$5762.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:1672$5741.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:1717$5771.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:1772$5878.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:1781$5887.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:1761$5863.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:1876$6120.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:1885$6129.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:1865$6105.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:1981$6363.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:1990$6372.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:1970$6348.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:2178$8178.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:2149$8159.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:2187$8187.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:2288$8318.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:2259$8298.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:2297$8327.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:2400$8460.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:2371$8439.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:2409$8469.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:2464$8590.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:2473$8599.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:2453$8575.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:2561$8839.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:2570$8848.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:2550$8824.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:2659$9089.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:2668$9098.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:2648$9074.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:2835$10911.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:2813$10892.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:2844$10920.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:2931$11065.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:2909$11045.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:2940$11074.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:3029$11221.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:3007$11200.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:3038$11230.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:3093$11365.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:3102$11374.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:3082$11350.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:3183$11621.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:3192$11630.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:3172$11606.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:3274$11878.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:3283$11887.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:3263$11863.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s2.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$sub_27$cf_cordic_v_32_32_32.v:3380$12142.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$add_6$cf_cordic_v_32_32_32.v:3365$12124.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$add_40$cf_cordic_v_32_32_32.v:3389$12151.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s1.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$sub_29$cf_cordic_v_32_32_32.v:3460$12306.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$add_7$cf_cordic_v_32_32_32.v:3445$12287.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3574$12502.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3552$12484.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s2.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3583$12511.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3702$12677.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3673$12659.
  creating $alu model for $macc $flatten\s1.\s5.\s2.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3711$12686.
  creating $alu model for $macc $flatten\s1.\s5.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s5.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3844$12831.
  creating $alu model for $macc $flatten\s1.\s5.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3808$12813.
  creating $alu model for $macc $flatten\s1.\s5.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3853$12840.
  creating $alu model for $macc $flatten\s1.\s4.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626.
  creating $alu model for $macc $flatten\s1.\s4.$verific$sub_29$cf_cordic_v_32_32_32.v:4002$1558.
  creating $alu model for $macc $flatten\s1.\s4.$verific$add_7$cf_cordic_v_32_32_32.v:3958$1539.
  creating $alu model for $macc $flatten\s1.\s4.$verific$add_42$cf_cordic_v_32_32_32.v:4011$1567.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13689.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13684.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13674.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13669.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13659.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13654.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13644.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13639.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13634.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13624.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13619.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13609.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13604.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13594.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13584.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13579.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13569.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13564.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13554.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13549.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13544.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13534.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13529.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13519.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13514.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13504.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13494.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13489.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13479.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13474.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13464.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13459.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13454.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13444.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13439.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13429.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13424.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13414.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13404.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13399.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13389.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13384.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13374.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13369.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13364.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13354.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13349.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13339.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13334.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13324.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13314.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13309.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13304.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13299.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13289.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13284.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13274.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13269.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13259.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13254.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13244.
  creating $alu model for $macc $auto$opt_share.cc:196:merge_operators$13239.
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13239: $auto$alumacc.cc:485:replace_alu$14010
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13244: $auto$alumacc.cc:485:replace_alu$14013
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13254: $auto$alumacc.cc:485:replace_alu$14016
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13259: $auto$alumacc.cc:485:replace_alu$14019
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13269: $auto$alumacc.cc:485:replace_alu$14022
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13274: $auto$alumacc.cc:485:replace_alu$14025
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13284: $auto$alumacc.cc:485:replace_alu$14028
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13289: $auto$alumacc.cc:485:replace_alu$14031
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13299: $auto$alumacc.cc:485:replace_alu$14034
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13304: $auto$alumacc.cc:485:replace_alu$14037
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13309: $auto$alumacc.cc:485:replace_alu$14040
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13314: $auto$alumacc.cc:485:replace_alu$14043
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13324: $auto$alumacc.cc:485:replace_alu$14046
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13334: $auto$alumacc.cc:485:replace_alu$14049
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13339: $auto$alumacc.cc:485:replace_alu$14052
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13349: $auto$alumacc.cc:485:replace_alu$14055
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13354: $auto$alumacc.cc:485:replace_alu$14058
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13364: $auto$alumacc.cc:485:replace_alu$14061
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13369: $auto$alumacc.cc:485:replace_alu$14064
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13374: $auto$alumacc.cc:485:replace_alu$14067
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13384: $auto$alumacc.cc:485:replace_alu$14070
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13389: $auto$alumacc.cc:485:replace_alu$14073
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13399: $auto$alumacc.cc:485:replace_alu$14076
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13404: $auto$alumacc.cc:485:replace_alu$14079
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13414: $auto$alumacc.cc:485:replace_alu$14082
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13424: $auto$alumacc.cc:485:replace_alu$14085
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13429: $auto$alumacc.cc:485:replace_alu$14088
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13439: $auto$alumacc.cc:485:replace_alu$14091
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13444: $auto$alumacc.cc:485:replace_alu$14094
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13454: $auto$alumacc.cc:485:replace_alu$14097
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13459: $auto$alumacc.cc:485:replace_alu$14100
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13464: $auto$alumacc.cc:485:replace_alu$14103
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13474: $auto$alumacc.cc:485:replace_alu$14106
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13479: $auto$alumacc.cc:485:replace_alu$14109
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13489: $auto$alumacc.cc:485:replace_alu$14112
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13494: $auto$alumacc.cc:485:replace_alu$14115
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13504: $auto$alumacc.cc:485:replace_alu$14118
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13514: $auto$alumacc.cc:485:replace_alu$14121
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13519: $auto$alumacc.cc:485:replace_alu$14124
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13529: $auto$alumacc.cc:485:replace_alu$14127
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13534: $auto$alumacc.cc:485:replace_alu$14130
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13544: $auto$alumacc.cc:485:replace_alu$14133
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13549: $auto$alumacc.cc:485:replace_alu$14136
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13554: $auto$alumacc.cc:485:replace_alu$14139
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13564: $auto$alumacc.cc:485:replace_alu$14142
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13569: $auto$alumacc.cc:485:replace_alu$14145
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13579: $auto$alumacc.cc:485:replace_alu$14148
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13584: $auto$alumacc.cc:485:replace_alu$14151
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13594: $auto$alumacc.cc:485:replace_alu$14154
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13604: $auto$alumacc.cc:485:replace_alu$14157
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13609: $auto$alumacc.cc:485:replace_alu$14160
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13619: $auto$alumacc.cc:485:replace_alu$14163
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13624: $auto$alumacc.cc:485:replace_alu$14166
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13634: $auto$alumacc.cc:485:replace_alu$14169
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13639: $auto$alumacc.cc:485:replace_alu$14172
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13644: $auto$alumacc.cc:485:replace_alu$14175
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13654: $auto$alumacc.cc:485:replace_alu$14178
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13659: $auto$alumacc.cc:485:replace_alu$14181
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13669: $auto$alumacc.cc:485:replace_alu$14184
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13674: $auto$alumacc.cc:485:replace_alu$14187
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13684: $auto$alumacc.cc:485:replace_alu$14190
  creating $alu cell for $auto$opt_share.cc:196:merge_operators$13689: $auto$alumacc.cc:485:replace_alu$14193
  creating $alu cell for $flatten\s1.\s4.$verific$add_42$cf_cordic_v_32_32_32.v:4011$1567: $auto$alumacc.cc:485:replace_alu$14196
  creating $alu cell for $flatten\s1.\s4.$verific$add_7$cf_cordic_v_32_32_32.v:3958$1539: $auto$alumacc.cc:485:replace_alu$14199
  creating $alu cell for $flatten\s1.\s4.$verific$sub_29$cf_cordic_v_32_32_32.v:4002$1558: $auto$alumacc.cc:485:replace_alu$14202
  creating $alu cell for $flatten\s1.\s4.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14205
  creating $alu cell for $flatten\s1.\s5.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3853$12840: $auto$alumacc.cc:485:replace_alu$14208
  creating $alu cell for $flatten\s1.\s5.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3808$12813: $auto$alumacc.cc:485:replace_alu$14211
  creating $alu cell for $flatten\s1.\s5.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3844$12831: $auto$alumacc.cc:485:replace_alu$14214
  creating $alu cell for $flatten\s1.\s5.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14217
  creating $alu cell for $flatten\s1.\s5.\s2.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3711$12686: $auto$alumacc.cc:485:replace_alu$14220
  creating $alu cell for $flatten\s1.\s5.\s2.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3673$12659: $auto$alumacc.cc:485:replace_alu$14223
  creating $alu cell for $flatten\s1.\s5.\s2.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3702$12677: $auto$alumacc.cc:485:replace_alu$14226
  creating $alu cell for $flatten\s1.\s5.\s2.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14229
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s1.$verific$add_40$cf_cordic_v_32_32_32.v:3583$12511: $auto$alumacc.cc:485:replace_alu$14232
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s1.$verific$add_6$cf_cordic_v_32_32_32.v:3552$12484: $auto$alumacc.cc:485:replace_alu$14235
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s1.$verific$sub_27$cf_cordic_v_32_32_32.v:3574$12502: $auto$alumacc.cc:485:replace_alu$14238
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s1.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14241
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$add_7$cf_cordic_v_32_32_32.v:3445$12287: $auto$alumacc.cc:485:replace_alu$14244
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s1.$verific$sub_29$cf_cordic_v_32_32_32.v:3460$12306: $auto$alumacc.cc:485:replace_alu$14247
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s1.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14250
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$add_40$cf_cordic_v_32_32_32.v:3389$12151: $auto$alumacc.cc:485:replace_alu$14253
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$add_6$cf_cordic_v_32_32_32.v:3365$12124: $auto$alumacc.cc:485:replace_alu$14256
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s2.$verific$sub_27$cf_cordic_v_32_32_32.v:3380$12142: $auto$alumacc.cc:485:replace_alu$14259
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s2.\s23.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14262
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:3263$11863: $auto$alumacc.cc:485:replace_alu$14265
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:3283$11887: $auto$alumacc.cc:485:replace_alu$14268
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:3274$11878: $auto$alumacc.cc:485:replace_alu$14271
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14274
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:3172$11606: $auto$alumacc.cc:485:replace_alu$14277
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:3192$11630: $auto$alumacc.cc:485:replace_alu$14280
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:3183$11621: $auto$alumacc.cc:485:replace_alu$14283
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14286
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:3082$11350: $auto$alumacc.cc:485:replace_alu$14289
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:3102$11374: $auto$alumacc.cc:485:replace_alu$14292
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:3093$11365: $auto$alumacc.cc:485:replace_alu$14295
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14298
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:3038$11230: $auto$alumacc.cc:485:replace_alu$14301
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:3007$11200: $auto$alumacc.cc:485:replace_alu$14304
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:3029$11221: $auto$alumacc.cc:485:replace_alu$14307
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14310
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:2940$11074: $auto$alumacc.cc:485:replace_alu$14313
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:2909$11045: $auto$alumacc.cc:485:replace_alu$14316
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:2931$11065: $auto$alumacc.cc:485:replace_alu$14319
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14322
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:2844$10920: $auto$alumacc.cc:485:replace_alu$14325
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:2813$10892: $auto$alumacc.cc:485:replace_alu$14328
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:2835$10911: $auto$alumacc.cc:485:replace_alu$14331
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14334
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:2648$9074: $auto$alumacc.cc:485:replace_alu$14337
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:2668$9098: $auto$alumacc.cc:485:replace_alu$14340
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:2659$9089: $auto$alumacc.cc:485:replace_alu$14343
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14346
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:2550$8824: $auto$alumacc.cc:485:replace_alu$14349
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:2570$8848: $auto$alumacc.cc:485:replace_alu$14352
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:2561$8839: $auto$alumacc.cc:485:replace_alu$14355
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14358
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:2453$8575: $auto$alumacc.cc:485:replace_alu$14361
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:2473$8599: $auto$alumacc.cc:485:replace_alu$14364
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:2464$8590: $auto$alumacc.cc:485:replace_alu$14367
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14370
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:2409$8469: $auto$alumacc.cc:485:replace_alu$14373
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:2371$8439: $auto$alumacc.cc:485:replace_alu$14376
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:2400$8460: $auto$alumacc.cc:485:replace_alu$14379
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14382
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:2297$8327: $auto$alumacc.cc:485:replace_alu$14385
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:2259$8298: $auto$alumacc.cc:485:replace_alu$14388
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:2288$8318: $auto$alumacc.cc:485:replace_alu$14391
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14394
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:2187$8187: $auto$alumacc.cc:485:replace_alu$14397
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:2149$8159: $auto$alumacc.cc:485:replace_alu$14400
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:2178$8178: $auto$alumacc.cc:485:replace_alu$14403
  creating $alu cell for $flatten\s1.\s5.\s2.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14406
  creating $alu cell for $flatten\s1.\s5.\s2.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:1970$6348: $auto$alumacc.cc:485:replace_alu$14409
  creating $alu cell for $flatten\s1.\s5.\s2.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:1990$6372: $auto$alumacc.cc:485:replace_alu$14412
  creating $alu cell for $flatten\s1.\s5.\s2.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:1981$6363: $auto$alumacc.cc:485:replace_alu$14415
  creating $alu cell for $flatten\s1.\s5.\s2.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14418
  creating $alu cell for $flatten\s1.\s5.\s2.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:1865$6105: $auto$alumacc.cc:485:replace_alu$14421
  creating $alu cell for $flatten\s1.\s5.\s2.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:1885$6129: $auto$alumacc.cc:485:replace_alu$14424
  creating $alu cell for $flatten\s1.\s5.\s2.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:1876$6120: $auto$alumacc.cc:485:replace_alu$14427
  creating $alu cell for $flatten\s1.\s5.\s2.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14430
  creating $alu cell for $flatten\s1.\s5.\s2.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:1761$5863: $auto$alumacc.cc:485:replace_alu$14433
  creating $alu cell for $flatten\s1.\s5.\s2.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:1781$5887: $auto$alumacc.cc:485:replace_alu$14436
  creating $alu cell for $flatten\s1.\s5.\s2.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:1772$5878: $auto$alumacc.cc:485:replace_alu$14439
  creating $alu cell for $flatten\s1.\s5.\s2.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14442
  creating $alu cell for $flatten\s1.\s5.\s2.\s6.$verific$add_46$cf_cordic_v_32_32_32.v:1717$5771: $auto$alumacc.cc:485:replace_alu$14445
  creating $alu cell for $flatten\s1.\s5.\s2.\s6.$verific$add_9$cf_cordic_v_32_32_32.v:1672$5741: $auto$alumacc.cc:485:replace_alu$14448
  creating $alu cell for $flatten\s1.\s5.\s2.\s6.$verific$sub_33$cf_cordic_v_32_32_32.v:1708$5762: $auto$alumacc.cc:485:replace_alu$14451
  creating $alu cell for $flatten\s1.\s5.\s2.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14454
  creating $alu cell for $flatten\s1.\s5.\s2.\s7.$verific$add_44$cf_cordic_v_32_32_32.v:1591$5643: $auto$alumacc.cc:485:replace_alu$14457
  creating $alu cell for $flatten\s1.\s5.\s2.\s7.$verific$add_8$cf_cordic_v_32_32_32.v:1546$5614: $auto$alumacc.cc:485:replace_alu$14460
  creating $alu cell for $flatten\s1.\s5.\s2.\s7.$verific$sub_31$cf_cordic_v_32_32_32.v:1582$5634: $auto$alumacc.cc:485:replace_alu$14463
  creating $alu cell for $flatten\s1.\s5.\s2.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14466
  creating $alu cell for $flatten\s1.\s5.\s2.\s8.$verific$add_42$cf_cordic_v_32_32_32.v:1467$5517: $auto$alumacc.cc:485:replace_alu$14469
  creating $alu cell for $flatten\s1.\s5.\s2.\s8.$verific$add_7$cf_cordic_v_32_32_32.v:1422$5489: $auto$alumacc.cc:485:replace_alu$14472
  creating $alu cell for $flatten\s1.\s5.\s2.\s8.$verific$sub_29$cf_cordic_v_32_32_32.v:1458$5508: $auto$alumacc.cc:485:replace_alu$14475
  creating $alu cell for $flatten\s1.\s5.\s2.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14478
  creating $alu cell for $flatten\s1.\s5.\s3.$verific$add_3$cf_cordic_v_32_32_32.v:1229$3687: $auto$alumacc.cc:485:replace_alu$14481
  creating $alu cell for $flatten\s1.\s5.\s3.$verific$add_34$cf_cordic_v_32_32_32.v:1249$3711: $auto$alumacc.cc:485:replace_alu$14484
  creating $alu cell for $flatten\s1.\s5.\s3.$verific$sub_21$cf_cordic_v_32_32_32.v:1240$3702: $auto$alumacc.cc:485:replace_alu$14487
  creating $alu cell for $flatten\s1.\s5.\s3.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14490
  creating $alu cell for $flatten\s1.\s5.\s4.$verific$add_3$cf_cordic_v_32_32_32.v:1117$3453: $auto$alumacc.cc:485:replace_alu$14493
  creating $alu cell for $flatten\s1.\s5.\s4.$verific$add_34$cf_cordic_v_32_32_32.v:1137$3477: $auto$alumacc.cc:485:replace_alu$14496
  creating $alu cell for $flatten\s1.\s5.\s4.$verific$sub_21$cf_cordic_v_32_32_32.v:1128$3468: $auto$alumacc.cc:485:replace_alu$14499
  creating $alu cell for $flatten\s1.\s5.\s4.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14502
  creating $alu cell for $flatten\s1.\s5.\s5.$verific$add_3$cf_cordic_v_32_32_32.v:1006$3220: $auto$alumacc.cc:485:replace_alu$14505
  creating $alu cell for $flatten\s1.\s5.\s5.$verific$add_34$cf_cordic_v_32_32_32.v:1026$3244: $auto$alumacc.cc:485:replace_alu$14508
  creating $alu cell for $flatten\s1.\s5.\s5.$verific$sub_21$cf_cordic_v_32_32_32.v:1017$3235: $auto$alumacc.cc:485:replace_alu$14511
  creating $alu cell for $flatten\s1.\s5.\s5.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14514
  creating $alu cell for $flatten\s1.\s5.\s6.$verific$add_10$cf_cordic_v_32_32_32.v:911$13162: $auto$alumacc.cc:485:replace_alu$14517
  creating $alu cell for $flatten\s1.\s5.\s6.$verific$add_48$cf_cordic_v_32_32_32.v:964$13193: $auto$alumacc.cc:485:replace_alu$14520
  creating $alu cell for $flatten\s1.\s5.\s6.$verific$sub_35$cf_cordic_v_32_32_32.v:955$13184: $auto$alumacc.cc:485:replace_alu$14523
  creating $alu cell for $flatten\s1.\s5.\s6.\s29.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14526
  creating $alu cell for $flatten\s1.\s5.\s7.$verific$add_46$cf_cordic_v_32_32_32.v:824$13083: $auto$alumacc.cc:485:replace_alu$14529
  creating $alu cell for $flatten\s1.\s5.\s7.$verific$add_9$cf_cordic_v_32_32_32.v:771$13053: $auto$alumacc.cc:485:replace_alu$14532
  creating $alu cell for $flatten\s1.\s5.\s7.$verific$sub_33$cf_cordic_v_32_32_32.v:815$13074: $auto$alumacc.cc:485:replace_alu$14535
  creating $alu cell for $flatten\s1.\s5.\s7.\s27.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14538
  creating $alu cell for $flatten\s1.\s5.\s8.$verific$add_44$cf_cordic_v_32_32_32.v:686$12975: $auto$alumacc.cc:485:replace_alu$14541
  creating $alu cell for $flatten\s1.\s5.\s8.$verific$add_8$cf_cordic_v_32_32_32.v:633$12946: $auto$alumacc.cc:485:replace_alu$14544
  creating $alu cell for $flatten\s1.\s5.\s8.$verific$sub_31$cf_cordic_v_32_32_32.v:677$12966: $auto$alumacc.cc:485:replace_alu$14547
  creating $alu cell for $flatten\s1.\s5.\s8.\s25.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14550
  creating $alu cell for $flatten\s1.\s6.$verific$add_40$cf_cordic_v_32_32_32.v:503$1463: $auto$alumacc.cc:485:replace_alu$14553
  creating $alu cell for $flatten\s1.\s6.$verific$add_6$cf_cordic_v_32_32_32.v:450$1436: $auto$alumacc.cc:485:replace_alu$14556
  creating $alu cell for $flatten\s1.\s6.$verific$sub_27$cf_cordic_v_32_32_32.v:494$1454: $auto$alumacc.cc:485:replace_alu$14559
  creating $alu cell for $flatten\s1.\s6.\s21.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14562
  creating $alu cell for $flatten\s1.\s7.$verific$add_36$cf_cordic_v_32_32_32.v:371$1361: $auto$alumacc.cc:485:replace_alu$14565
  creating $alu cell for $flatten\s1.\s7.$verific$add_21$cf_cordic_v_32_32_32.v:361$1350: $auto$alumacc.cc:485:replace_alu$14568
  creating $alu cell for $flatten\s1.\s7.$verific$sub_23$cf_cordic_v_32_32_32.v:362$1352: $auto$alumacc.cc:485:replace_alu$14571
  creating $alu cell for $flatten\s1.\s7.$verific$sub_6$cf_cordic_v_32_32_32.v:320$1338: $auto$alumacc.cc:485:replace_alu$14574
  creating $alu cell for $flatten\s1.\s7.\s17.$verific$sub_10$cf_cordic_v_32_32_32.v:4074$1626: $auto$alumacc.cc:485:replace_alu$14577
  creating $alu cell for $flatten\s1.\s8.$verific$sub_4$cf_cordic_v_32_32_32.v:229$1279: $auto$alumacc.cc:485:replace_alu$14580
  creating $alu cell for $flatten\s1.\s8.$verific$sub_7$cf_cordic_v_32_32_32.v:231$1282: $auto$alumacc.cc:485:replace_alu$14583
  creating $alu cell for $flatten\s1.\s8.$verific$sub_9$cf_cordic_v_32_32_32.v:232$1284: $auto$alumacc.cc:485:replace_alu$14586
  creating $alu cell for $flatten\s1.\s9.$verific$sub_10$cf_cordic_v_32_32_32.v:199$1251: $auto$alumacc.cc:485:replace_alu$14589
  created 194 $alu and 0 $macc cells.

yosys> opt_expr

3.62. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.

yosys> opt_merge -nomux

3.63. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.64. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~195 debug messages>

yosys> opt_reduce

3.65. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.66. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_share

3.67. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.68. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.69. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..

yosys> opt_expr

3.70. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
MAX OPT ITERATION = 1

yosys> stat

3.71. Printing statistics.

=== cf_cordic_v_32_32_32 ===

   Number of wires:               3345
   Number of wire bits:          68941
   Number of public wires:        2597
   Number of public wire bits:   44970
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                632
     $alu                          194
     $dffe                         102
     $mux                          302
     $not                           33
     $reduce_bool                    1


yosys> memory -nomap

3.72. Executing MEMORY pass.

yosys> opt_mem

3.72.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.72.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.72.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.72.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.72.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.72.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..

yosys> memory_share

3.72.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.72.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.72.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..

yosys> memory_collect

3.72.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.73. Printing statistics.

=== cf_cordic_v_32_32_32 ===

   Number of wires:               3345
   Number of wire bits:          68941
   Number of public wires:        2597
   Number of public wire bits:   44970
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                632
     $alu                          194
     $dffe                         102
     $mux                          302
     $not                           33
     $reduce_bool                    1


yosys> muxpack

3.74. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~301 debug messages>

yosys> opt_clean

3.75. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..

yosys> pmuxtree

3.76. Executing PMUXTREE pass.

yosys> muxpack

3.77. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~301 debug messages>

yosys> memory_map

3.78. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.79. Printing statistics.

=== cf_cordic_v_32_32_32 ===

   Number of wires:               3345
   Number of wire bits:          68941
   Number of public wires:        2597
   Number of public wire bits:   44970
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                632
     $alu                          194
     $dffe                         102
     $mux                          302
     $not                           33
     $reduce_bool                    1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.80. Executing TECHMAP pass (map to technology primitives).

3.80.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.80.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.80.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using template $paramod$63a3f1ffa662be02d3403b533885c56d18ebe02a\_80_rs_alu for cells of type $alu.
Using template $paramod$be80489e44a49c29884f59fd81c31ed03229cfc1\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $reduce_bool.
Using template $paramod$857150d3a9b7fb38b73bbaa31ff652415e553f98\_90_alu for cells of type $alu.
Using template $paramod$79fc87901d7fd8aaad689b5406671422f5fa25b9\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $not.
Using template $paramod$fbc7873bff55778c0b3173955b7e4bce1d9d6834\_90_alu for cells of type $alu.
Using template $paramod$6a42b6fefed750f8a1c58eab59479d960557103c\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $pos.
Using extmapper simplemap for cells of type $and.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100000 for cells of type $lcu.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~8362 debug messages>

yosys> stat

3.81. Printing statistics.

=== cf_cordic_v_32_32_32 ===

   Number of wires:              11715
   Number of wire bits:         204856
   Number of public wires:        2597
   Number of public wire bits:   44970
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              44957
     $_AND_                       4242
     $_DFFE_PP_                   3264
     $_MUX_                      16221
     $_NOT_                       6274
     $_OR_                        2122
     $_XOR_                       7778
     adder_carry                  5056


yosys> opt_expr

3.82. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
<suppressed ~17488 debug messages>

yosys> opt_merge -nomux

3.83. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
<suppressed ~5871 debug messages>
Removed a total of 1957 cells.

yosys> opt_muxtree

3.84. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.85. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.86. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_share

3.87. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.88. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.89. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 3435 unused cells and 7327 unused wires.
<suppressed ~3440 debug messages>

yosys> opt_expr

3.90. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.

yosys> opt_muxtree

3.91. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.92. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.93. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_share

3.94. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.95. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.96. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..

yosys> opt_expr

3.97. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.98. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
<suppressed ~4258 debug messages>

yosys> techmap -map +/techmap.v

3.99. Executing TECHMAP pass (map to technology primitives).

3.99.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.99.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.

yosys> opt_merge -nomux

3.101. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.102. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.103. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.104. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.105. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.106. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 0 unused cells and 102 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.107. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
MAX OPT ITERATION = 1

yosys> abc -dff

3.108. Executing ABC pass (technology mapping using ABC).

3.108.1. Summary of detected clock domains:
  21281 cells in clk=\clock_c, en=$auto$opt_dff.cc:194:make_patterns_logic$13705, arst={ }, srst={ }

3.108.2. Extracting gate netlist of module `\cf_cordic_v_32_32_32' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock_c, enabled by $auto$opt_dff.cc:194:make_patterns_logic$13705
Extracted 16225 gates and 21222 wires to a netlist network with 4996 inputs and 6216 outputs.

3.108.2.1. Executing ABC.

yosys> abc -dff

3.109. Executing ABC pass (technology mapping using ABC).

3.109.1. Summary of detected clock domains:
  19891 cells in clk=\clock_c, en=$abc$55470$auto$opt_dff.cc:194:make_patterns_logic$13705, arst={ }, srst={ }

3.109.2. Extracting gate netlist of module `\cf_cordic_v_32_32_32' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock_c, enabled by $abc$55470$auto$opt_dff.cc:194:make_patterns_logic$13705
Extracted 14835 gates and 19831 wires to a netlist network with 4996 inputs and 6216 outputs.

3.109.2.1. Executing ABC.

yosys> abc -dff

3.110. Executing ABC pass (technology mapping using ABC).

3.110.1. Summary of detected clock domains:
  19871 cells in clk=\clock_c, en=$abc$72037$abc$55470$auto$opt_dff.cc:194:make_patterns_logic$13705, arst={ }, srst={ }

3.110.2. Extracting gate netlist of module `\cf_cordic_v_32_32_32' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock_c, enabled by $abc$72037$abc$55470$auto$opt_dff.cc:194:make_patterns_logic$13705
Extracted 14815 gates and 19811 wires to a netlist network with 4996 inputs and 6216 outputs.

3.110.2.1. Executing ABC.

yosys> abc -dff

3.111. Executing ABC pass (technology mapping using ABC).

3.111.1. Summary of detected clock domains:
  19866 cells in clk=\clock_c, en=$abc$88584$abc$72037$abc$55470$auto$opt_dff.cc:194:make_patterns_logic$13705, arst={ }, srst={ }

3.111.2. Extracting gate netlist of module `\cf_cordic_v_32_32_32' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clock_c, enabled by $abc$88584$abc$72037$abc$55470$auto$opt_dff.cc:194:make_patterns_logic$13705
Extracted 14810 gates and 19806 wires to a netlist network with 4996 inputs and 6216 outputs.

3.111.2.1. Executing ABC.

yosys> opt_ffinv

3.112. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.113. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
<suppressed ~4 debug messages>

yosys> opt_merge -nomux

3.114. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
<suppressed ~90 debug messages>
Removed a total of 30 cells.

yosys> opt_muxtree

3.115. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.116. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.117. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_share

3.118. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.119. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.120. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 0 unused cells and 79627 unused wires.
<suppressed ~727 debug messages>

yosys> opt_expr

3.121. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.122. Executing BMUXMAP pass.

yosys> demuxmap

3.123. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_kLgiYS/abc_tmp_1.scr

3.124. Executing ABC pass (technology mapping using ABC).

3.124.1. Extracting gate netlist of module `\cf_cordic_v_32_32_32' to `<abc-temp-dir>/input.blif'..
Extracted 11516 gates and 19626 wires to a netlist network with 8110 inputs and 7719 outputs.

3.124.1.1. Executing ABC.
DE:   #PIs = 8110  #Luts =  8114  Max Lvl =   9  Avg Lvl =   3.32  [   0.56 sec. at Pass 0]
DE:   #PIs = 8110  #Luts =  8077  Max Lvl =   8  Avg Lvl =   3.34  [  14.91 sec. at Pass 1]
DE:   #PIs = 8110  #Luts =  8070  Max Lvl =   9  Avg Lvl =   3.52  [   7.84 sec. at Pass 2]
DE:   #PIs = 8110  #Luts =  8036  Max Lvl =  10  Avg Lvl =   3.27  [   7.61 sec. at Pass 3]
DE:   #PIs = 8110  #Luts =  8023  Max Lvl =   9  Avg Lvl =   3.65  [   8.53 sec. at Pass 4]
DE:   #PIs = 8110  #Luts =  8020  Max Lvl =   9  Avg Lvl =   3.62  [   8.43 sec. at Pass 5]
DE:   #PIs = 8110  #Luts =  8020  Max Lvl =   9  Avg Lvl =   3.62  [   8.00 sec. at Pass 6]
DE:   #PIs = 8110  #Luts =  8016  Max Lvl =  10  Avg Lvl =   3.30  [   7.73 sec. at Pass 7]
DE:   #PIs = 8110  #Luts =  8014  Max Lvl =  12  Avg Lvl =   3.32  [   7.87 sec. at Pass 8]
DE:   #PIs = 8110  #Luts =  8013  Max Lvl =  11  Avg Lvl =   3.33  [   7.93 sec. at Pass 9]
DE:   #PIs = 8110  #Luts =  8011  Max Lvl =  11  Avg Lvl =   3.32  [   4.19 sec. at Pass 10]

yosys> opt_expr

3.125. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.

yosys> opt_merge -nomux

3.126. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.127. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.128. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.129. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_share

3.130. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.131. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.132. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 0 unused cells and 19626 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.133. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.134. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 21 inverters.

yosys> stat

3.135. Printing statistics.

=== cf_cordic_v_32_32_32 ===

   Number of wires:               7532
   Number of wire bits:          51050
   Number of public wires:        1867
   Number of public wire bits:   32300
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              16310
     $_DFFE_PP_                   3264
     $lut                         7990
     adder_carry                  5056


yosys> shregmap -minlen 8 -maxlen 20

3.136. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.137. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.138. Printing statistics.

=== cf_cordic_v_32_32_32 ===

   Number of wires:               7574
   Number of wire bits:          51092
   Number of public wires:        1867
   Number of public wire bits:   32300
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              16352
     $_DFFE_PP0P_                 3264
     $_NOT_                         42
     $lut                         7990
     adder_carry                  5056


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.139. Executing TECHMAP pass (map to technology primitives).

3.139.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.139.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.139.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~14654 debug messages>

yosys> opt_expr -mux_undef

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
<suppressed ~38595 debug messages>

yosys> simplemap

3.141. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.142. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.

yosys> opt_merge

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
<suppressed ~25167 debug messages>
Removed a total of 8389 cells.

yosys> opt_dff -nodffe -nosdff

3.144. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.145. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 0 unused cells and 33965 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.146. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
<suppressed ~1138 debug messages>

yosys> opt_merge -nomux

3.147. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_muxtree

3.148. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.149. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_share

3.151. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.152. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.153. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 0 unused cells and 61 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.154. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_kLgiYS/abc_tmp_2.scr

3.155. Executing ABC pass (technology mapping using ABC).

3.155.1. Extracting gate netlist of module `\cf_cordic_v_32_32_32' to `<abc-temp-dir>/input.blif'..
Extracted 15570 gates and 23682 wires to a netlist network with 8110 inputs and 7719 outputs.

3.155.1.1. Executing ABC.
DE:   #PIs = 8110  #Luts =  8011  Max Lvl =  11  Avg Lvl =   3.32  [   0.48 sec. at Pass 0]
DE:   #PIs = 8110  #Luts =  8011  Max Lvl =  11  Avg Lvl =   3.32  [  12.04 sec. at Pass 1]
DE:   #PIs = 8110  #Luts =  8011  Max Lvl =  11  Avg Lvl =   3.32  [   5.92 sec. at Pass 2]
DE:   #PIs = 8110  #Luts =  8011  Max Lvl =  11  Avg Lvl =   3.32  [   5.59 sec. at Pass 3]
DE:   #PIs = 8110  #Luts =  8011  Max Lvl =  11  Avg Lvl =   3.32  [   7.93 sec. at Pass 4]
DE:   #PIs = 8110  #Luts =  8010  Max Lvl =  12  Avg Lvl =   3.32  [   8.45 sec. at Pass 5]
DE:   #PIs = 8110  #Luts =  8010  Max Lvl =  10  Avg Lvl =   3.33  [   8.32 sec. at Pass 6]
DE:   #PIs = 8110  #Luts =  8009  Max Lvl =  11  Avg Lvl =   3.32  [   7.69 sec. at Pass 7]
DE:   #PIs = 8110  #Luts =  8009  Max Lvl =  11  Avg Lvl =   3.32  [   8.01 sec. at Pass 8]
DE:   #PIs = 8110  #Luts =  8009  Max Lvl =  11  Avg Lvl =   3.32  [   8.55 sec. at Pass 9]
DE:   #PIs = 8110  #Luts =  8009  Max Lvl =  11  Avg Lvl =   3.32  [   4.66 sec. at Pass 10]

yosys> opt_expr

3.156. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.

yosys> opt_merge -nomux

3.157. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.158. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cf_cordic_v_32_32_32..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.159. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cf_cordic_v_32_32_32.
Performed a total of 0 changes.

yosys> opt_merge

3.160. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cf_cordic_v_32_32_32'.
Removed a total of 0 cells.

yosys> opt_share

3.161. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.162. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.163. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 0 unused cells and 21059 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.164. Executing OPT_EXPR pass (perform const folding).
Optimizing module cf_cordic_v_32_32_32.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.165. Executing HIERARCHY pass (managing design hierarchy).

3.165.1. Analyzing design hierarchy..
Top module:  \cf_cordic_v_32_32_32

3.165.2. Analyzing design hierarchy..
Top module:  \cf_cordic_v_32_32_32
Removed 0 unused modules.

yosys> stat

3.166. Printing statistics.

=== cf_cordic_v_32_32_32 ===

   Number of wires:               7530
   Number of wire bits:          51048
   Number of public wires:        1867
   Number of public wire bits:   32300
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              16329
     $lut                         8009
     adder_carry                  5056
     dffsre                       3264


yosys> opt_clean -purge

3.167. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cf_cordic_v_32_32_32..
Removed 0 unused cells and 1652 unused wires.
<suppressed ~1652 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.168. Executing Verilog backend.
Dumping module `\cf_cordic_v_32_32_32'.

End of script. Logfile hash: 8ca6e73eaa, CPU: user 84.08s system 0.56s, MEM: 243.95 MB peak
Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)
Time spent: 94% 6x abc (1318 sec), 1% 31x opt_expr (19 sec), ...
real 265.90
user 1301.73
sys 92.46
