
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.53
 Yosys 0.18+10 (git sha1 a3cbfccc4, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -sv aes128_enc.sv

yosys> verific -sv aes128_enc.sv

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'aes128_enc.sv'

yosys> synth_rs -top aes128_enc -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.61

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top aes128_enc

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] aes128_enc.sv:12: compiling module 'aes128_enc'
VERIFIC-WARNING [VERI-2457] aes128_enc.sv:99: assignment and/or driver for 'state_o' inside static function 'sub_bytes' is not preserved
VERIFIC-WARNING [VERI-2457] aes128_enc.sv:146: assignment and/or driver for 'state_o' inside static function 'mix_columns' is not preserved
VERIFIC-WARNING [VERI-2457] aes128_enc.sv:161: assignment and/or driver for 'key_o' inside static function 'compute_next_round_key' is not preserved
VERIFIC-WARNING [VERI-2457] aes128_enc.sv:189: assignment and/or driver for 'state_o' inside static function 'add_round_key' is not preserved
VERIFIC-WARNING [VERI-1209] aes128_enc.sv:268: expression size 5 truncated to fit in target size 4
Importing module aes128_enc.

3.3.1. Analyzing design hierarchy..
Top module:  \aes128_enc

3.3.2. Analyzing design hierarchy..
Top module:  \aes128_enc
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~6 debug messages>

yosys> bmuxmap

3.5. Executing BMUXMAP pass.

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).

yosys> bmuxmap

3.8. Executing BMUXMAP pass.

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~16 debug messages>

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 1 unused cells and 1315 unused wires.
<suppressed ~431 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module aes128_enc...
Warning: found logic loop in module aes128_enc:
    cell $verific$i503$aes128_enc.sv:175$1491 ($not)
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [16]
    wire $verific$n5414$475 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11517$1056 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11535$1058 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11553$1060 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11770$1085 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11788$1087 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n11806$1089 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12023$1113 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12041$1115 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12059$1117 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12276$1141 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12294$1143 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1299$aes128_enc.sv:175$1589 ($xor)
    wire $verific$n12312$1145 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [10]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [11]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [12]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [13]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [14]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [15]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [16]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [17]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [18]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [19]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [20]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [21]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [22]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [23]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [8]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1605 [9]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [10]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [11]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [12]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [13]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [14]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [15]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [16]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [17]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [18]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [19]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [20]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [21]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [22]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [23]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [8]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1606 [9]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [10]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [11]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [12]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [13]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [14]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [15]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [16]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [17]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [18]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [19]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [20]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [21]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [22]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [23]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [8]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1607 [9]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [0]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [10]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [11]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [12]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [13]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [14]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [15]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [17]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [18]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [19]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [1]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [20]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [21]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [22]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [23]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [2]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [3]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [4]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [5]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [6]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [7]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [8]
Warning: found logic loop in module aes128_enc:
    cell $verific$xor_1309$aes128_enc.sv:148$1481 ($xor)
    wire $verific$buf_1333$aes128_enc.sv:148$1608 [9]
Found and reported 192 problems.

yosys> opt_expr

3.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge -nomux

3.16. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~85 debug messages>

yosys> opt_reduce

3.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.20. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.21. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$valid_o_reg$aes128_enc.sv:283$1637 ($aldff) from module aes128_enc.
Changing const-value async load to async reset on $verific$state_reg$aes128_enc.sv:283$1632 ($aldff) from module aes128_enc.
Changing const-value async load to async reset on $verific$round_reg$aes128_enc.sv:283$1634 ($aldff) from module aes128_enc.
Changing const-value async load to async reset on $verific$round_key_reg$aes128_enc.sv:283$1633 ($aldff) from module aes128_enc.
Changing const-value async load to async reset on $verific$data_o_reg$aes128_enc.sv:283$1636 ($aldff) from module aes128_enc.
Changing const-value async load to async reset on $verific$busy_reg$aes128_enc.sv:283$1635 ($aldff) from module aes128_enc.

yosys> opt_clean

3.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.24. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.24.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.24.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.24.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> fsm_opt

3.24.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.24.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.24.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.24.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge -nomux

3.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~85 debug messages>

yosys> opt_reduce

3.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.30. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.34. Executing WREDUCE pass (reducing word size of cells).
Removed top 3 bits (of 64) from port B of cell aes128_enc.$verific$xor_1326$aes128_enc.sv:129$1230 ($xor).
Removed top 3 bits (of 160) from port B of cell aes128_enc.$verific$xor_1312$aes128_enc.sv:129$1478 ($xor).
Removed top 3 bits (of 64) from port B of cell aes128_enc.$verific$xor_1297$aes128_enc.sv:129$1575 ($xor).
Removed top 3 bits (of 160) from port B of cell aes128_enc.$verific$xor_1296$aes128_enc.sv:129$1576 ($xor).
Removed top 3 bits (of 4) from port B of cell aes128_enc.$verific$add_1248$aes128_enc.sv:268$1616 ($add).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1679 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1680 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1681 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1683 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1684 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1688 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1736 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1737 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1738 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1740 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1741 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1745 ($mux).
Removed top 6 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1754 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1755 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1756 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1758 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1763 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1774 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1775 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1776 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1778 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1779 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1783 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1812 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1813 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1814 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1816 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1817 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1821 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1850 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1851 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1852 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1854 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1855 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1859 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1907 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1908 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1909 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1911 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1912 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1916 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1945 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1946 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1947 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1949 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1950 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1954 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1983 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1984 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1985 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1987 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1988 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$1992 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2021 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2022 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2023 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2025 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2026 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2030 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2059 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2060 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2061 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2063 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2064 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2068 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2097 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2098 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2099 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2101 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2102 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2106 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2135 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2136 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2137 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2139 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2140 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2144 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2173 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2174 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2175 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2177 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2178 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2182 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2211 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2212 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2213 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2215 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2216 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2220 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2249 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2250 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2251 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2253 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2254 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2258 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2287 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2288 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2289 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2291 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2292 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2296 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2325 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2326 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2327 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2329 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2330 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2334 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2363 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2364 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2365 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2367 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2368 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2372 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2382 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2383 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2384 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2386 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2387 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2391 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2420 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2421 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2422 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2424 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2425 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2429 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2477 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2478 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2479 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2481 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2482 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2486 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2515 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2516 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2517 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2519 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2520 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2524 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2553 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2554 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2555 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2557 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2558 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2562 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2572 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2573 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2574 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2576 ($mux).
Removed top 3 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2577 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2581 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2611 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2614 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2616 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2629 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2630 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2631 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2634 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2635 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2638 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2649 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2651 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2652 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2654 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2658 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2666 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2669 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2670 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2671 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2672 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2673 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2678 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2685 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2686 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2687 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2689 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2691 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2704 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2711 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2723 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2726 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2728 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2729 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2742 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2743 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2745 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2751 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2762 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2763 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2783 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2784 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2800 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2801 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2804 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2805 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2819 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2821 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2822 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2837 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2839 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2840 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2844 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2847 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2856 ($mux).
Removed top 6 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2860 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2862 ($mux).
Removed top 7 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2863 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2877 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2878 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2879 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2880 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2895 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2896 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2897 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2899 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2900 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2904 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2934 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2937 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2939 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2952 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2953 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2954 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2957 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2958 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2961 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2972 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2974 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2975 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2977 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2981 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2989 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2992 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2993 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2994 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2995 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$2996 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3001 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3008 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3009 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3010 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3012 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3014 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3027 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3034 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3046 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3049 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3051 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3052 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3065 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3066 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3068 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3074 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3085 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3086 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3106 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3107 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3123 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3124 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3127 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3128 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3142 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3144 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3145 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3160 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3162 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3163 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3167 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3170 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3179 ($mux).
Removed top 6 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3183 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3185 ($mux).
Removed top 7 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3186 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3200 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3201 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3202 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3203 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3218 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3219 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3220 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3222 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3223 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3227 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3257 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3260 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3262 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3275 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3276 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3277 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3280 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3281 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3284 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3295 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3297 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3298 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3300 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3304 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3312 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3315 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3316 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3317 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3318 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3319 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3324 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3331 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3332 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3333 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3335 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3337 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3350 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3357 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3369 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3372 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3374 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3375 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3388 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3389 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3391 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3397 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3408 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3409 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3429 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3430 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3446 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3447 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3450 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3451 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3465 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3467 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3468 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3483 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3485 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3486 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3490 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3493 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3502 ($mux).
Removed top 6 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3506 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3508 ($mux).
Removed top 7 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3509 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3523 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3524 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3525 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3526 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3541 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3542 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3543 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3545 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3546 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3550 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3580 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3583 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3585 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3598 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3599 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3600 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3603 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3604 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3607 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3618 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3620 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3621 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3623 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3627 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3635 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3638 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3639 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3640 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3641 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3642 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3647 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3654 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3655 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3656 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3658 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3660 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3673 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3680 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3692 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3695 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3697 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3698 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3711 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3712 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3714 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3720 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3731 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3732 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3752 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3753 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3769 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3770 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3773 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3774 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3788 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3790 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3791 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3806 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3808 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3809 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3813 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3816 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3825 ($mux).
Removed top 6 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3829 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3831 ($mux).
Removed top 7 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3832 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3846 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3847 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3848 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3849 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3864 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3865 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3866 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3868 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3869 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3873 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3903 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3906 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3908 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3921 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3922 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3923 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3926 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3927 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3930 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3941 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3943 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3944 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3946 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3950 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3958 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3961 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3962 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3963 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3964 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3965 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3970 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3977 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3978 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3979 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3981 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3983 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$3996 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4003 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4015 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4018 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4020 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4021 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4034 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4035 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4037 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4043 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4054 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4055 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4075 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4076 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4092 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4093 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4096 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4097 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4111 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4113 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4114 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4129 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4131 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4132 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4136 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4139 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4148 ($mux).
Removed top 6 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4152 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4154 ($mux).
Removed top 7 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4155 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4169 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4170 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4171 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4172 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4187 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4188 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4189 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4191 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4192 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4196 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4226 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4229 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4231 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4244 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4245 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4246 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4249 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4250 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4253 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4264 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4266 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4267 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4269 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4273 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4281 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4284 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4285 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4286 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4287 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4288 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4293 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4300 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4301 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4302 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4304 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4306 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4319 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4326 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4338 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4341 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4343 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4344 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4357 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4358 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4360 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4366 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4377 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4378 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4398 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4399 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4415 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4416 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4419 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4420 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4434 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4436 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4437 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4452 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4454 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4455 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4459 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4462 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4471 ($mux).
Removed top 6 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4475 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4477 ($mux).
Removed top 7 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4478 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4492 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4493 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4494 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4495 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4510 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4511 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4512 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4514 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4515 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4519 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4549 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4552 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4554 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4567 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4568 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4569 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4572 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4573 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4576 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4587 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4589 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4590 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4592 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4596 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4604 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4607 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4608 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4609 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4610 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4611 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4616 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4623 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4624 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4625 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4627 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4629 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4642 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4649 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4661 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4664 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4666 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4667 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4680 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4681 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4683 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4689 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4700 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4701 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4721 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4722 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4738 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4739 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4742 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4743 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4757 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4759 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4760 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4775 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4777 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4778 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4782 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4785 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4794 ($mux).
Removed top 6 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4798 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4800 ($mux).
Removed top 7 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4801 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4815 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4816 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4817 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4818 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4833 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4834 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4835 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4837 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4838 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4842 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4872 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4875 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4877 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4890 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4891 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4892 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4895 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4896 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4899 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4910 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4912 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4913 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4915 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4919 ($mux).
Removed top 5 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4927 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4930 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4931 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4932 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4933 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4934 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4939 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4946 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4947 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4948 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4950 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4952 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4965 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4972 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4984 ($mux).
Removed top 4 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4987 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4989 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$4990 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5003 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5004 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5006 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5012 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5023 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5024 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5044 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5045 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5061 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5062 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5065 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5066 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5080 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5082 ($mux).
Removed top 2 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5083 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5098 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5100 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5101 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5105 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5108 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5117 ($mux).
Removed top 6 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5121 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5123 ($mux).
Removed top 7 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5124 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5138 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5139 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5140 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5141 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5156 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5157 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5158 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5160 ($mux).
Removed top 3 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5161 ($mux).
Removed top 1 bits (of 8) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5165 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5193 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5197 ($mux).
Removed top 2 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5199 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5231 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5235 ($mux).
Removed top 2 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5237 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5269 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5273 ($mux).
Removed top 2 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5275 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5326 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5330 ($mux).
Removed top 2 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5332 ($mux).
Removed top 1 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5345 ($mux).
Removed top 1 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5349 ($mux).
Removed top 2 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5351 ($mux).
Removed top 1 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5364 ($mux).
Removed top 1 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5368 ($mux).
Removed top 2 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5370 ($mux).
Removed top 1 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5383 ($mux).
Removed top 1 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5387 ($mux).
Removed top 2 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5389 ($mux).
Removed top 1 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5402 ($mux).
Removed top 1 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5406 ($mux).
Removed top 2 bits (of 112) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5408 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5440 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5444 ($mux).
Removed top 2 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5446 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5478 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5482 ($mux).
Removed top 2 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5484 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5497 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5501 ($mux).
Removed top 2 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5503 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5535 ($mux).
Removed top 1 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5539 ($mux).
Removed top 2 bits (of 128) from mux cell aes128_enc.$auto$bmuxmap.cc:60:execute$5541 ($mux).
Removed top 8 bits (of 32) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1705.
Removed top 26 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1753.
Removed top 8 bits (of 32) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1762.
Removed top 13 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1772.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1791.
Removed top 13 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1810.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1829.
Removed top 13 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1848.
Removed top 821 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1905.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1924.
Removed top 21 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1943.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1962.
Removed top 21 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$1981.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2000.
Removed top 21 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2019.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2038.
Removed top 21 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2057.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2076.
Removed top 21 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2095.
Removed top 837 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2133.
Removed top 133 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2171.
Removed top 837 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2209.
Removed top 133 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2247.
Removed top 325 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2285.
Removed top 325 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2323.
Removed top 325 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2361.
Removed top 325 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2380.
Removed top 325 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2418.
Removed top 325 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2475.
Removed top 325 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2513.
Removed top 325 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2551.
Removed top 325 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2570.
Removed top 45 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2627.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2646.
Removed top 45 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2665.
Removed top 1 bits (of 32) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2674.
Removed top 3 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2684.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2703.
Removed top 3 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2722.
Removed top 45 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2741.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2760.
Removed top 45 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2779.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2798.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2817.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2836.
Removed top 23 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2855.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2874.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2893.
Removed top 14 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2912.
Removed top 2 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2931.
Removed top 1 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2950.
Removed top 53 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2969.
Removed top 3 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2988.
Removed top 1 bits (of 32) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$2997.
Removed top 1 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3007.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3026.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3045.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3064.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3083.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3102.
Removed top 53 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3121.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3140.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3159.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3178.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3197.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3216.
Removed top 6 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3235.
Removed top 15 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3254.
Removed top 1 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3273.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3292.
Removed top 3 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3311.
Removed top 1 bits (of 32) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3320.
Removed top 3 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3330.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3349.
Removed top 9 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3368.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3387.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3406.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3425.
Removed top 7 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3444.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3463.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3482.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3501.
Removed top 9 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3520.
Removed top 7 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3539.
Removed top 30 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3558.
Removed top 2 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3577.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3596.
Removed top 9 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3615.
Removed top 9 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3634.
Removed top 1 bits (of 32) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3643.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3653.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3672.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3691.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3710.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3729.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3748.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3767.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3786.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3805.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3824.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3843.
Removed top 7 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3862.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3881.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3900.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3919.
Removed top 9 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3938.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3957.
Removed top 1 bits (of 32) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3966.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3976.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$3995.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4014.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4033.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4052.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4071.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4090.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4109.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4128.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4147.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4166.
Removed top 7 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4185.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4204.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4223.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4242.
Removed top 9 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4261.
Removed top 9 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4280.
Removed top 1 bits (of 32) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4289.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4299.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4318.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4337.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4356.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4375.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4394.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4413.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4432.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4451.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4470.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4489.
Removed top 7 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4508.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4527.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4546.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4565.
Removed top 9 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4584.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4603.
Removed top 1 bits (of 32) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4612.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4622.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4641.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4660.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4679.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4698.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4717.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4736.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4755.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4774.
Removed top 37 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4793.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4812.
Removed top 7 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4831.
Removed top 6 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4850.
Removed top 42 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4869.
Removed top 1 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4888.
Removed top 45 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4907.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4926.
Removed top 1 bits (of 32) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4935.
Removed top 45 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4945.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4964.
Removed top 45 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$4983.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5002.
Removed top 45 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5021.
Removed top 5 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5040.
Removed top 45 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5059.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5078.
Removed top 45 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5097.
Removed top 23 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5116.
Removed top 45 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5135.
Removed top 21 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5154.
Removed top 13 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5173.
Removed top 14 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5192.
Removed top 241 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5230.
Removed top 17 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5249.
Removed top 17 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5268.
Removed top 241 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5325.
Removed top 17 bits (of 896) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5344.
Removed top 111 bits (of 896) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5363.
Removed top 17 bits (of 896) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5382.
Removed top 111 bits (of 896) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5401.
Removed top 17 bits (of 64) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5420.
Removed top 17 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5439.
Removed top 241 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5477.
Removed top 50 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5496.
Removed top 245 bits (of 1024) from wire aes128_enc.$auto$bmuxmap.cc:58:execute$5534.
Removed top 121 bits (of 128) from wire aes128_enc.$verific$n13958$1196.

yosys> peepopt

3.35. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.36. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 17 unused wires.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.37. Executing BMUXMAP pass.

yosys> demuxmap

3.38. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.39. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module aes128_enc:
  creating $macc model for $verific$add_1248$aes128_enc.sv:268$1616 ($add).
  creating $alu model for $macc $verific$add_1248$aes128_enc.sv:268$1616.
  creating $alu cell for $verific$add_1248$aes128_enc.sv:268$1616: $auto$alumacc.cc:485:replace_alu$5743
  created 1 $alu and 0 $macc cells.

yosys> opt_expr

3.40. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge -nomux

3.41. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~85 debug messages>

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.46. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
MAX OPT ITERATION = 1

yosys> stat

3.49. Printing statistics.

=== aes128_enc ===

   Number of wires:               1314
   Number of wire bits:         126061
   Number of public wires:          42
   Number of public wire bits:     777
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3117
     $adff                           6
     $alu                            1
     $and                            1
     $eq                             1
     $mux                         3089
     $ne                             1
     $not                            3
     $xor                           15


yosys> memory -nomap

3.50. Executing MEMORY pass.

yosys> opt_mem

3.50.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.50.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.50.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.50.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.50.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.50.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> memory_share

3.50.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.50.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.50.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> memory_collect

3.50.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.51. Printing statistics.

=== aes128_enc ===

   Number of wires:               1314
   Number of wire bits:         126061
   Number of public wires:          42
   Number of public wire bits:     777
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3117
     $adff                           6
     $alu                            1
     $and                            1
     $eq                             1
     $mux                         3089
     $ne                             1
     $not                            3
     $xor                           15


yosys> muxpack

3.52. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~1927 debug messages>

yosys> opt_clean

3.53. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> pmuxtree

3.54. Executing PMUXTREE pass.

yosys> muxpack

3.55. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~1927 debug messages>

yosys> memory_map

3.56. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.57. Printing statistics.

=== aes128_enc ===

   Number of wires:               1314
   Number of wire bits:         126061
   Number of public wires:          42
   Number of public wire bits:     777
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3117
     $adff                           6
     $alu                            1
     $and                            1
     $eq                             1
     $mux                         3089
     $ne                             1
     $not                            3
     $xor                           15


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.58. Executing TECHMAP pass (map to technology primitives).

3.58.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.58.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.58.3. Continuing TECHMAP pass.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $adff.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~3421 debug messages>

yosys> stat

3.59. Printing statistics.

=== aes128_enc ===

   Number of wires:               1353
   Number of wire bits:         127248
   Number of public wires:          42
   Number of public wire bits:     777
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              90927
     $_AND_                         11
     $_DFF_PN0_                    390
     $_MUX_                      88282
     $_NOT_                          8
     $_OR_                          11
     $_XOR_                       2225


yosys> opt_expr

3.60. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~37346 debug messages>

yosys> opt_merge -nomux

3.61. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
<suppressed ~101523 debug messages>
Removed a total of 33841 cells.

yosys> opt_muxtree

3.62. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.63. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.64. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.65. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.66. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.67. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 4 unused cells and 488 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.68. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~440 debug messages>

yosys> opt_muxtree

3.69. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.70. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.71. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.72. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.73. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.74. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> opt_expr

3.75. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.76. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~1315 debug messages>

yosys> techmap -map +/techmap.v

3.77. Executing TECHMAP pass (map to technology primitives).

3.77.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.77.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.78. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge -nomux

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.80. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.81. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.82. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.83. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.84. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 6 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.85. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
MAX OPT ITERATION = 1

yosys> abc -dff

3.86. Executing ABC pass (technology mapping using ABC).

3.86.1. Summary of detected clock domains:
  19398 cells in clk=\clk_i, en={ }, arst=!\rstn_i, srst={ }

3.86.2. Extracting gate netlist of module `\aes128_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, asynchronously reset by !\rstn_i
Extracted 19398 gates and 19657 wires to a netlist network with 257 inputs and 129 outputs.

3.86.2.1. Executing ABC.

yosys> abc -dff

3.87. Executing ABC pass (technology mapping using ABC).

3.87.1. Summary of detected clock domains:
  26829 cells in clk=\clk_i, en={ }, arst=!\rstn_i, srst={ }

3.87.2. Extracting gate netlist of module `\aes128_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, asynchronously reset by !\rstn_i
Extracted 26829 gates and 27086 wires to a netlist network with 257 inputs and 129 outputs.

3.87.2.1. Executing ABC.

yosys> abc -dff

3.88. Executing ABC pass (technology mapping using ABC).

3.88.1. Summary of detected clock domains:
  26941 cells in clk=\clk_i, en={ }, arst=!\rstn_i, srst={ }

3.88.2. Extracting gate netlist of module `\aes128_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, asynchronously reset by !\rstn_i
Extracted 26941 gates and 27198 wires to a netlist network with 257 inputs and 129 outputs.

3.88.2.1. Executing ABC.

yosys> abc -dff

3.89. Executing ABC pass (technology mapping using ABC).

3.89.1. Summary of detected clock domains:
  26937 cells in clk=\clk_i, en={ }, arst=!\rstn_i, srst={ }

3.89.2. Extracting gate netlist of module `\aes128_enc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_i, asynchronously reset by !\rstn_i
Extracted 26937 gates and 27194 wires to a netlist network with 257 inputs and 129 outputs.

3.89.2.1. Executing ABC.

yosys> opt_ffinv

3.90. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.91. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~215 debug messages>

yosys> opt_merge -nomux

3.92. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.93. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.94. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.95. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.96. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.97. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.98. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 83237 unused wires.
<suppressed ~36 debug messages>

yosys> opt_expr

3.99. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.100. Executing BMUXMAP pass.

yosys> demuxmap

3.101. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_bkrlzR/abc_tmp_1.scr

3.102. Executing ABC pass (technology mapping using ABC).

3.102.1. Extracting gate netlist of module `\aes128_enc' to `<abc-temp-dir>/input.blif'..
Extracted 26685 gates and 27203 wires to a netlist network with 518 inputs and 390 outputs.

3.102.1.1. Executing ABC.
DE:   #PIs = 518  #Luts =  3964  Max Lvl =  10  Avg Lvl =   7.36  [   0.66 sec. at Pass 0]
DE:   #PIs = 518  #Luts =  3188  Max Lvl =   9  Avg Lvl =   6.00  [  51.61 sec. at Pass 1]
DE:   #PIs = 518  #Luts =  3093  Max Lvl =   8  Avg Lvl =   5.84  [   8.21 sec. at Pass 2]
DE:   #PIs = 518  #Luts =  3050  Max Lvl =   8  Avg Lvl =   5.88  [  27.26 sec. at Pass 3]
DE:   #PIs = 518  #Luts =  3033  Max Lvl =   9  Avg Lvl =   5.79  [   9.30 sec. at Pass 4]
DE:   #PIs = 518  #Luts =  3009  Max Lvl =   9  Avg Lvl =   5.82  [  40.38 sec. at Pass 5]
DE:   #PIs = 518  #Luts =  2983  Max Lvl =   9  Avg Lvl =   5.70  [  18.45 sec. at Pass 6]
DE:   #PIs = 518  #Luts =  2983  Max Lvl =   9  Avg Lvl =   5.70  [  44.11 sec. at Pass 7]
DE:   #PIs = 518  #Luts =  2981  Max Lvl =   9  Avg Lvl =   5.70  [  14.48 sec. at Pass 8]
DE:   #PIs = 518  #Luts =  2967  Max Lvl =   9  Avg Lvl =   5.75  [  57.75 sec. at Pass 9]
DE:   #PIs = 518  #Luts =  2967  Max Lvl =   9  Avg Lvl =   5.75  [  13.10 sec. at Pass 10]
DE:   #PIs = 518  #Luts =  2967  Max Lvl =   9  Avg Lvl =   5.75  [  34.90 sec. at Pass 11]
DE:   #PIs = 518  #Luts =  2967  Max Lvl =   9  Avg Lvl =   5.75  [  10.71 sec. at Pass 12]
DE:   #PIs = 518  #Luts =  2967  Max Lvl =   9  Avg Lvl =   5.75  [   1.02 sec. at Pass 13]

yosys> opt_expr

3.103. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge -nomux

3.104. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.105. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.106. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.107. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.108. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.109. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.110. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 27203 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.111. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.112. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.113. Printing statistics.

=== aes128_enc ===

   Number of wires:               3235
   Number of wire bits:           3616
   Number of public wires:           7
   Number of public wire bits:     388
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3357
     $_DFF_PN0_                    390
     $lut                         2967


yosys> shregmap -minlen 8 -maxlen 20

3.114. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.115. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.116. Printing statistics.

=== aes128_enc ===

   Number of wires:               3235
   Number of wire bits:           3616
   Number of public wires:           7
   Number of public wire bits:     388
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3357
     $_DFF_PN0_                    390
     $lut                         2967


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.117. Executing TECHMAP pass (map to technology primitives).

3.117.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.117.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.117.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
No more expansions possible.
<suppressed ~3493 debug messages>

yosys> opt_expr -mux_undef

3.118. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~73113 debug messages>

yosys> simplemap

3.119. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.120. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge

3.121. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
<suppressed ~73779 debug messages>
Removed a total of 24593 cells.

yosys> opt_dff -nodffe -nosdff

3.122. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.123. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 6936 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.124. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
<suppressed ~2645 debug messages>

yosys> opt_merge -nomux

3.125. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
<suppressed ~483 debug messages>
Removed a total of 161 cells.

yosys> opt_muxtree

3.126. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.127. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.128. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.129. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.130. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.131. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 458 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.132. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_bkrlzR/abc_tmp_2.scr

3.133. Executing ABC pass (technology mapping using ABC).

3.133.1. Extracting gate netlist of module `\aes128_enc' to `<abc-temp-dir>/input.blif'..
Extracted 30301 gates and 30821 wires to a netlist network with 518 inputs and 390 outputs.

3.133.1.1. Executing ABC.
DE:   #PIs = 518  #Luts =  3297  Max Lvl =   9  Avg Lvl =   5.88  [   0.91 sec. at Pass 0]
DE:   #PIs = 518  #Luts =  3148  Max Lvl =   9  Avg Lvl =   5.88  [  60.95 sec. at Pass 1]
DE:   #PIs = 518  #Luts =  3028  Max Lvl =   8  Avg Lvl =   5.70  [   8.70 sec. at Pass 2]
DE:   #PIs = 518  #Luts =  3009  Max Lvl =   8  Avg Lvl =   5.74  [  37.14 sec. at Pass 3]
DE:   #PIs = 518  #Luts =  2971  Max Lvl =   9  Avg Lvl =   5.73  [  12.90 sec. at Pass 4]
DE:   #PIs = 518  #Luts =  2969  Max Lvl =   8  Avg Lvl =   5.75  [  41.12 sec. at Pass 5]
DE:   #PIs = 518  #Luts =  2950  Max Lvl =   8  Avg Lvl =   5.70  [  14.60 sec. at Pass 6]
DE:   #PIs = 518  #Luts =  2950  Max Lvl =   8  Avg Lvl =   5.70  [  33.53 sec. at Pass 7]
DE:   #PIs = 518  #Luts =  2950  Max Lvl =   8  Avg Lvl =   5.70  [  12.24 sec. at Pass 8]
DE:   #PIs = 518  #Luts =  2950  Max Lvl =   8  Avg Lvl =   5.70  [  35.24 sec. at Pass 9]
DE:   #PIs = 518  #Luts =  2950  Max Lvl =   8  Avg Lvl =   5.70  [   1.48 sec. at Pass 10]

yosys> opt_expr

3.134. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.

yosys> opt_merge -nomux

3.135. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.136. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \aes128_enc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.137. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \aes128_enc.
Performed a total of 0 changes.

yosys> opt_merge

3.138. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\aes128_enc'.
Removed a total of 0 cells.

yosys> opt_share

3.139. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.140. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.141. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..
Removed 0 unused cells and 12582 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.142. Executing OPT_EXPR pass (perform const folding).
Optimizing module aes128_enc.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.143. Executing HIERARCHY pass (managing design hierarchy).

3.143.1. Analyzing design hierarchy..
Top module:  \aes128_enc

3.143.2. Analyzing design hierarchy..
Top module:  \aes128_enc
Removed 0 unused modules.

yosys> stat

3.144. Printing statistics.

=== aes128_enc ===

   Number of wires:               3218
   Number of wire bits:           3599
   Number of public wires:           7
   Number of public wire bits:     388
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3340
     $lut                         2950
     dffsre                        390


yosys> opt_clean -purge

3.145. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \aes128_enc..

yosys> write_verilog -noattr -nohex synthesized.v

3.146. Executing Verilog backend.
Dumping module `\aes128_enc'.

Warnings: 197 unique messages, 197 total
End of script. Logfile hash: 9abdab30e9, CPU: user 87.99s system 0.40s, MEM: 503.81 MB peak
Yosys 0.18+10 (git sha1 a3cbfccc4, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 98% 6x abc (4169 sec), 0% 12x opt_dff (31 sec), ...
real 712.38
user 4049.71
sys 202.76
