
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.50
 Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Tue May 31 17:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k gost89_cfb_encrypt.v gost89_ecb_encrypt.v gost89_round.v gost89_sbox.v

yosys> verific -vlog2k gost89_cfb_encrypt.v gost89_ecb_encrypt.v gost89_round.v gost89_sbox.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Tue May 31 17:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_cfb_encrypt.v'
VERIFIC-INFO [VERI-2561] gost89_cfb_encrypt.v:17: undeclared symbol 'reset_ecb', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_ecb_encrypt.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_round.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_sbox.v'

yosys> synth_rs -top gost89_cfb_encrypt -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.59

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top gost89_cfb_encrypt

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] gost89_cfb_encrypt.v:1: compiling module 'gost89_cfb_encrypt'
VERIFIC-INFO [VERI-1018] gost89_ecb_encrypt.v:1: compiling module 'gost89_ecb_encrypt'
VERIFIC-INFO [VERI-1018] gost89_round.v:1: compiling module 'gost89_round'
VERIFIC-INFO [VERI-1018] gost89_sbox.v:1: compiling module 'gost89_sbox'
VERIFIC-WARNING [VERI-1209] gost89_ecb_encrypt.v:33: expression size 7 truncated to fit in target size 6
Importing module gost89_cfb_encrypt.
Importing module gost89_ecb_encrypt.
Importing module gost89_round.
Importing module gost89_sbox.

3.3.1. Analyzing design hierarchy..
Top module:  \gost89_cfb_encrypt
Used module:     \gost89_ecb_encrypt
Used module:         \gost89_round
Used module:             \gost89_sbox

3.3.2. Analyzing design hierarchy..
Top module:  \gost89_cfb_encrypt
Used module:     \gost89_ecb_encrypt
Used module:         \gost89_round
Used module:             \gost89_sbox
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_sbox.
Optimizing module gost89_round.
Optimizing module gost89_ecb_encrypt.
<suppressed ~3 debug messages>
Optimizing module gost89_cfb_encrypt.

yosys> bmuxmap

3.5. Executing BMUXMAP pass.

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).
Deleting now unused module gost89_ecb_encrypt.
Deleting now unused module gost89_round.
Deleting now unused module gost89_sbox.
<suppressed ~10 debug messages>

yosys> bmuxmap

3.8. Executing BMUXMAP pass.

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 2343 unused wires.
<suppressed ~27 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module gost89_cfb_encrypt...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.15. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.15.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.15.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.15.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.15.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
    New ctrl vector for $pmux cell $flatten\ecb_encrypt.$verific$select_114$gost89_ecb_encrypt.v:80$1809: { $auto$opt_reduce.cc:134:opt_pmux$2450 $auto$opt_reduce.cc:134:opt_pmux$2448 $auto$opt_reduce.cc:134:opt_pmux$2446 $auto$opt_reduce.cc:134:opt_pmux$2444 $auto$opt_reduce.cc:134:opt_pmux$2442 $auto$opt_reduce.cc:134:opt_pmux$2440 $auto$opt_reduce.cc:134:opt_pmux$2438 $auto$opt_reduce.cc:134:opt_pmux$2436 $flatten\ecb_encrypt.$verific$n1897$1002 }
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 1 changes.

yosys> opt_merge

3.15.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.6. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$out_reg$gost89_cfb_encrypt.v:38$952 ($aldff) from module gost89_cfb_encrypt.
Removing never-active async load on $verific$in_value_reg$gost89_cfb_encrypt.v:38$951 ($aldff) from module gost89_cfb_encrypt.
Removing never-active async load on $verific$gamma_reg$gost89_cfb_encrypt.v:38$949 ($aldff) from module gost89_cfb_encrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$round_num_reg$gost89_ecb_encrypt.v:44$1772 ($aldff) from module gost89_cfb_encrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$round_key_reg$gost89_ecb_encrypt.v:80$1810 ($aldff) from module gost89_cfb_encrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$out_reg$gost89_ecb_encrypt.v:44$1773 ($aldff) from module gost89_cfb_encrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$n2_reg$gost89_ecb_encrypt.v:44$1770 ($aldff) from module gost89_cfb_encrypt.
Removing never-active async load on $flatten\ecb_encrypt.$verific$n1_reg$gost89_ecb_encrypt.v:44$1769 ($aldff) from module gost89_cfb_encrypt.

yosys> opt_clean

3.15.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.15.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
<suppressed ~6 debug messages>

3.15.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.15.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.15.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.15.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.15.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 1 unused cells and 2 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.15.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

3.15.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.15.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.15.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.15.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.15.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..

yosys> opt_expr

3.15.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

3.15.23. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.16. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.16.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.16.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.16.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.16.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..

yosys> fsm_opt

3.16.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.16.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.16.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.16.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat -nosdff

3.17. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.17.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

yosys> opt_merge -nomux

3.17.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.17.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.17.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.17.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$out_reg$gost89_cfb_encrypt.v:38$952 ($dff) from module gost89_cfb_encrypt (D = $verific$n348$20, Q = \out).
Adding EN signal on $verific$in_value_reg$gost89_cfb_encrypt.v:38$951 ($dff) from module gost89_cfb_encrypt (D = \in, Q = \in_value).
Adding EN signal on $verific$gamma_reg$gost89_cfb_encrypt.v:38$949 ($dff) from module gost89_cfb_encrypt (D = $verific$n609$22, Q = \gamma).
Adding EN signal on $verific$busy_reg$gost89_cfb_encrypt.v:38$950 ($dff) from module gost89_cfb_encrypt (D = $verific$n739$16, Q = \busy).
Adding EN signal on $flatten\ecb_encrypt.$verific$round_key_reg$gost89_ecb_encrypt.v:80$1810 ($dff) from module gost89_cfb_encrypt (D = $flatten\ecb_encrypt.$verific$n1898$1057, Q = \ecb_encrypt.round_key).
Adding EN signal on $flatten\ecb_encrypt.$verific$out_reg$gost89_ecb_encrypt.v:44$1773 ($dff) from module gost89_cfb_encrypt (D = { \ecb_encrypt.n1 \ecb_encrypt.out1 }, Q = \ecb_encrypt.out).

yosys> opt_clean

3.17.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 4 unused cells and 4 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.17.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
<suppressed ~6 debug messages>

3.17.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.17.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~19 debug messages>

yosys> opt_reduce

3.17.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.17.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.17.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.17.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.17.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

3.17.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.17.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~19 debug messages>

yosys> opt_reduce

3.17.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.17.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.17.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.17.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..

yosys> opt_expr

3.17.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

3.17.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.18. Executing WREDUCE pass (reducing word size of cells).
Removed top 5 bits (of 6) from port A of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$LessThan_25$gost89_ecb_encrypt.v:34$1754 ($lt).
Removed top 5 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1751 ($add).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_100$gost89_ecb_encrypt.v:67$1793 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_101$gost89_ecb_encrypt.v:68$1794 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_102$gost89_ecb_encrypt.v:69$1795 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_103$gost89_ecb_encrypt.v:70$1796 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_104$gost89_ecb_encrypt.v:71$1797 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_105$gost89_ecb_encrypt.v:72$1798 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_106$gost89_ecb_encrypt.v:73$1799 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_107$gost89_ecb_encrypt.v:74$1800 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_108$gost89_ecb_encrypt.v:75$1801 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_109$gost89_ecb_encrypt.v:76$1802 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_110$gost89_ecb_encrypt.v:77$1803 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_111$gost89_ecb_encrypt.v:78$1804 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_112$gost89_ecb_encrypt.v:79$1805 ($eq).
Removed top 5 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_82$gost89_ecb_encrypt.v:49$1775 ($eq).
Removed top 4 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_83$gost89_ecb_encrypt.v:50$1776 ($eq).
Removed top 4 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_84$gost89_ecb_encrypt.v:51$1777 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_85$gost89_ecb_encrypt.v:52$1778 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_86$gost89_ecb_encrypt.v:53$1779 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_87$gost89_ecb_encrypt.v:54$1780 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_88$gost89_ecb_encrypt.v:55$1781 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_89$gost89_ecb_encrypt.v:56$1782 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_90$gost89_ecb_encrypt.v:57$1783 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_91$gost89_ecb_encrypt.v:58$1784 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_92$gost89_ecb_encrypt.v:59$1785 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_93$gost89_ecb_encrypt.v:60$1786 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_94$gost89_ecb_encrypt.v:61$1787 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_95$gost89_ecb_encrypt.v:62$1788 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_96$gost89_ecb_encrypt.v:63$1789 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_97$gost89_ecb_encrypt.v:64$1790 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_98$gost89_ecb_encrypt.v:65$1791 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_cfb_encrypt.$flatten\ecb_encrypt.$verific$equal_99$gost89_ecb_encrypt.v:66$1792 ($eq).

yosys> peepopt

3.19. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.20. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..

yosys> bmuxmap

3.21. Executing BMUXMAP pass.

yosys> demuxmap

3.22. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.23. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module gost89_cfb_encrypt:
  creating $macc model for $flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1751 ($add).
  creating $macc model for $flatten\ecb_encrypt.\rnd.$verific$add_3$gost89_round.v:12$1817 ($add).
  creating $alu model for $macc $flatten\ecb_encrypt.\rnd.$verific$add_3$gost89_round.v:12$1817.
  creating $alu model for $macc $flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1751.
  creating $alu model for $flatten\ecb_encrypt.$verific$LessThan_21$gost89_ecb_encrypt.v:32$1750 ($lt): new $alu
  creating $alu model for $flatten\ecb_encrypt.$verific$LessThan_25$gost89_ecb_encrypt.v:34$1754 ($lt): new $alu
  creating $alu model for $flatten\ecb_encrypt.$verific$equal_32$gost89_ecb_encrypt.v:38$1760 ($eq): merged with $flatten\ecb_encrypt.$verific$LessThan_21$gost89_ecb_encrypt.v:32$1750.
  creating $alu cell for $flatten\ecb_encrypt.$verific$LessThan_25$gost89_ecb_encrypt.v:34$1754: $auto$alumacc.cc:485:replace_alu$2469
  creating $alu cell for $flatten\ecb_encrypt.$verific$LessThan_21$gost89_ecb_encrypt.v:32$1750, $flatten\ecb_encrypt.$verific$equal_32$gost89_ecb_encrypt.v:38$1760: $auto$alumacc.cc:485:replace_alu$2474
  creating $alu cell for $flatten\ecb_encrypt.$verific$add_22$gost89_ecb_encrypt.v:33$1751: $auto$alumacc.cc:485:replace_alu$2485
  creating $alu cell for $flatten\ecb_encrypt.\rnd.$verific$add_3$gost89_round.v:12$1817: $auto$alumacc.cc:485:replace_alu$2488
  created 4 $alu and 0 $macc cells.

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.25. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~19 debug messages>

yosys> opt_reduce

3.27. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
    New input vector for $reduce_and cell $auto$opt_dff.cc:220:make_patterns_logic$2466: { $auto$alumacc.cc:501:replace_alu$2475 $auto$rtlil.cc:2369:Not$2464 }
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 1 changes.

yosys> opt_merge

3.28. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.29. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.30. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.32. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
MAX OPT ITERATION = 1

yosys> stat

3.33. Printing statistics.

=== gost89_cfb_encrypt ===

   Number of wires:                174
   Number of wire bits:           4539
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                214
     $alu                            4
     $and                            6
     $dff                            4
     $dffe                           6
     $eq                            31
     $logic_not                      1
     $mux                          137
     $not                            8
     $or                             1
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    2
     $reduce_or                      9
     $xor                            2


yosys> memory -nomap

3.34. Executing MEMORY pass.

yosys> opt_mem

3.34.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.34.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.34.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.34.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.34.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.34.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..

yosys> memory_share

3.34.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.34.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.34.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..

yosys> memory_collect

3.34.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.35. Printing statistics.

=== gost89_cfb_encrypt ===

   Number of wires:                174
   Number of wire bits:           4539
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                214
     $alu                            4
     $and                            6
     $dff                            4
     $dffe                           6
     $eq                            31
     $logic_not                      1
     $mux                          137
     $not                            8
     $or                             1
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    2
     $reduce_or                      9
     $xor                            2


yosys> muxpack

3.36. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~138 debug messages>

yosys> opt_clean

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..

yosys> pmuxtree

3.38. Executing PMUXTREE pass.

yosys> muxpack

3.39. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting gost89_cfb_encrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2507 ... gost89_cfb_encrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2509 to a pmux with 2 cases.
Converting gost89_cfb_encrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2497 ... gost89_cfb_encrypt.$auto$pmuxtree.cc:65:recursive_mux_generator$2499 to a pmux with 2 cases.
Converted 4 (p)mux cells into 2 pmux cells.
<suppressed ~146 debug messages>

yosys> memory_map

3.40. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.41. Printing statistics.

=== gost89_cfb_encrypt ===

   Number of wires:                188
   Number of wire bits:           4832
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                225
     $alu                            4
     $and                            6
     $dff                            4
     $dffe                           6
     $eq                            31
     $logic_not                      1
     $mux                          142
     $not                            9
     $or                             3
     $pmux                           2
     $reduce_and                     2
     $reduce_bool                    2
     $reduce_or                     11
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.42. Executing TECHMAP pass (map to technology primitives).

3.42.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.42.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.42.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $or.
Using template $paramod$8fabc56b80a569262acfc42757a02ca0b8e91278\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $reduce_bool.
Using template $paramod$32efbfac1c4dc57230cf86180788fdfd12e3b511\_90_alu for cells of type $alu.
Using template $paramod$00298f3f8094950cb9a5ff2fda48d0d8bde8806c\_90_alu for cells of type $alu.
Using template $paramod$be80489e44a49c29884f59fd81c31ed03229cfc1\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
No more expansions possible.
<suppressed ~804 debug messages>

yosys> stat

3.43. Printing statistics.

=== gost89_cfb_encrypt ===

   Number of wires:                729
   Number of wire bits:          10294
   Number of public wires:          61
   Number of public wire bits:    3474
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2453
     $_AND_                        193
     $_DFFE_PP_                    289
     $_DFF_P_                       71
     $_MUX_                       1100
     $_NOT_                         91
     $_OR_                         322
     $_XOR_                        355
     adder_carry                    32


yosys> opt_expr

3.44. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
<suppressed ~345 debug messages>

yosys> opt_merge -nomux

3.45. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
<suppressed ~636 debug messages>
Removed a total of 212 cells.

yosys> opt_muxtree

3.46. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.47. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.48. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.49. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.50. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 50 unused cells and 556 unused wires.
<suppressed ~51 debug messages>

yosys> opt_expr

3.52. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

yosys> opt_muxtree

3.53. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.55. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.56. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.57. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..

yosys> opt_expr

3.59. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
MAX OPT ITERATION = 2

yosys> opt -nodffe -fast -full -nosdff

3.60. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.60.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
<suppressed ~131 debug messages>

yosys> opt_merge

3.60.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.60.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.60.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

3.60.5. Finished fast OPT passes.

yosys> techmap -map +/techmap.v

3.61. Executing TECHMAP pass (map to technology primitives).

3.61.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.61.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -nodffe -sat -nosdff

3.62. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.62.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

yosys> opt_merge -nomux

3.62.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.62.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.62.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.62.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat -nosdff

3.62.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.62.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..

yosys> opt_expr

3.62.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

3.62.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.63. Executing ABC pass (technology mapping using ABC).

3.63.1. Summary of detected clock domains:
  647 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$2465, arst={ }, srst={ }
  389 cells in clk=\clk, en={ }, arst={ }, srst={ }
  67 cells in clk=\clk, en=$verific$n347$15, arst={ }, srst={ }
  66 cells in clk=\clk, en=\ecb_encrypt.load_data, arst={ }, srst={ }
  131 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$2454, arst={ }, srst={ }
  561 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$2460, arst={ }, srst={ }
  3 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$2457, arst={ }, srst={ }

3.63.2. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2465
Extracted 647 gates and 1326 wires to a netlist network with 679 inputs and 97 outputs.

3.63.2.1. Executing ABC.

3.63.3. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 357 gates and 488 wires to a netlist network with 130 inputs and 111 outputs.

3.63.3.1. Executing ABC.

3.63.4. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $verific$n347$15
Extracted 67 gates and 135 wires to a netlist network with 68 inputs and 65 outputs.

3.63.4.1. Executing ABC.

3.63.5. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \ecb_encrypt.load_data
Extracted 66 gates and 132 wires to a netlist network with 66 inputs and 66 outputs.

3.63.5.1. Executing ABC.

3.63.6. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2454
Extracted 131 gates and 262 wires to a netlist network with 131 inputs and 66 outputs.

3.63.6.1. Executing ABC.

3.63.7. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2460
Extracted 561 gates and 829 wires to a netlist network with 268 inputs and 33 outputs.

3.63.7.1. Executing ABC.

3.63.8. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2457
Extracted 3 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.63.8.1. Executing ABC.

yosys> abc -dff

3.64. Executing ABC pass (technology mapping using ABC).

3.64.1. Summary of detected clock domains:
  112 cells in clk=\clk, en=$abc$7138$ecb_encrypt.load_data, arst={ }, srst={ }
  84 cells in clk=\clk, en=$abc$6942$verific$n347$15, arst={ }, srst={ }
  76 cells in clk=\clk, en=$abc$5720$auto$opt_dff.cc:219:make_patterns_logic$2465, arst={ }, srst={ }
  149 cells in clk=\clk, en=$abc$7333$auto$opt_dff.cc:194:make_patterns_logic$2454, arst={ }, srst={ }
  995 cells in clk=\clk, en={ }, arst={ }, srst={ }
  576 cells in clk=\clk, en=$abc$7529$auto$opt_dff.cc:194:make_patterns_logic$2460, arst={ }, srst={ }
  4 cells in clk=\clk, en=$abc$8136$auto$opt_dff.cc:194:make_patterns_logic$2457, arst={ }, srst={ }

3.64.2. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7138$ecb_encrypt.load_data
Extracted 112 gates and 225 wires to a netlist network with 113 inputs and 65 outputs.

3.64.2.1. Executing ABC.

3.64.3. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$6942$verific$n347$15
Extracted 84 gates and 167 wires to a netlist network with 83 inputs and 81 outputs.

3.64.3.1. Executing ABC.

3.64.4. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$5720$auto$opt_dff.cc:219:make_patterns_logic$2465
Extracted 76 gates and 153 wires to a netlist network with 77 inputs and 65 outputs.

3.64.4.1. Executing ABC.

3.64.5. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7333$auto$opt_dff.cc:194:make_patterns_logic$2454
Extracted 149 gates and 300 wires to a netlist network with 151 inputs and 65 outputs.

3.64.5.1. Executing ABC.

3.64.6. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 963 gates and 1601 wires to a netlist network with 638 inputs and 134 outputs.

3.64.6.1. Executing ABC.

3.64.7. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7529$auto$opt_dff.cc:194:make_patterns_logic$2460
Extracted 576 gates and 846 wires to a netlist network with 270 inputs and 33 outputs.

3.64.7.1. Executing ABC.

3.64.8. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8136$auto$opt_dff.cc:194:make_patterns_logic$2457
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.64.8.1. Executing ABC.

yosys> abc -dff

3.65. Executing ABC pass (technology mapping using ABC).

3.65.1. Summary of detected clock domains:
  110 cells in clk=\clk, en=$abc$8141$abc$7138$ecb_encrypt.load_data, arst={ }, srst={ }
  160 cells in clk=\clk, en=$abc$8742$abc$7333$auto$opt_dff.cc:194:make_patterns_logic$2454, arst={ }, srst={ }
  72 cells in clk=\clk, en=$abc$8335$abc$6942$verific$n347$15, arst={ }, srst={ }
  238 cells in clk=\clk, en=$abc$8546$abc$5720$auto$opt_dff.cc:219:make_patterns_logic$2465, arst={ }, srst={ }
  897 cells in clk=\clk, en={ }, arst={ }, srst={ }
  535 cells in clk=\clk, en=$abc$10008$abc$7529$auto$opt_dff.cc:194:make_patterns_logic$2460, arst={ }, srst={ }
  4 cells in clk=\clk, en=$abc$10573$abc$8136$auto$opt_dff.cc:194:make_patterns_logic$2457, arst={ }, srst={ }

3.65.2. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8141$abc$7138$ecb_encrypt.load_data
Extracted 110 gates and 213 wires to a netlist network with 103 inputs and 77 outputs.

3.65.2.1. Executing ABC.

3.65.3. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8742$abc$7333$auto$opt_dff.cc:194:make_patterns_logic$2454
Extracted 160 gates and 298 wires to a netlist network with 138 inputs and 66 outputs.

3.65.3.1. Executing ABC.

3.65.4. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8335$abc$6942$verific$n347$15
Extracted 72 gates and 145 wires to a netlist network with 73 inputs and 65 outputs.

3.65.4.1. Executing ABC.

3.65.5. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8546$abc$5720$auto$opt_dff.cc:219:make_patterns_logic$2465
Extracted 238 gates and 466 wires to a netlist network with 228 inputs and 76 outputs.

3.65.5.1. Executing ABC.

3.65.6. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 865 gates and 1398 wires to a netlist network with 533 inputs and 114 outputs.

3.65.6.1. Executing ABC.

3.65.7. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10008$abc$7529$auto$opt_dff.cc:194:make_patterns_logic$2460
Extracted 535 gates and 806 wires to a netlist network with 271 inputs and 33 outputs.

3.65.7.1. Executing ABC.

3.65.8. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10573$abc$8136$auto$opt_dff.cc:194:make_patterns_logic$2457
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.65.8.1. Executing ABC.

yosys> abc -dff

3.66. Executing ABC pass (technology mapping using ABC).

3.66.1. Summary of detected clock domains:
  75 cells in clk=\clk, en=$abc$10579$abc$8141$abc$7138$ecb_encrypt.load_data, arst={ }, srst={ }
  167 cells in clk=\clk, en=$abc$10785$abc$8742$abc$7333$auto$opt_dff.cc:194:make_patterns_logic$2454, arst={ }, srst={ }
  87 cells in clk=\clk, en=$abc$10981$abc$8335$abc$6942$verific$n347$15, arst={ }, srst={ }
  322 cells in clk=\clk, en=$abc$11176$abc$8546$abc$5720$auto$opt_dff.cc:219:make_patterns_logic$2465, arst={ }, srst={ }
  900 cells in clk=\clk, en={ }, arst={ }, srst={ }
  562 cells in clk=\clk, en=$abc$12488$abc$10008$abc$7529$auto$opt_dff.cc:194:make_patterns_logic$2460, arst={ }, srst={ }
  4 cells in clk=\clk, en=$abc$13082$abc$10573$abc$8136$auto$opt_dff.cc:194:make_patterns_logic$2457, arst={ }, srst={ }

3.66.2. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10579$abc$8141$abc$7138$ecb_encrypt.load_data
Extracted 75 gates and 151 wires to a netlist network with 76 inputs and 72 outputs.

3.66.2.1. Executing ABC.

3.66.3. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10785$abc$8742$abc$7333$auto$opt_dff.cc:194:make_patterns_logic$2454
Extracted 167 gates and 305 wires to a netlist network with 138 inputs and 66 outputs.

3.66.3.1. Executing ABC.

3.66.4. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10981$abc$8335$abc$6942$verific$n347$15
Extracted 87 gates and 175 wires to a netlist network with 88 inputs and 74 outputs.

3.66.4.1. Executing ABC.

3.66.5. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$11176$abc$8546$abc$5720$auto$opt_dff.cc:219:make_patterns_logic$2465
Extracted 322 gates and 585 wires to a netlist network with 263 inputs and 82 outputs.

3.66.5.1. Executing ABC.

3.66.6. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 868 gates and 1388 wires to a netlist network with 520 inputs and 115 outputs.

3.66.6.1. Executing ABC.

3.66.7. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12488$abc$10008$abc$7529$auto$opt_dff.cc:194:make_patterns_logic$2460
Extracted 562 gates and 831 wires to a netlist network with 269 inputs and 33 outputs.

3.66.7.1. Executing ABC.

3.66.8. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13082$abc$10573$abc$8136$auto$opt_dff.cc:194:make_patterns_logic$2457
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.66.8.1. Executing ABC.

yosys> opt_ffinv

3.67. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat -nosdff

3.68. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.68.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
<suppressed ~25 debug messages>

yosys> opt_merge -nomux

3.68.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
<suppressed ~105 debug messages>
Removed a total of 35 cells.

yosys> opt_muxtree

3.68.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.68.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.68.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14126 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li41_li41, Q = $abc$14084$lo41).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14120 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li35_li35, Q = $abc$14084$lo35).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14144 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li59_li59, Q = $abc$14084$lo59).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14148 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li63_li63, Q = $abc$14084$lo63).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14130 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li45_li45, Q = $abc$14084$lo45).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14140 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li55_li55, Q = $abc$14084$lo55).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14152 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li67_li67, Q = $abc$14084$lo67).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14127 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li42_li42, Q = $abc$14084$lo42).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14151 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li66_li66, Q = $abc$14084$lo66).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14150 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li65_li65, Q = $abc$14084$lo65).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14147 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li62_li62, Q = $abc$14084$lo62).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14128 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li43_li43, Q = $abc$14084$lo43).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14146 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li61_li61, Q = $abc$14084$lo61).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14104 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li19_li19, Q = $abc$14084$lo19).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14101 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li16_li16, Q = $abc$14084$lo16).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14100 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li15_li15, Q = $abc$14084$lo15).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14098 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li13_li13, Q = $abc$14084$lo13).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14129 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li44_li44, Q = $abc$14084$lo44).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14091 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li06_li06, Q = $abc$14084$lo06).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14136 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li51_li51, Q = $abc$14084$lo51).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14114 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li29_li29, Q = $abc$14084$lo29).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14142 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li57_li57, Q = $abc$14084$lo57).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14131 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li46_li46, Q = $abc$14084$lo46).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14155 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li70_li70, Q = $abc$14084$lo70).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14143 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li58_li58, Q = $abc$14084$lo58).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14134 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li49_li49, Q = $abc$14084$lo49).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14137 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li52_li52, Q = $abc$14084$lo52).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14135 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$14084$li50_li50, Q = $abc$14084$lo50).

yosys> opt_clean

3.68.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 13584 unused wires.
<suppressed ~15 debug messages>

yosys> opt_expr

3.68.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
<suppressed ~56 debug messages>

3.68.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.68.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.68.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
<suppressed ~141 debug messages>
Removed a total of 47 cells.

yosys> opt_dff -sat -nosdff

3.68.13. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14116 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$11540$li21_li21, Q = $abc$11540$lo21).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14096 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$10785$abc$8937$li61_li61, Q = $abc$14084$lo11).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14095 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$11540$li70_li70, Q = $abc$11540$lo70).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14094 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$10785$abc$8937$li62_li62, Q = $abc$14084$lo09).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14092 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$10785$abc$8937$li60_li60, Q = $abc$11176$abc$8937$lo60).
Adding EN signal on $abc$14084$auto$blifparse.cc:362:parse_blif$14088 ($_DFF_P_) from module gost89_cfb_encrypt (D = $abc$11540$li50_li50, Q = $abc$11540$lo50).

yosys> opt_clean

3.68.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 81 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.68.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
<suppressed ~12 debug messages>

3.68.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.68.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.68.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
<suppressed ~24 debug messages>
Removed a total of 8 cells.

yosys> opt_dff -sat -nosdff

3.68.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.68.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 14 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.68.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

3.68.23. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.68.24. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.25. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.68.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.68.27. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.68.28. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..

yosys> opt_expr

3.68.29. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

3.68.30. Finished OPT passes. (There is nothing left to do.)

yosys> bmuxmap

3.69. Executing BMUXMAP pass.

yosys> demuxmap

3.70. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /home/users/temp_dir/yosys_KVwW0a/abc_tmp_1.scr

3.71. Executing ABC pass (technology mapping using ABC).

3.71.1. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Extracted 1722 gates and 2884 wires to a netlist network with 1161 inputs and 302 outputs.

3.71.1.1. Executing ABC.
DE:   #PIs = 1161  #Luts =   594  Max Lvl =   5  Avg Lvl =   2.32  [   0.07 sec. at Pass 0]
DE:   #PIs = 1161  #Luts =   561  Max Lvl =   5  Avg Lvl =   2.20  [   1.53 sec. at Pass 1]
DE:   #PIs = 1161  #Luts =   561  Max Lvl =   5  Avg Lvl =   2.20  [   0.40 sec. at Pass 2]
DE:   #PIs = 1161  #Luts =   560  Max Lvl =   5  Avg Lvl =   2.20  [   0.51 sec. at Pass 3]
DE:   #PIs = 1161  #Luts =   560  Max Lvl =   5  Avg Lvl =   2.20  [   0.43 sec. at Pass 4]
DE:   #PIs = 1161  #Luts =   552  Max Lvl =   5  Avg Lvl =   2.20  [   0.52 sec. at Pass 5]
DE:   #PIs = 1161  #Luts =   549  Max Lvl =   5  Avg Lvl =   2.20  [   0.50 sec. at Pass 6]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.20  [   0.54 sec. at Pass 7]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.20  [   0.49 sec. at Pass 8]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.20  [   0.55 sec. at Pass 9]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.20  [   0.54 sec. at Pass 10]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.20  [   2.92 sec. at Pass 11]
DE:   #PIs = 1161  #Luts =   539  Max Lvl =   5  Avg Lvl =   2.20  [   0.15 sec. at Pass 12]

yosys> opt_expr

3.72. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

yosys> opt_merge -nomux

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.74. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.75. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.77. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.78. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.79. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 2882 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.80. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.81. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.82. Printing statistics.

=== gost89_cfb_encrypt ===

   Number of wires:                776
   Number of wire bits:           4004
   Number of public wires:          47
   Number of public wire bits:    3212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                929
     $_DFFE_PP_                    323
     $_DFF_P_                       37
     $lut                          537
     adder_carry                    32


yosys> shregmap -minlen 8 -maxlen 20

3.83. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.84. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.85. Printing statistics.

=== gost89_cfb_encrypt ===

   Number of wires:                776
   Number of wire bits:           4004
   Number of public wires:          47
   Number of public wire bits:    3212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                929
     $_DFFE_PP0P_                  323
     $_DFF_P_                       37
     $lut                          537
     adder_carry                    32


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.86. Executing TECHMAP pass (map to technology primitives).

3.86.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.86.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.86.3. Continuing TECHMAP pass.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1356 debug messages>

yosys> opt_expr -mux_undef

3.87. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
<suppressed ~15254 debug messages>

yosys> simplemap

3.88. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.89. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

yosys> opt_merge

3.90. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
<suppressed ~5118 debug messages>
Removed a total of 1706 cells.

yosys> opt_dff -nodffe -nosdff

3.91. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.92. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 3236 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.93. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.93.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
<suppressed ~624 debug messages>

yosys> opt_merge -nomux

3.93.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.93.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.93.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.93.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.93.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 75 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.93.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

3.93.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.93.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.93.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.93.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.93.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..

yosys> opt_expr

3.93.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

3.93.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_KVwW0a/abc_tmp_2.scr

3.94. Executing ABC pass (technology mapping using ABC).

3.94.1. Extracting gate netlist of module `\gost89_cfb_encrypt' to `<abc-temp-dir>/input.blif'..
Extracted 2230 gates and 3393 wires to a netlist network with 1161 inputs and 300 outputs.

3.94.1.1. Executing ABC.
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   5  Avg Lvl =   2.21  [   0.12 sec. at Pass 0]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   5  Avg Lvl =   2.21  [   1.90 sec. at Pass 1]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   5  Avg Lvl =   2.21  [   0.62 sec. at Pass 2]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   5  Avg Lvl =   2.21  [   0.56 sec. at Pass 3]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   5  Avg Lvl =   2.21  [   0.46 sec. at Pass 4]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   5  Avg Lvl =   2.21  [   0.57 sec. at Pass 5]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   5  Avg Lvl =   2.21  [   3.01 sec. at Pass 6]
DE:   #PIs = 1161  #Luts =   537  Max Lvl =   5  Avg Lvl =   2.21  [   0.15 sec. at Pass 7]

yosys> opt_expr

3.95. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.

yosys> opt_merge -nomux

3.96. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.97. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_cfb_encrypt..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.98. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_cfb_encrypt.
Performed a total of 0 changes.

yosys> opt_merge

3.99. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_cfb_encrypt'.
Removed a total of 0 cells.

yosys> opt_share

3.100. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.101. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.102. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 2871 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.103. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_cfb_encrypt.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.104. Executing HIERARCHY pass (managing design hierarchy).

3.104.1. Analyzing design hierarchy..
Top module:  \gost89_cfb_encrypt

3.104.2. Analyzing design hierarchy..
Top module:  \gost89_cfb_encrypt
Removed 0 unused modules.

yosys> stat

3.105. Printing statistics.

=== gost89_cfb_encrypt ===

   Number of wires:                776
   Number of wire bits:           4004
   Number of public wires:          47
   Number of public wire bits:    3212
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                929
     $lut                          537
     adder_carry                    32
     dffsre                        360


yosys> opt_clean -purge

3.106. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_cfb_encrypt..
Removed 0 unused cells and 25 unused wires.
<suppressed ~25 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.107. Executing Verilog backend.
Dumping module `\gost89_cfb_encrypt'.

Warnings: 1 unique messages, 1 total
End of script. Logfile hash: 9fa5bba980, CPU: user 5.51s system 0.19s, MEM: 60.33 MB peak
Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)
Time spent: 96% 6x abc (152 sec), 1% 34x opt_expr (2 sec), ...
real 30.09
user 142.75
sys 14.26
