
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.13
 Yosys 0.16+65 (git sha1 051517d61, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.

yosys> verilog_defaults -add -I.

yosys> read -sv prim_alert_pkg.sv prim_mubi_pkg.sv prim_pad_wrapper_pkg.sv prim_pkg.sv prim_secded_pkg.sv prim_subreg_pkg.sv prim_util_pkg.sv top_pkg.sv tlul_pkg.sv prim_generic_flop_2sync.sv prim_generic_flop.sv prim_generic_buf.sv

yosys> verific -sv prim_alert_pkg.sv prim_mubi_pkg.sv prim_pad_wrapper_pkg.sv prim_pkg.sv prim_secded_pkg.sv prim_subreg_pkg.sv prim_util_pkg.sv top_pkg.sv tlul_pkg.sv prim_generic_flop_2sync.sv prim_generic_flop.sv prim_generic_buf.sv

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_alert_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_alert_pkg.sv:19: parameter 'ALERT_TX_DEFAULT' declared inside package 'prim_alert_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_alert_pkg.sv:22: parameter 'ALERT_RX_DEFAULT' declared inside package 'prim_alert_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_mubi_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:19: parameter 'MuBi4Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:148: parameter 'MuBi8Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:277: parameter 'MuBi12Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:406: parameter 'MuBi16Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_pad_wrapper_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:24: parameter 'DriveStrDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:25: parameter 'SlewRateDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:39: parameter 'AttrDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:42: parameter 'PokDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_secded_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:81: parameter 'Secded2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:82: parameter 'Secded2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:90: parameter 'Secded2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:91: parameter 'Secded2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:99: parameter 'Secded3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:100: parameter 'Secded3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:108: parameter 'Secded6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:109: parameter 'Secded6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:117: parameter 'Secded7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:118: parameter 'Secded7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:126: parameter 'SecdedHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:127: parameter 'SecdedHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:135: parameter 'SecdedHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:136: parameter 'SecdedHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:144: parameter 'SecdedHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:145: parameter 'SecdedHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:153: parameter 'SecdedHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:154: parameter 'SecdedHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:162: parameter 'SecdedInv2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:163: parameter 'SecdedInv2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:171: parameter 'SecdedInv2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:172: parameter 'SecdedInv2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:180: parameter 'SecdedInv3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:181: parameter 'SecdedInv3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:189: parameter 'SecdedInv6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:190: parameter 'SecdedInv6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:198: parameter 'SecdedInv7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:199: parameter 'SecdedInv7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:207: parameter 'SecdedInvHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:208: parameter 'SecdedInvHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:216: parameter 'SecdedInvHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:217: parameter 'SecdedInvHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:225: parameter 'SecdedInvHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:226: parameter 'SecdedInvHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:234: parameter 'SecdedInvHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:235: parameter 'SecdedInvHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_subreg_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_util_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'top_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_pkg.sv'
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:14: parameter 'ArbiterImpl' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:27: parameter 'H2DCmdMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:28: parameter 'H2DCmdIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:29: parameter 'H2DCmdFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:30: parameter 'D2HRspMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:31: parameter 'D2HRspIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:32: parameter 'D2HRspFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:33: parameter 'DataMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:34: parameter 'DataIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:35: parameter 'DataFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:44: parameter 'TL_A_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:84: parameter 'TL_D_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_generic_flop_2sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_generic_flop.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_generic_buf.sv'

yosys> read -vlog2k BUFG.v BUFGCE.v BUFGMUX.v IOBUF.v

yosys> verific -vlog2k BUFG.v BUFGCE.v BUFGMUX.v IOBUF.v

3. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'BUFG.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'BUFGCE.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'BUFGMUX.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IOBUF.v'
VERIFIC-INFO [VERI-2561] IOBUF.v:62: undeclared symbol 'GTS', assumed default net type 'wire'

yosys> read -sv prim_alert_sender.sv prim_buf.sv prim_diff_decode.sv prim_flop_2sync.sv prim_intr_hw.sv prim_pulse_sync.sv prim_reg_cdc.sv prim_sec_anchor_buf.sv prim_secded_inv_39_32_dec.sv prim_secded_inv_39_32_enc.sv prim_secded_inv_64_57_dec.sv prim_secded_inv_64_57_enc.sv prim_subreg.sv prim_subreg_ext.sv prim_sync_reqack.sv prim_xilinx_buf.sv prim_xilinx_clock_buf.sv prim_xilinx_clock_gating.sv prim_xilinx_clock_mux2.sv prim_xilinx_flop.sv prim_xilinx_flop_en.sv prim_xilinx_pad_attr.sv prim_xilinx_pad_wrapper.sv prim_xilinx_xor2.sv tlul_adapter_reg.sv tlul_cmd_intg_chk.sv tlul_data_integ_dec.sv tlul_data_integ_enc.sv tlul_err.sv tlul_rsp_intg_gen.sv

yosys> verific -sv prim_alert_sender.sv prim_buf.sv prim_diff_decode.sv prim_flop_2sync.sv prim_intr_hw.sv prim_pulse_sync.sv prim_reg_cdc.sv prim_sec_anchor_buf.sv prim_secded_inv_39_32_dec.sv prim_secded_inv_39_32_enc.sv prim_secded_inv_64_57_dec.sv prim_secded_inv_64_57_enc.sv prim_subreg.sv prim_subreg_ext.sv prim_sync_reqack.sv prim_xilinx_buf.sv prim_xilinx_clock_buf.sv prim_xilinx_clock_gating.sv prim_xilinx_clock_mux2.sv prim_xilinx_flop.sv prim_xilinx_flop_en.sv prim_xilinx_pad_attr.sv prim_xilinx_pad_wrapper.sv prim_xilinx_xor2.sv tlul_adapter_reg.sv tlul_cmd_intg_chk.sv tlul_data_integ_dec.sv tlul_data_integ_enc.sv tlul_err.sv tlul_rsp_intg_gen.sv

4. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific Mar22_SW_Release, released at Fri Apr  1 00:31:54 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_alert_sender.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_buf.sv'
VERIFIC-WARNING [VERI-1199] prim_buf.sv:24: parameter 'Impl' becomes localparam in 'prim_buf' with formal parameter declaration list
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_diff_decode.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_flop_2sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_intr_hw.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_pulse_sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_reg_cdc.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_sec_anchor_buf.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_secded_inv_39_32_dec.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_secded_inv_39_32_enc.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_secded_inv_64_57_dec.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_secded_inv_64_57_enc.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_subreg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_subreg_ext.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_sync_reqack.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_buf.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_clock_buf.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_clock_gating.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_clock_mux2.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_flop.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_flop_en.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_pad_attr.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_pad_wrapper.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_xor2.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_adapter_reg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_cmd_intg_chk.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_data_integ_dec.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_data_integ_enc.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_err.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_rsp_intg_gen.sv'

yosys> synth_rs -top prim_xilinx_pad_wrapper -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

5. Executing synth_rs pass: v0.2.41

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

5.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

5.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top prim_xilinx_pad_wrapper

5.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] prim_xilinx_pad_wrapper.sv:9: compiling module 'prim_xilinx_pad_wrapper'
VERIFIC-INFO [VERI-1018] IOBUF.v:42: compiling module 'IOBUF'
VERIFIC-WARNING [VERI-1166] IOBUF.v:71: case condition never applies
VERIFIC-WARNING [VDB-1002] IOBUF.v:62: net 'GTS' does not have a driver
Importing module prim_xilinx_pad_wrapper.
Importing module IOBUF.

5.3.1. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Used module:     \IOBUF

5.3.2. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Used module:     \IOBUF
Removed 0 unused modules.

yosys> proc

5.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

5.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

5.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

5.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

5.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

5.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_mux

5.4.6. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

5.4.7. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

5.4.8. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

5.4.9. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

5.4.10. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

5.4.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module IOBUF.
<suppressed ~1 debug messages>
Optimizing module prim_xilinx_pad_wrapper.

yosys> flatten

5.5. Executing FLATTEN pass (flatten design).
Deleting now unused module IOBUF.
<suppressed ~1 debug messages>

yosys> tribuf -logic

5.6. Executing TRIBUF pass.

yosys> deminout

5.7. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

5.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_clean

5.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 2 unused cells and 11 unused wires.
<suppressed ~10 debug messages>

yosys> check

5.10. Executing CHECK pass (checking for obvious problems).
Checking module prim_xilinx_pad_wrapper...
Warning: Wire prim_xilinx_pad_wrapper.\gen_bidir.u_iobuf.GTS is used but has no driver.
Found and reported 1 problems.

yosys> opt -nodffe -nosdff

5.11. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.11.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.11.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.11.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.11.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.11.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

5.11.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.11.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.11.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.11.9. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

5.12. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

5.12.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

5.12.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

5.12.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

5.12.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> fsm_opt

5.12.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

5.12.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

5.12.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

5.12.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

5.13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.13.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.13.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.13.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -sat

5.13.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.13.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.13.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.13.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

5.14. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

5.15. Executing PEEPOPT pass (run peephole optimizers).

yosys> pmuxtree

5.16. Executing PMUXTREE pass.

yosys> opt_clean

5.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> alumacc

5.18. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module prim_xilinx_pad_wrapper:
  created 0 $alu and 0 $macc cells.

yosys> opt

5.19. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.19.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.19.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.19.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.19.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.19.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.19.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.19.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.19.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.19.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

5.20. Executing MEMORY pass.

yosys> opt_mem

5.20.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

5.20.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

5.20.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_dff

5.20.4. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

5.20.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> memory_share

5.20.6. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

5.20.7. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

5.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> memory_collect

5.20.9. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

5.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> stat

5.22. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 30
   Number of wire bits:             41
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  9
     $and                            1
     $not                            2
     $or                             2
     $tribuf                         2
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

5.23. Executing TECHMAP pass (map to technology primitives).

5.23.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.23.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

5.23.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $tribuf.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~80 debug messages>

yosys> stat

5.24. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 30
   Number of wire bits:             41
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  9
     $_AND_                          1
     $_NOT_                          2
     $_OR_                           2
     $_TBUF_                         2
     $_XOR_                          2


yosys> opt

5.25. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.25.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.25.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.25.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.25.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.25.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.25.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.25.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.25.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.25.9. Finished OPT passes. (There is nothing left to do.)

yosys> opt -fast -full

5.26. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

5.26.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
<suppressed ~4 debug messages>

yosys> opt_merge

5.26.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.26.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.26.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 4 unused cells and 3 unused wires.
<suppressed ~5 debug messages>

5.26.5. Finished fast OPT passes.

yosys> memory_map

5.27. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

5.28. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

5.28.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
<suppressed ~2 debug messages>

yosys> opt_merge -nomux

5.28.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.28.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce -full

5.28.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.28.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.28.6. Executing OPT_SHARE pass.

yosys> opt_dff

5.28.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.28.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr -full

5.28.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.28.10. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

5.29. Executing ABC pass (technology mapping using ABC).

5.29.1. Summary of detected clock domains:
  3 cells in clk={ }, en={ }, arst={ }, srst={ }

5.29.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 1 gates and 3 wires to a netlist network with 2 inputs and 1 outputs.

5.29.2.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + ifraig 
ABC: + scorr 
ABC: Warning: The network is combinational (run "fraig" or "fraig_sweep").
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + write_blif <abc-temp-dir>/output.blif 

5.29.2.2. Re-integrating ABC results.
ABC RESULTS:               XOR cells:        1
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        2
ABC RESULTS:          output signals:        1
Removing temp directory.

yosys> abc -script abc_tmp.scr

5.30. Executing ABC pass (technology mapping using ABC).

5.30.1. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
Extracted 1 gates and 3 wires to a netlist network with 2 inputs and 1 outputs.

5.30.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/yosys_verific_rs/result_10-05-2022T23-40-15/Golden_synth_rs_ade.json/prim_xilinx/abc_tmp.scr 
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.27 sec. at Pass 0]
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.48 sec. at Pass 1]
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.25 sec. at Pass 2]
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.34 sec. at Pass 3]
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.33 sec. at Pass 4]
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.46 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

5.30.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:        1
ABC RESULTS:        internal signals:        0
ABC RESULTS:           input signals:        2
ABC RESULTS:          output signals:        1
Removing temp directory.

yosys> opt

5.31. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.31.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.31.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.31.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.31.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.31.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.31.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.31.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 6 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.31.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.31.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

5.31.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.31.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.31.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.31.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.31.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.31.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.31.16. Finished OPT passes. (There is nothing left to do.)

yosys> stat

5.32. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 27
   Number of wire bits:             38
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  3
     $_TBUF_                         2
     $lut                            1


yosys> shregmap -minlen 8 -maxlen 20

5.33. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

5.34. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

5.35. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 27
   Number of wire bits:             38
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  3
     $_TBUF_                         2
     $lut                            1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

5.36. Executing TECHMAP pass (map to technology primitives).

5.36.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.36.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

5.36.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~137 debug messages>

yosys> opt_expr -mux_undef

5.37. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
<suppressed ~1 debug messages>

yosys> simplemap

5.38. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

5.39. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge

5.40. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

5.41. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.42. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

5.43. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.43.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.43.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.43.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.43.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.43.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

5.43.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.43.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.43.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.43.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script abc_tmp.scr

5.44. Executing ABC pass (technology mapping using ABC).

5.44.1. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
Extracted 2 gates and 4 wires to a netlist network with 2 inputs and 1 outputs.

5.44.1.1. Executing ABC.
Running ABC command: <yosys-exe-dir>/abc -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + source /home/users/aram/Workspace/yosys_verific_rs/result_10-05-2022T23-40-15/Golden_synth_rs_ade.json/prim_xilinx/abc_tmp.scr 
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.21 sec. at Pass 0]
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.41 sec. at Pass 1]
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.24 sec. at Pass 2]
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.36 sec. at Pass 3]
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.32 sec. at Pass 4]
ABC:   #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.37 sec. at Pass 5]
ABC: + write_blif <abc-temp-dir>/output.blif 

5.44.1.2. Re-integrating ABC results.
ABC RESULTS:              $lut cells:        1
ABC RESULTS:        internal signals:        1
ABC RESULTS:           input signals:        2
ABC RESULTS:          output signals:        1
Removing temp directory.

yosys> opt

5.45. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.45.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.45.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.45.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.45.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.45.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.45.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.45.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.45.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.45.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

5.45.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.45.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.45.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff

5.45.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.45.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.45.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

5.45.16. Finished OPT passes. (There is nothing left to do.)

yosys> hierarchy -check

5.46. Executing HIERARCHY pass (managing design hierarchy).

5.46.1. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper

5.46.2. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Removed 0 unused modules.

yosys> stat

5.47. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 27
   Number of wire bits:             38
   Number of public wires:          27
   Number of public wire bits:      38
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  3
     $_TBUF_                         2
     $lut                            1


yosys> opt_clean -purge

5.48. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 9 unused wires.
<suppressed ~9 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

5.49. Executing Verilog backend.

yosys> bmuxmap

5.49.1. Executing BMUXMAP pass.

yosys> demuxmap

5.49.2. Executing DEMUXMAP pass.

yosys> clean_zerowidth
Dumping module `\prim_xilinx_pad_wrapper'.

Warnings: 62 unique messages, 62 total
End of script. Logfile hash: 18a335c9e8, CPU: user 0.36s system 0.03s, MEM: 18.62 MB peak
Yosys 0.16+65 (git sha1 051517d61, gcc 9.1.0 -fPIC -Os)
Time spent: 96% 3x abc (10 sec), 0% 7x read_verilog (0 sec), ...
real 7.33
user 7.36
sys 3.28
