
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.49
 Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k atahost_controller.v atahost_pio_actrl.v atahost_pio_tctrl.v atahost_top.v ro_cnt.v ud_cnt.v atahost_wb_slave.v

yosys> verific -vlog2k atahost_controller.v atahost_pio_actrl.v atahost_pio_tctrl.v atahost_top.v ro_cnt.v ud_cnt.v atahost_wb_slave.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_controller.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_pio_actrl.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_pio_tctrl.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_top.v'
VERIFIC-INFO [VERI-2561] atahost_top.v:182: undeclared symbol 'PIOsel', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ro_cnt.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ud_cnt.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_wb_slave.v'

yosys> synth_rs -top atahost_top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.58

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top atahost_top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] atahost_top.v:69: compiling module 'atahost_top'
VERIFIC-INFO [VERI-1018] atahost_wb_slave.v:52: compiling module 'atahost_wb_slave(DeviceId=4'b010,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)'
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:241: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:265: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:266: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:270: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:271: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:274: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:297: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:298: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:302: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:303: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:307: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:308: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:330: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:331: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:332: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:333: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:337: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:338: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:339: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:340: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:344: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:345: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:346: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:347: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:354: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:355: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:356: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:357: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:361: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:362: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:363: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:364: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:368: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:369: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:370: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:371: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:378: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:379: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:380: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:381: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:385: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:386: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:387: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:388: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:392: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:393: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:394: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:395: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:402: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:403: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:404: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:408: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:409: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:410: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:414: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:415: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:416: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:423: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:424: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:425: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:429: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:430: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:431: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:435: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:436: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:437: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] atahost_controller.v:58: compiling module 'atahost_controller'
VERIFIC-WARNING [VERI-2371] atahost_controller.v:167: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:168: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:170: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:171: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:178: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:179: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:180: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:181: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:182: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:183: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:184: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:185: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:190: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:191: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:192: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:193: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:194: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:195: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:196: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:200: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:201: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:202: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:203: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:205: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:206: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:207: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:208: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:215: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:221: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:222: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:226: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:227: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:231: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:232: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] atahost_pio_actrl.v:51: compiling module 'atahost_pio_actrl'
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:138: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:139: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:140: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:141: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:142: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:148: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:149: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:150: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:151: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:152: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:156: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:157: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:158: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:159: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:160: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:164: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:165: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:166: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:167: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_actrl.v:168: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] atahost_pio_tctrl.v:91: compiling module 'atahost_pio_tctrl'
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:156: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:157: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:161: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:162: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:166: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:167: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:62: compiling module 'ro_cnt(ID=6)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:90: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:92: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:94: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:60: compiling module 'ud_cnt(RESD=6)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:90: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:92: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:94: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:96: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:190: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:191: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:195: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:196: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:197: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:201: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:202: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:203: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:62: compiling module 'ro_cnt(ID=28)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:90: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:92: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:94: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:60: compiling module 'ud_cnt(RESD=28)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:90: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:92: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:94: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:96: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:223: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:225: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:227: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:233: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:62: compiling module 'ro_cnt(ID=2)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:90: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:92: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:94: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:60: compiling module 'ud_cnt(RESD=2)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:90: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:92: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:94: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:96: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:62: compiling module 'ro_cnt(ID=23)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:90: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:92: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:94: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:60: compiling module 'ud_cnt(RESD=23)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:90: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:92: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:94: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:96: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:274: delay control is not supported for synthesis
Importing module atahost_top.
Importing module atahost_controller.
Importing module atahost_pio_actrl.
Importing module atahost_pio_tctrl.
Importing module atahost_wb_slave(DeviceId=4'b010,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
Importing module ro_cnt(ID=2).
Importing module ro_cnt(ID=23).
Importing module ro_cnt(ID=28).
Importing module ro_cnt(ID=6).
Importing module ud_cnt(RESD=2).
Importing module ud_cnt(RESD=23).
Importing module ud_cnt(RESD=28).
Importing module ud_cnt(RESD=6).

3.3.1. Analyzing design hierarchy..
Top module:  \atahost_top
Used module:     \atahost_controller
Used module:         \atahost_pio_actrl
Used module:             \atahost_pio_tctrl
Used module:                 \ro_cnt(ID=23)
Used module:                     \ud_cnt(RESD=23)
Used module:                 \ro_cnt(ID=2)
Used module:                     \ud_cnt(RESD=2)
Used module:                 \ro_cnt(ID=28)
Used module:                     \ud_cnt(RESD=28)
Used module:                 \ro_cnt(ID=6)
Used module:                     \ud_cnt(RESD=6)
Used module:     \atahost_wb_slave(DeviceId=4'b010,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)

3.3.2. Analyzing design hierarchy..
Top module:  \atahost_top
Used module:     \atahost_controller
Used module:         \atahost_pio_actrl
Used module:             \atahost_pio_tctrl
Used module:                 \ro_cnt(ID=23)
Used module:                     \ud_cnt(RESD=23)
Used module:                 \ro_cnt(ID=2)
Used module:                     \ud_cnt(RESD=2)
Used module:                 \ro_cnt(ID=28)
Used module:                     \ud_cnt(RESD=28)
Used module:                 \ro_cnt(ID=6)
Used module:                     \ud_cnt(RESD=6)
Used module:     \atahost_wb_slave(DeviceId=4'b010,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module ud_cnt(RESD=6).
<suppressed ~2 debug messages>
Optimizing module ud_cnt(RESD=28).
<suppressed ~2 debug messages>
Optimizing module ud_cnt(RESD=23).
<suppressed ~2 debug messages>
Optimizing module ud_cnt(RESD=2).
<suppressed ~2 debug messages>
Optimizing module ro_cnt(ID=6).
<suppressed ~1 debug messages>
Optimizing module ro_cnt(ID=28).
<suppressed ~1 debug messages>
Optimizing module ro_cnt(ID=23).
<suppressed ~1 debug messages>
Optimizing module ro_cnt(ID=2).
<suppressed ~1 debug messages>
Optimizing module atahost_wb_slave(DeviceId=4'b010,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
<suppressed ~28 debug messages>
Optimizing module atahost_pio_tctrl.
<suppressed ~10 debug messages>
Optimizing module atahost_pio_actrl.
Optimizing module atahost_controller.
<suppressed ~12 debug messages>
Optimizing module atahost_top.

yosys> bmuxmap

3.5. Executing BMUXMAP pass.

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).
Deleting now unused module atahost_controller.
Deleting now unused module atahost_pio_actrl.
Deleting now unused module atahost_pio_tctrl.
Deleting now unused module atahost_wb_slave(DeviceId=4'b010,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
Deleting now unused module ro_cnt(ID=2).
Deleting now unused module ro_cnt(ID=23).
Deleting now unused module ro_cnt(ID=28).
Deleting now unused module ro_cnt(ID=6).
Deleting now unused module ud_cnt(RESD=2).
Deleting now unused module ud_cnt(RESD=23).
Deleting now unused module ud_cnt(RESD=28).
Deleting now unused module ud_cnt(RESD=6).
<suppressed ~12 debug messages>

yosys> bmuxmap

3.8. Executing BMUXMAP pass.

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~9 debug messages>

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 19 unused cells and 1000 unused wires.
<suppressed ~147 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module atahost_top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.15. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.15.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~4 debug messages>

yosys> opt_merge -nomux

3.15.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~21 debug messages>
Removed a total of 7 cells.

yosys> opt_muxtree

3.15.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~55 debug messages>

yosys> opt_reduce

3.15.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
    New ctrl vector for $pmux cell $flatten\u0.$verific$select_313$atahost_wb_slave.v:476$1320: { $flatten\u0.$verific$n37$1024 $flatten\u0.$verific$n41$1026 $flatten\u0.$verific$n45$1028 $flatten\u0.$verific$n49$1030 $flatten\u0.$verific$n53$1032 $flatten\u0.$verific$n57$1034 $flatten\u0.$verific$n61$1036 }
  Optimizing cells in module \atahost_top.
Performed a total of 1 changes.

yosys> opt_merge

3.15.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.\t2_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:96$1587 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.\t2_cnt.$verific$rci_reg$ro_cnt.v:94$1430 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Tm_reg$atahost_wb_slave.v:438$1307 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.\t1_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:96$1616 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.\t1_cnt.$verific$rci_reg$ro_cnt.v:94$1475 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Teoc_reg$atahost_wb_slave.v:438$1309 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:96$1558 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.\eoc_cnt.$verific$rci_reg$ro_cnt.v:94$1385 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Td_reg$atahost_wb_slave.v:438$1308 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Tm_reg$atahost_wb_slave.v:417$1298 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:96$1529 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.\dhold_cnt.$verific$rci_reg$ro_cnt.v:94$1340 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Teoc_reg$atahost_wb_slave.v:417$1300 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Td_reg$atahost_wb_slave.v:417$1299 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.$verific$oe_reg$atahost_pio_tctrl.v:204$945 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.$verific$hold_go_reg$atahost_pio_tctrl.v:168$906 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.$verific$hT2done_reg$atahost_pio_tctrl.v:227$964 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.$verific$busy_reg$atahost_pio_tctrl.v:168$905 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.$verific$DIOW_reg$atahost_pio_tctrl.v:204$944 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_access_control.\PIO_timing_controller.$verific$DIOR_reg$atahost_pio_tctrl.v:204$943 ($aldff) from module atahost_top.
Removing never-active async load on $flatten\u1.\PIO_access_control.$verific$q_reg$atahost_pio_actrl.v:129$756 ($aldff) from module atahost_top.
Removing never-active async load on $flatten\u1.\PIO_access_control.$verific$Teoc_reg$atahost_pio_actrl.v:170$793 ($aldff) from module atahost_top.
Removing never-active async load on $flatten\u1.\PIO_access_control.$verific$T4_reg$atahost_pio_actrl.v:170$792 ($aldff) from module atahost_top.
Removing never-active async load on $flatten\u1.\PIO_access_control.$verific$T2_reg$atahost_pio_actrl.v:170$791 ($aldff) from module atahost_top.
Removing never-active async load on $flatten\u1.\PIO_access_control.$verific$T1_reg$atahost_pio_actrl.v:170$790 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$CtrlReg_reg$atahost_wb_slave.v:274$1219 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$dPIOreq_reg$atahost_controller.v:233$554 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$RESETn_reg$atahost_controller.v:209$531 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$PIOgo_reg$atahost_controller.v:233$555 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DIOWn_reg$atahost_controller.v:209$533 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DIORn_reg$atahost_controller.v:209$532 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DDoe_reg$atahost_controller.v:209$538 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DDo_reg$atahost_controller.v:209$537 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DA_reg$atahost_controller.v:209$534 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$CS1n_reg$atahost_controller.v:209$536 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$CS0n_reg$atahost_controller.v:209$535 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$inti_reg$atahost_wb_slave.v:309$1244 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$dirq_reg$atahost_wb_slave.v:309$1245 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_Teoc_reg$atahost_wb_slave.v:396$1290 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T4_reg$atahost_wb_slave.v:396$1289 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T2_reg$atahost_wb_slave.v:396$1288 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T1_reg$atahost_wb_slave.v:396$1287 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_Teoc_reg$atahost_wb_slave.v:372$1278 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T4_reg$atahost_wb_slave.v:372$1277 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T2_reg$atahost_wb_slave.v:372$1276 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T1_reg$atahost_wb_slave.v:372$1275 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_Teoc_reg$atahost_wb_slave.v:348$1266 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T4_reg$atahost_wb_slave.v:348$1265 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T2_reg$atahost_wb_slave.v:348$1264 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T1_reg$atahost_wb_slave.v:348$1263 ($aldff) from module atahost_top.

yosys> opt_clean

3.15.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 3 unused cells and 9 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.15.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.15.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.15.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~55 debug messages>

yosys> opt_reduce

3.15.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.15.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.15.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.15.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.15.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.16. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.16.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.16.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.16.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.16.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> fsm_opt

3.16.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.16.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.16.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.16.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat

3.17. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.17.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.17.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~55 debug messages>

yosys> opt_reduce

3.17.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.17.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.17.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\u1.\PIO_access_control.$verific$q_reg$atahost_pio_actrl.v:129$756 ($dff) from module atahost_top (D = \dd_pad_i, Q = \u1.PIO_access_control.q).
Adding EN signal on $flatten\u1.$verific$SelDev_reg$atahost_controller.v:215$544 ($dff) from module atahost_top (D = \wb_dat_i [4], Q = \u1.SelDev).
Adding EN signal on $flatten\u0.$verific$store_pp_full_reg$atahost_wb_slave.v:241$1187 ($dff) from module atahost_top (D = 1'0, Q = \u0.store_pp_full).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_Teoc_reg$atahost_wb_slave.v:396$1290 ($adff) from module atahost_top (D = $flatten\u0.$verific$n946$1139, Q = \u0.PIO_dport1_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T4_reg$atahost_wb_slave.v:396$1289 ($adff) from module atahost_top (D = $flatten\u0.$verific$n937$1138, Q = \u0.PIO_dport1_T4).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T2_reg$atahost_wb_slave.v:396$1288 ($adff) from module atahost_top (D = $flatten\u0.$verific$n928$1137, Q = \u0.PIO_dport1_T2).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T1_reg$atahost_wb_slave.v:396$1287 ($adff) from module atahost_top (D = $flatten\u0.$verific$n919$1136, Q = \u0.PIO_dport1_T1).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_Teoc_reg$atahost_wb_slave.v:372$1278 ($adff) from module atahost_top (D = $flatten\u0.$verific$n727$1131, Q = \u0.PIO_dport0_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T4_reg$atahost_wb_slave.v:372$1277 ($adff) from module atahost_top (D = $flatten\u0.$verific$n718$1130, Q = \u0.PIO_dport0_T4).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T2_reg$atahost_wb_slave.v:372$1276 ($adff) from module atahost_top (D = $flatten\u0.$verific$n709$1129, Q = \u0.PIO_dport0_T2).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T1_reg$atahost_wb_slave.v:372$1275 ($adff) from module atahost_top (D = $flatten\u0.$verific$n700$1128, Q = \u0.PIO_dport0_T1).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_Teoc_reg$atahost_wb_slave.v:348$1266 ($adff) from module atahost_top (D = $flatten\u0.$verific$n508$1123, Q = \u0.PIO_cmdport_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T4_reg$atahost_wb_slave.v:348$1265 ($adff) from module atahost_top (D = $flatten\u0.$verific$n499$1122, Q = \u0.PIO_cmdport_T4).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T2_reg$atahost_wb_slave.v:348$1264 ($adff) from module atahost_top (D = $flatten\u0.$verific$n490$1121, Q = \u0.PIO_cmdport_T2).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T1_reg$atahost_wb_slave.v:348$1263 ($adff) from module atahost_top (D = $flatten\u0.$verific$n481$1120, Q = \u0.PIO_cmdport_T1).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Tm_reg$atahost_wb_slave.v:438$1307 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1267$1150, Q = \u0.DMA_dev1_Tm).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Teoc_reg$atahost_wb_slave.v:438$1309 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1285$1152, Q = \u0.DMA_dev1_Teoc).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Td_reg$atahost_wb_slave.v:438$1308 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1276$1151, Q = \u0.DMA_dev1_Td).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Tm_reg$atahost_wb_slave.v:417$1298 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1102$1144, Q = \u0.DMA_dev0_Tm).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Teoc_reg$atahost_wb_slave.v:417$1300 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1120$1146, Q = \u0.DMA_dev0_Teoc).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Td_reg$atahost_wb_slave.v:417$1299 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1111$1145, Q = \u0.DMA_dev0_Td).
Adding EN signal on $flatten\u0.$verific$CtrlReg_reg$atahost_wb_slave.v:274$1219 ($adff) from module atahost_top (D = $flatten\u0.$verific$n199$1107, Q = \u0.CtrlReg).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$1621 ($dffe) from module atahost_top.

yosys> opt_clean

3.17.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 3 unused cells and 3 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.17.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~21 debug messages>

3.17.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.17.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~52 debug messages>

yosys> opt_reduce

3.17.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.17.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~39 debug messages>
Removed a total of 13 cells.

yosys> opt_dff -sat

3.17.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.17.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 15 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.17.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.17.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.17.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~52 debug messages>

yosys> opt_reduce

3.17.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.17.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.17.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.17.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.17.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.17.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.18. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_access_control.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1519 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_access_control.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1519 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_access_control.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1548 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_access_control.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1548 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_access_control.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1606 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_access_control.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1606 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_access_control.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1577 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_access_control.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1577 ($sub).
Removed top 3 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_40$atahost_wb_slave.v:251$1195 ($eq).
Removed top 2 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_44$atahost_wb_slave.v:252$1198 ($eq).
Removed top 2 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_48$atahost_wb_slave.v:253$1201 ($eq).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_52$atahost_wb_slave.v:254$1204 ($eq).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_56$atahost_wb_slave.v:255$1207 ($eq).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_60$atahost_wb_slave.v:256$1210 ($eq).

yosys> peepopt

3.19. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.20. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> bmuxmap

3.21. Executing BMUXMAP pass.

yosys> demuxmap

3.22. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.23. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module atahost_top:
  creating $macc model for $flatten\u1.\PIO_access_control.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1519 ($sub).
  creating $macc model for $flatten\u1.\PIO_access_control.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1548 ($sub).
  creating $macc model for $flatten\u1.\PIO_access_control.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1606 ($sub).
  creating $macc model for $flatten\u1.\PIO_access_control.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1577 ($sub).
  creating $alu model for $macc $flatten\u1.\PIO_access_control.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1577.
  creating $alu model for $macc $flatten\u1.\PIO_access_control.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1606.
  creating $alu model for $macc $flatten\u1.\PIO_access_control.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1548.
  creating $alu model for $macc $flatten\u1.\PIO_access_control.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1519.
  creating $alu cell for $flatten\u1.\PIO_access_control.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1519: $auto$alumacc.cc:485:replace_alu$1679
  creating $alu cell for $flatten\u1.\PIO_access_control.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1548: $auto$alumacc.cc:485:replace_alu$1682
  creating $alu cell for $flatten\u1.\PIO_access_control.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1606: $auto$alumacc.cc:485:replace_alu$1685
  creating $alu cell for $flatten\u1.\PIO_access_control.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:85$1577: $auto$alumacc.cc:485:replace_alu$1688
  created 4 $alu and 0 $macc cells.

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.25. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~52 debug messages>

yosys> opt_reduce

3.27. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.28. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.29. Executing OPT_SHARE pass.

yosys> opt_dff

3.30. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.32. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> stat

3.33. Printing statistics.

=== atahost_top ===

   Number of wires:                500
   Number of wire bits:           2091
   Number of public wires:         328
   Number of public wire bits:    1384
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                247
     $adff                          26
     $adffe                         19
     $alu                            4
     $and                           43
     $dff                           11
     $dffe                           2
     $eq                             6
     $logic_not                      1
     $mux                           85
     $not                           25
     $or                            15
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    6
     $reduce_or                      1


yosys> memory -nomap

3.34. Executing MEMORY pass.

yosys> opt_mem

3.34.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.34.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.34.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.34.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.34.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.34.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> memory_share

3.34.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.34.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.34.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> memory_collect

3.34.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.35. Printing statistics.

=== atahost_top ===

   Number of wires:                500
   Number of wire bits:           2091
   Number of public wires:         328
   Number of public wire bits:    1384
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                247
     $adff                          26
     $adffe                         19
     $alu                            4
     $and                           43
     $dff                           11
     $dffe                           2
     $eq                             6
     $logic_not                      1
     $mux                           85
     $not                           25
     $or                            15
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    6
     $reduce_or                      1


yosys> muxpack

3.36. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~72 debug messages>

yosys> opt_clean

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> pmuxtree

3.38. Executing PMUXTREE pass.

yosys> muxpack

3.39. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~78 debug messages>

yosys> memory_map

3.40. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.41. Printing statistics.

=== atahost_top ===

   Number of wires:                512
   Number of wire bits:           2320
   Number of public wires:         328
   Number of public wire bits:    1384
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                258
     $adff                          26
     $adffe                         19
     $alu                            4
     $and                           43
     $dff                           11
     $dffe                           2
     $eq                             6
     $logic_not                      1
     $mux                           92
     $not                           26
     $or                            17
     $reduce_and                     2
     $reduce_bool                    6
     $reduce_or                      3


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.42. Executing TECHMAP pass (map to technology primitives).

3.42.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.42.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.42.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using template $paramod$19189243523493d505a4933d1bad417c570ea8a6\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $reduce_and.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $pos.
No more expansions possible.
<suppressed ~698 debug messages>

yosys> stat

3.43. Printing statistics.

=== atahost_top ===

   Number of wires:                738
   Number of wire bits:           7492
   Number of public wires:         328
   Number of public wire bits:    1384
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1577
     $_AND_                        151
     $_DFFE_PN0P_                  145
     $_DFFE_PN1P_                   31
     $_DFFE_PP_                     17
     $_DFF_PN0_                     57
     $_DFF_PN1_                     14
     $_DFF_P_                       39
     $_MUX_                        847
     $_NOT_                         69
     $_OR_                         107
     $_XOR_                        100


yosys> opt_expr

3.44. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~328 debug messages>

yosys> opt_merge -nomux

3.45. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~66 debug messages>
Removed a total of 22 cells.

yosys> opt_muxtree

3.46. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.47. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.48. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.49. Executing OPT_SHARE pass.

yosys> opt_dff

3.50. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 4 unused cells and 181 unused wires.
<suppressed ~9 debug messages>

yosys> opt_expr

3.52. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_muxtree

3.53. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.55. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.56. Executing OPT_SHARE pass.

yosys> opt_dff

3.57. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.59. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 2

yosys> opt -fast -full

3.60. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.60.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~223 debug messages>

yosys> opt_merge

3.60.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~447 debug messages>
Removed a total of 149 cells.

yosys> opt_dff

3.60.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.60.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 31 unused wires.
<suppressed ~1 debug messages>

3.60.5. Finished fast OPT passes.

yosys> techmap -map +/techmap.v

3.61. Executing TECHMAP pass (map to technology primitives).

3.61.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.61.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -sat

3.62. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.62.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.62.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.62.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.62.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.62.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.62.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.62.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.62.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.62.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.63. Executing ABC pass (technology mapping using ABC).

3.63.1. Summary of detected clock domains:
  136 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1623, arst=!\arst_i, srst={ }
  69 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1635, arst=!\arst_i, srst={ }
  102 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1647, arst=!\arst_i, srst={ }
  61 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1659, arst=!\arst_i, srst={ }
  30 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1668, arst=!\arst_i, srst={ }
  99 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1677, arst=!\arst_i, srst={ }
  316 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  128 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  4 cells in clk=\wb_clk_i, en=$flatten\u1.$verific$n162$468, arst={ }, srst={ }
  134 cells in clk=\wb_clk_i, en=\u1.PIO_access_control.PIO_timing_controller.dstrb, arst={ }, srst={ }

3.63.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1623, asynchronously reset by !\arst_i
Extracted 136 gates and 241 wires to a netlist network with 104 inputs and 101 outputs.

3.63.2.1. Executing ABC.

3.63.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1635, asynchronously reset by !\arst_i
Extracted 69 gates and 139 wires to a netlist network with 70 inputs and 66 outputs.

3.63.3.1. Executing ABC.

3.63.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1647, asynchronously reset by !\arst_i
Extracted 102 gates and 174 wires to a netlist network with 71 inputs and 101 outputs.

3.63.4.1. Executing ABC.

3.63.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1659, asynchronously reset by !\arst_i
Extracted 61 gates and 114 wires to a netlist network with 52 inputs and 35 outputs.

3.63.5.1. Executing ABC.

3.63.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1668, asynchronously reset by !\arst_i
Extracted 30 gates and 59 wires to a netlist network with 29 inputs and 28 outputs.

3.63.6.1. Executing ABC.

3.63.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1677, asynchronously reset by !\arst_i
Extracted 99 gates and 160 wires to a netlist network with 60 inputs and 58 outputs.

3.63.7.1. Executing ABC.

3.63.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 316 gates and 385 wires to a netlist network with 68 inputs and 96 outputs.

3.63.8.1. Executing ABC.

3.63.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 128 gates and 240 wires to a netlist network with 112 inputs and 46 outputs.

3.63.9.1. Executing ABC.

3.63.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $flatten\u1.$verific$n162$468
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 3 outputs.

3.63.10.1. Executing ABC.

3.63.11. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4704$lo32
Extracted 134 gates and 279 wires to a netlist network with 144 inputs and 33 outputs.

3.63.11.1. Executing ABC.

yosys> abc -dff

3.64. Executing ABC pass (technology mapping using ABC).

3.64.1. Summary of detected clock domains:
  83 cells in clk=\wb_clk_i, en=$abc$4294$auto$opt_dff.cc:194:make_patterns_logic$1677, arst=!\arst_i, srst={ }
  50 cells in clk=\wb_clk_i, en=$abc$4216$auto$opt_dff.cc:194:make_patterns_logic$1668, arst=!\arst_i, srst={ }
  131 cells in clk=\wb_clk_i, en=$abc$3964$auto$opt_dff.cc:194:make_patterns_logic$1647, arst=!\arst_i, srst={ }
  46 cells in clk=\wb_clk_i, en=$abc$4131$auto$opt_dff.cc:194:make_patterns_logic$1659, arst=!\arst_i, srst={ }
  246 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  184 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$4868$flatten\u1.$verific$n162$468, arst={ }, srst={ }
  104 cells in clk=\wb_clk_i, en=$abc$3654$auto$opt_dff.cc:194:make_patterns_logic$1623, arst=!\arst_i, srst={ }
  92 cells in clk=\wb_clk_i, en=$abc$3831$auto$opt_dff.cc:194:make_patterns_logic$1635, arst=!\arst_i, srst={ }
  202 cells in clk=\wb_clk_i, en=$abc$4704$lo32, arst={ }, srst={ }

3.64.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4294$auto$opt_dff.cc:194:make_patterns_logic$1677, asynchronously reset by !\arst_i
Extracted 83 gates and 124 wires to a netlist network with 41 inputs and 47 outputs.

3.64.2.1. Executing ABC.

3.64.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4216$auto$opt_dff.cc:194:make_patterns_logic$1668, asynchronously reset by !\arst_i
Extracted 50 gates and 93 wires to a netlist network with 43 inputs and 35 outputs.

3.64.3.1. Executing ABC.

3.64.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3964$auto$opt_dff.cc:194:make_patterns_logic$1647, asynchronously reset by !\arst_i
Extracted 131 gates and 209 wires to a netlist network with 78 inputs and 94 outputs.

3.64.4.1. Executing ABC.

3.64.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4131$auto$opt_dff.cc:194:make_patterns_logic$1659, asynchronously reset by !\arst_i
Extracted 46 gates and 83 wires to a netlist network with 37 inputs and 26 outputs.

3.64.5.1. Executing ABC.

3.64.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 246 gates and 311 wires to a netlist network with 65 inputs and 87 outputs.

3.64.6.1. Executing ABC.

3.64.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 184 gates and 346 wires to a netlist network with 162 inputs and 75 outputs.

3.64.7.1. Executing ABC.

3.64.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4868$flatten\u1.$verific$n162$468
Extracted 7 gates and 13 wires to a netlist network with 6 inputs and 5 outputs.

3.64.8.1. Executing ABC.

3.64.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3654$auto$opt_dff.cc:194:make_patterns_logic$1623, asynchronously reset by !\arst_i
Extracted 104 gates and 168 wires to a netlist network with 64 inputs and 66 outputs.

3.64.9.1. Executing ABC.

3.64.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3831$auto$opt_dff.cc:194:make_patterns_logic$1635, asynchronously reset by !\arst_i
Extracted 92 gates and 154 wires to a netlist network with 62 inputs and 62 outputs.

3.64.10.1. Executing ABC.

3.64.11. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5797$lo13
Extracted 202 gates and 370 wires to a netlist network with 168 inputs and 51 outputs.

3.64.11.1. Executing ABC.

yosys> abc -dff

3.65. Executing ABC pass (technology mapping using ABC).

3.65.1. Summary of detected clock domains:
  95 cells in clk=\wb_clk_i, en=$abc$5093$abc$4294$auto$opt_dff.cc:194:make_patterns_logic$1677, arst=!\arst_i, srst={ }
  67 cells in clk=\wb_clk_i, en=$abc$5208$abc$4216$auto$opt_dff.cc:194:make_patterns_logic$1668, arst=!\arst_i, srst={ }
  145 cells in clk=\wb_clk_i, en=$abc$5293$abc$3964$auto$opt_dff.cc:194:make_patterns_logic$1647, arst=!\arst_i, srst={ }
  38 cells in clk=\wb_clk_i, en=$abc$5453$abc$4131$auto$opt_dff.cc:194:make_patterns_logic$1659, arst=!\arst_i, srst={ }
  173 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$5998$abc$4868$flatten\u1.$verific$n162$468, arst={ }, srst={ }
  128 cells in clk=\wb_clk_i, en=$abc$6007$abc$3654$auto$opt_dff.cc:194:make_patterns_logic$1623, arst=!\arst_i, srst={ }
  233 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  75 cells in clk=\wb_clk_i, en=$abc$6139$abc$3831$auto$opt_dff.cc:194:make_patterns_logic$1635, arst=!\arst_i, srst={ }
  214 cells in clk=\wb_clk_i, en=$abc$5797$lo13, arst={ }, srst={ }

3.65.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5093$abc$4294$auto$opt_dff.cc:194:make_patterns_logic$1677, asynchronously reset by !\arst_i
Extracted 95 gates and 135 wires to a netlist network with 40 inputs and 53 outputs.

3.65.2.1. Executing ABC.

3.65.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5208$abc$4216$auto$opt_dff.cc:194:make_patterns_logic$1668, asynchronously reset by !\arst_i
Extracted 67 gates and 118 wires to a netlist network with 51 inputs and 32 outputs.

3.65.3.1. Executing ABC.

3.65.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5293$abc$3964$auto$opt_dff.cc:194:make_patterns_logic$1647, asynchronously reset by !\arst_i
Extracted 145 gates and 227 wires to a netlist network with 82 inputs and 87 outputs.

3.65.4.1. Executing ABC.

3.65.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5453$abc$4131$auto$opt_dff.cc:194:make_patterns_logic$1659, asynchronously reset by !\arst_i
Extracted 38 gates and 67 wires to a netlist network with 29 inputs and 25 outputs.

3.65.5.1. Executing ABC.

3.65.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 173 gates and 337 wires to a netlist network with 164 inputs and 74 outputs.

3.65.6.1. Executing ABC.

3.65.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5998$abc$4868$flatten\u1.$verific$n162$468
Extracted 5 gates and 10 wires to a netlist network with 5 inputs and 4 outputs.

3.65.7.1. Executing ABC.

3.65.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6007$abc$3654$auto$opt_dff.cc:194:make_patterns_logic$1623, asynchronously reset by !\arst_i
Extracted 128 gates and 210 wires to a netlist network with 82 inputs and 56 outputs.

3.65.8.1. Executing ABC.

3.65.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 233 gates and 299 wires to a netlist network with 66 inputs and 90 outputs.

3.65.9.1. Executing ABC.

3.65.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6139$abc$3831$auto$opt_dff.cc:194:make_patterns_logic$1635, asynchronously reset by !\arst_i
Extracted 75 gates and 124 wires to a netlist network with 49 inputs and 55 outputs.

3.65.10.1. Executing ABC.

3.65.11. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6946$lo06
Extracted 214 gates and 375 wires to a netlist network with 161 inputs and 53 outputs.

3.65.11.1. Executing ABC.

yosys> abc -dff

3.66. Executing ABC pass (technology mapping using ABC).

3.66.1. Summary of detected clock domains:
  98 cells in clk=\wb_clk_i, en=$abc$6515$abc$5093$abc$4294$auto$opt_dff.cc:194:make_patterns_logic$1677, arst=!\arst_i, srst={ }
  74 cells in clk=\wb_clk_i, en=$abc$6636$abc$5208$abc$4216$auto$opt_dff.cc:194:make_patterns_logic$1668, arst=!\arst_i, srst={ }
  116 cells in clk=\wb_clk_i, en=$abc$6718$abc$5293$abc$3964$auto$opt_dff.cc:194:make_patterns_logic$1647, arst=!\arst_i, srst={ }
  36 cells in clk=\wb_clk_i, en=$abc$6871$abc$5453$abc$4131$auto$opt_dff.cc:194:make_patterns_logic$1659, arst=!\arst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$7146$abc$5998$abc$4868$flatten\u1.$verific$n162$468, arst={ }, srst={ }
  128 cells in clk=\wb_clk_i, en=$abc$7154$abc$6007$abc$3654$auto$opt_dff.cc:194:make_patterns_logic$1623, arst=!\arst_i, srst={ }
  201 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  240 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  136 cells in clk=\wb_clk_i, en=$abc$7575$abc$6139$abc$3831$auto$opt_dff.cc:194:make_patterns_logic$1635, arst=!\arst_i, srst={ }
  195 cells in clk=\wb_clk_i, en=$abc$6946$lo06, arst={ }, srst={ }

3.66.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6515$abc$5093$abc$4294$auto$opt_dff.cc:194:make_patterns_logic$1677, asynchronously reset by !\arst_i
Extracted 98 gates and 136 wires to a netlist network with 38 inputs and 40 outputs.

3.66.2.1. Executing ABC.

3.66.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6636$abc$5208$abc$4216$auto$opt_dff.cc:194:make_patterns_logic$1668, asynchronously reset by !\arst_i
Extracted 74 gates and 128 wires to a netlist network with 54 inputs and 28 outputs.

3.66.3.1. Executing ABC.

3.66.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6718$abc$5293$abc$3964$auto$opt_dff.cc:194:make_patterns_logic$1647, asynchronously reset by !\arst_i
Extracted 116 gates and 174 wires to a netlist network with 58 inputs and 77 outputs.

3.66.4.1. Executing ABC.

3.66.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6871$abc$5453$abc$4131$auto$opt_dff.cc:194:make_patterns_logic$1659, asynchronously reset by !\arst_i
Extracted 36 gates and 63 wires to a netlist network with 27 inputs and 25 outputs.

3.66.5.1. Executing ABC.

3.66.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$7146$abc$5998$abc$4868$flatten\u1.$verific$n162$468
Extracted 6 gates and 12 wires to a netlist network with 6 inputs and 5 outputs.

3.66.6.1. Executing ABC.

3.66.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$7154$abc$6007$abc$3654$auto$opt_dff.cc:194:make_patterns_logic$1623, asynchronously reset by !\arst_i
Extracted 128 gates and 199 wires to a netlist network with 71 inputs and 56 outputs.

3.66.7.1. Executing ABC.

3.66.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 201 gates and 389 wires to a netlist network with 188 inputs and 73 outputs.

3.66.8.1. Executing ABC.

3.66.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 240 gates and 306 wires to a netlist network with 66 inputs and 92 outputs.

3.66.9.1. Executing ABC.

3.66.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$7575$abc$6139$abc$3831$auto$opt_dff.cc:194:make_patterns_logic$1635, asynchronously reset by !\arst_i
Extracted 136 gates and 227 wires to a netlist network with 91 inputs and 68 outputs.

3.66.10.1. Executing ABC.

3.66.11. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8518$lo02
Extracted 195 gates and 348 wires to a netlist network with 153 inputs and 68 outputs.

3.66.11.1. Executing ABC.

yosys> opt_ffinv

3.67. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat

3.68. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.68.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~33 debug messages>

yosys> opt_merge -nomux

3.68.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~378 debug messages>
Removed a total of 126 cells.

yosys> opt_muxtree

3.68.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.68.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.68.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.68.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 1 unused cells and 7964 unused wires.
<suppressed ~105 debug messages>

yosys> opt_expr

3.68.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.68.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.68.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.68.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat

3.68.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.68.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.68.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.68.16. Finished OPT passes. (There is nothing left to do.)

yosys> bmuxmap

3.69. Executing BMUXMAP pass.

yosys> demuxmap

3.70. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /home/users/temp_dir/yosys_ap9Tek/abc_tmp_1.scr

3.71. Executing ABC pass (technology mapping using ABC).

3.71.1. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Extracted 842 gates and 1165 wires to a netlist network with 323 inputs and 177 outputs.

3.71.1.1. Executing ABC.
DE:   #PIs = 323  #Luts =   290  Max Lvl =   6  Avg Lvl =   2.56  [   0.28 sec. at Pass 0]
DE:   #PIs = 323  #Luts =   274  Max Lvl =   6  Avg Lvl =   2.89  [   3.34 sec. at Pass 1]
DE:   #PIs = 323  #Luts =   268  Max Lvl =   6  Avg Lvl =   2.77  [   0.56 sec. at Pass 2]
DE:   #PIs = 323  #Luts =   266  Max Lvl =   5  Avg Lvl =   2.63  [   1.27 sec. at Pass 3]
DE:   #PIs = 323  #Luts =   265  Max Lvl =   5  Avg Lvl =   2.58  [   1.01 sec. at Pass 4]
DE:   #PIs = 323  #Luts =   263  Max Lvl =   5  Avg Lvl =   2.63  [   1.45 sec. at Pass 5]
DE:   #PIs = 323  #Luts =   261  Max Lvl =   5  Avg Lvl =   2.62  [   1.23 sec. at Pass 6]
DE:   #PIs = 323  #Luts =   260  Max Lvl =   6  Avg Lvl =   2.59  [   1.31 sec. at Pass 7]
DE:   #PIs = 323  #Luts =   259  Max Lvl =   6  Avg Lvl =   2.71  [   1.13 sec. at Pass 8]
DE:   #PIs = 323  #Luts =   259  Max Lvl =   5  Avg Lvl =   2.63  [   1.16 sec. at Pass 9]
DE:   #PIs = 323  #Luts =   258  Max Lvl =   5  Avg Lvl =   2.63  [   1.22 sec. at Pass 10]
DE:   #PIs = 323  #Luts =   258  Max Lvl =   5  Avg Lvl =   2.63  [   1.10 sec. at Pass 11]
DE:   #PIs = 323  #Luts =   257  Max Lvl =   6  Avg Lvl =   2.62  [   1.08 sec. at Pass 12]
DE:   #PIs = 323  #Luts =   257  Max Lvl =   6  Avg Lvl =   2.62  [   1.65 sec. at Pass 13]
DE:   #PIs = 323  #Luts =   257  Max Lvl =   5  Avg Lvl =   2.59  [   1.23 sec. at Pass 14]
DE:   #PIs = 323  #Luts =   257  Max Lvl =   5  Avg Lvl =   2.59  [   1.77 sec. at Pass 15]
DE:   #PIs = 323  #Luts =   257  Max Lvl =   5  Avg Lvl =   2.59  [   1.05 sec. at Pass 16]
DE:   #PIs = 323  #Luts =   257  Max Lvl =   5  Avg Lvl =   2.59  [   1.35 sec. at Pass 17]
DE:   #PIs = 323  #Luts =   257  Max Lvl =   5  Avg Lvl =   2.59  [   2.66 sec. at Pass 18]
DE:   #PIs = 323  #Luts =   257  Max Lvl =   5  Avg Lvl =   2.59  [   0.50 sec. at Pass 19]

yosys> opt_expr

3.72. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.74. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.75. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.77. Executing OPT_SHARE pass.

yosys> opt_dff

3.78. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.79. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 1104 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.80. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.81. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 4 inverters.

yosys> stat

3.82. Printing statistics.

=== atahost_top ===

   Number of wires:                703
   Number of wire bits:           1466
   Number of public wires:         217
   Number of public wire bits:     980
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                554
     $_DFFE_PN0P_                  176
     $_DFFE_PP_                     17
     $_DFF_PN0_                     66
     $_DFF_PN1_                      4
     $_DFF_P_                       38
     $lut                          253


yosys> shregmap -minlen 8 -maxlen 20

3.83. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.84. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.85. Printing statistics.

=== atahost_top ===

   Number of wires:                703
   Number of wire bits:           1466
   Number of public wires:         217
   Number of public wire bits:     980
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                554
     $_DFFE_PN0P_                  176
     $_DFFE_PP0P_                   17
     $_DFF_PN0_                     66
     $_DFF_PN1_                      4
     $_DFF_P_                       38
     $lut                          253


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.86. Executing TECHMAP pass (map to technology primitives).

3.86.1. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.86.2. Executing Verilog-2005 frontend: /home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/aram/Workspace/clean_repo/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.86.3. Continuing TECHMAP pass.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFF_PN1_ for cells of type $_DFF_PN1_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~707 debug messages>

yosys> opt_expr -mux_undef

3.87. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~6119 debug messages>

yosys> simplemap

3.88. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.89. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge

3.90. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~1794 debug messages>
Removed a total of 598 cells.

yosys> opt_dff -nodffe -nosdff

3.91. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.92. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 1864 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.93. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.93.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~244 debug messages>

yosys> opt_merge -nomux

3.93.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.93.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.93.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.93.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.93.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 67 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.93.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.93.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.93.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.93.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.93.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.93.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.93.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.93.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_ap9Tek/abc_tmp_2.scr

3.94. Executing ABC pass (technology mapping using ABC).

3.94.1. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Extracted 963 gates and 1284 wires to a netlist network with 319 inputs and 173 outputs.

3.94.1.1. Executing ABC.
DE:   #PIs = 319  #Luts =   254  Max Lvl =   5  Avg Lvl =   2.66  [   0.35 sec. at Pass 0]
DE:   #PIs = 319  #Luts =   253  Max Lvl =   5  Avg Lvl =   2.62  [   2.17 sec. at Pass 1]
DE:   #PIs = 319  #Luts =   253  Max Lvl =   5  Avg Lvl =   2.62  [   0.55 sec. at Pass 2]
DE:   #PIs = 319  #Luts =   253  Max Lvl =   5  Avg Lvl =   2.62  [   1.13 sec. at Pass 3]
DE:   #PIs = 319  #Luts =   253  Max Lvl =   5  Avg Lvl =   2.62  [   0.99 sec. at Pass 4]
DE:   #PIs = 319  #Luts =   253  Max Lvl =   5  Avg Lvl =   2.62  [   1.56 sec. at Pass 5]
DE:   #PIs = 319  #Luts =   252  Max Lvl =   5  Avg Lvl =   2.65  [   1.93 sec. at Pass 6]
DE:   #PIs = 319  #Luts =   252  Max Lvl =   5  Avg Lvl =   2.65  [   1.08 sec. at Pass 7]
DE:   #PIs = 319  #Luts =   252  Max Lvl =   5  Avg Lvl =   2.65  [   1.52 sec. at Pass 8]
DE:   #PIs = 319  #Luts =   252  Max Lvl =   5  Avg Lvl =   2.65  [   0.87 sec. at Pass 9]
DE:   #PIs = 319  #Luts =   251  Max Lvl =   5  Avg Lvl =   2.72  [   1.71 sec. at Pass 10]
DE:   #PIs = 319  #Luts =   251  Max Lvl =   5  Avg Lvl =   2.72  [   1.04 sec. at Pass 11]
DE:   #PIs = 319  #Luts =   251  Max Lvl =   5  Avg Lvl =   2.72  [   0.93 sec. at Pass 12]
DE:   #PIs = 319  #Luts =   251  Max Lvl =   5  Avg Lvl =   2.72  [   1.48 sec. at Pass 13]
DE:   #PIs = 319  #Luts =   251  Max Lvl =   5  Avg Lvl =   2.72  [   2.71 sec. at Pass 14]
DE:   #PIs = 319  #Luts =   251  Max Lvl =   5  Avg Lvl =   2.72  [   0.47 sec. at Pass 15]

yosys> opt_expr

3.95. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.96. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.97. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.98. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.99. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.100. Executing OPT_SHARE pass.

yosys> opt_dff

3.101. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.102. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 1136 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.103. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.104. Executing HIERARCHY pass (managing design hierarchy).

3.104.1. Analyzing design hierarchy..
Top module:  \atahost_top

3.104.2. Analyzing design hierarchy..
Top module:  \atahost_top
Removed 0 unused modules.

yosys> stat

3.105. Printing statistics.

=== atahost_top ===

   Number of wires:                697
   Number of wire bits:           1460
   Number of public wires:         217
   Number of public wire bits:     980
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                552
     $lut                          251
     dffsre                        301


yosys> opt_clean -purge

3.106. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 185 unused wires.
<suppressed ~185 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.107. Executing Verilog backend.
Dumping module `\atahost_top'.

Warnings: 148 unique messages, 169 total
End of script. Logfile hash: 1ab77107b3, CPU: user 7.02s system 0.21s, MEM: 38.47 MB peak
Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)
Time spent: 96% 6x abc (198 sec), 0% 31x opt_expr (1 sec), ...
real 90.89
user 177.13
sys 27.19
