
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.70
 Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k defines.vh cavlc_read_total_coeffs.v cavlc_read_levels.v cavlc_read_total_zeros.v cavlc_read_run_befores.v cavlc_len_gen.v cavlc.v cavlc_fsm.v

yosys> verific -vlog2k defines.vh cavlc_read_total_coeffs.v cavlc_read_levels.v cavlc_read_total_zeros.v cavlc_read_run_befores.v cavlc_len_gen.v cavlc.v cavlc_fsm.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'defines.vh'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cavlc_read_total_coeffs.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cavlc_read_levels.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cavlc_read_total_zeros.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cavlc_read_run_befores.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cavlc_len_gen.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cavlc.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'cavlc_fsm.v'

yosys> synth_rs -top cavlc -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.69

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top cavlc

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] cavlc.v:41: compiling module 'cavlc'
VERIFIC-INFO [VERI-1018] cavlc_read_total_coeffs.v:43: compiling module 'cavlc_read_total_coeffs'
VERIFIC-INFO [VERI-1018] cavlc_read_levels.v:44: compiling module 'cavlc_read_levels'
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:155: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:212: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:226: expression size 10 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:229: expression size 31 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:259: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:261: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:263: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:266: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:268: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:270: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:273: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:275: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:277: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:280: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:282: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:284: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:287: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:289: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:291: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:294: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:296: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:298: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:301: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:303: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:305: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:308: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:310: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:312: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:315: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:317: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:319: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:322: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:324: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:326: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:329: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:331: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:333: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:336: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:338: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:340: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:343: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:345: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:347: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:350: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:352: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:354: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:357: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:359: expression size 32 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_levels.v:361: expression size 32 truncated to fit in target size 9
VERIFIC-INFO [VERI-1018] cavlc_read_total_zeros.v:41: compiling module 'cavlc_read_total_zeros'
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:92: expression size 16 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:93: expression size 16 truncated to fit in target size 6
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:96: expression size 16 truncated to fit in target size 3
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:98: expression size 16 truncated to fit in target size 6
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:101: expression size 16 truncated to fit in target size 3
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:102: expression size 16 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:106: expression size 16 truncated to fit in target size 3
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:107: expression size 16 truncated to fit in target size 9
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:108: expression size 16 truncated to fit in target size 6
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:320: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:321: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:688: expression size 32 truncated to fit in target size 3
VERIFIC-WARNING [VERI-1209] cavlc_read_total_zeros.v:689: expression size 32 truncated to fit in target size 4
VERIFIC-INFO [VERI-1018] cavlc_read_run_befores.v:41: compiling module 'cavlc_read_run_befores'
VERIFIC-WARNING [VERI-1209] cavlc_read_run_befores.v:196: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1209] cavlc_read_run_befores.v:201: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1209] cavlc_read_run_befores.v:242: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1209] cavlc_read_run_befores.v:255: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1209] cavlc_read_run_befores.v:255: expression size 32 truncated to fit in target size 4
VERIFIC-INFO [VERI-1018] cavlc_len_gen.v:41: compiling module 'cavlc_len_gen'
VERIFIC-WARNING [VERI-1174] cavlc_len_gen.v:70: synthesis - simulation differences may occur when using parallel_case directive
VERIFIC-WARNING [VERI-1209] cavlc_len_gen.v:79: expression size 32 truncated to fit in target size 5
VERIFIC-INFO [VERI-1018] cavlc_fsm.v:40: compiling module 'cavlc_fsm'
VERIFIC-WARNING [VERI-1209] cavlc_fsm.v:105: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1209] cavlc_fsm.v:134: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1209] cavlc_fsm.v:138: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1209] cavlc_fsm.v:143: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1209] cavlc_fsm.v:152: expression size 32 truncated to fit in target size 4
VERIFIC-WARNING [VERI-1173] cavlc_fsm.v:94: synthesis - simulation differences may occur when using full_case directive
Importing module cavlc.
Importing module cavlc_fsm.
Importing module cavlc_len_gen.
Importing module cavlc_read_levels.
Importing module cavlc_read_run_befores.
Importing module cavlc_read_total_coeffs.
Importing module cavlc_read_total_zeros.

3.4.1. Analyzing design hierarchy..
Top module:  \cavlc
Used module:     \cavlc_fsm
Used module:     \cavlc_len_gen
Used module:     \cavlc_read_run_befores
Used module:     \cavlc_read_total_zeros
Used module:     \cavlc_read_levels
Used module:     \cavlc_read_total_coeffs

3.4.2. Analyzing design hierarchy..
Top module:  \cavlc
Used module:     \cavlc_fsm
Used module:     \cavlc_len_gen
Used module:     \cavlc_read_run_befores
Used module:     \cavlc_read_total_zeros
Used module:     \cavlc_read_levels
Used module:     \cavlc_read_total_coeffs
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc_read_total_zeros.
<suppressed ~63 debug messages>
Optimizing module cavlc_read_total_coeffs.
<suppressed ~127 debug messages>
Optimizing module cavlc_read_run_befores.
<suppressed ~31 debug messages>
Optimizing module cavlc_read_levels.
<suppressed ~43 debug messages>
Optimizing module cavlc_len_gen.
Optimizing module cavlc_fsm.
<suppressed ~15 debug messages>
Optimizing module cavlc.

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module cavlc_fsm.
Deleting now unused module cavlc_len_gen.
Deleting now unused module cavlc_read_levels.
Deleting now unused module cavlc_read_run_befores.
Deleting now unused module cavlc_read_total_coeffs.
Deleting now unused module cavlc_read_total_zeros.
<suppressed ~6 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
<suppressed ~344 debug messages>

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 4 unused cells and 1355 unused wires.
<suppressed ~87 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module cavlc...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
      Replacing known input bits on port A of cell $flatten\cavlc_read_levels.$verific$mux_134$cavlc_read_levels.v:244$1088: \cavlc_read_levels.level -> { 1'0 \cavlc_read_levels.level [7:0] }
  Analyzing evaluation results.
    dead port 2/2 on $mux $flatten\cavlc_read_total_zeros.$verific$mux_590$cavlc_read_total_zeros.v:712$3693.
Removed 1 multiplexer ports.
<suppressed ~75 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
    New ctrl vector for $pmux cell $flatten\cavlc_fsm.$verific$select_77$cavlc_fsm.v:155$730: { $flatten\cavlc_fsm.$verific$n328$618 $flatten\cavlc_fsm.$verific$n329$619 $auto$opt_reduce.cc:134:opt_pmux$4551 $flatten\cavlc_fsm.$verific$n332$622 $flatten\cavlc_fsm.$verific$n333$623 $flatten\cavlc_fsm.$verific$n334$624 }
    New ctrl vector for $pmux cell $flatten\cavlc_len_gen.$verific$select_18$cavlc_len_gen.v:80$753: { \cavlc_fsm.state [1] $auto$opt_reduce.cc:134:opt_pmux$4553 \cavlc_fsm.state [6] \cavlc_fsm.state [7] $flatten\cavlc_len_gen.$verific$n48$741 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_121$cavlc_read_run_befores.v:259$1568: { $flatten\cavlc_read_run_befores.$verific$n400$1260 $flatten\cavlc_read_run_befores.$verific$n401$1261 $flatten\cavlc_read_run_befores.$verific$n402$1262 $flatten\cavlc_read_run_befores.$verific$n403$1263 $flatten\cavlc_read_run_befores.$verific$n404$1264 $flatten\cavlc_read_run_befores.$verific$n405$1265 $flatten\cavlc_read_run_befores.$verific$n406$1266 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_122$cavlc_read_run_befores.v:259$1569: { $flatten\cavlc_read_run_befores.$verific$n400$1260 $flatten\cavlc_read_run_befores.$verific$n401$1261 $flatten\cavlc_read_run_befores.$verific$n402$1262 $flatten\cavlc_read_run_befores.$verific$n403$1263 $flatten\cavlc_read_run_befores.$verific$n404$1264 $flatten\cavlc_read_run_befores.$verific$n405$1265 $flatten\cavlc_read_run_befores.$verific$n406$1266 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_236$cavlc_read_run_befores.v:348$1610: { $flatten\cavlc_read_run_befores.$verific$n1178$1274 $auto$opt_reduce.cc:134:opt_pmux$4555 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_237$cavlc_read_run_befores.v:348$1611: { $flatten\cavlc_read_run_befores.$verific$n1179$1275 $auto$opt_reduce.cc:134:opt_pmux$4557 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_238$cavlc_read_run_befores.v:348$1612: { $flatten\cavlc_read_run_befores.$verific$n1180$1276 $auto$opt_reduce.cc:134:opt_pmux$4559 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_239$cavlc_read_run_befores.v:348$1613: { $flatten\cavlc_read_run_befores.$verific$n1181$1277 $auto$opt_reduce.cc:134:opt_pmux$4561 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_240$cavlc_read_run_befores.v:348$1614: { $flatten\cavlc_read_run_befores.$verific$n1182$1278 $auto$opt_reduce.cc:134:opt_pmux$4563 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_241$cavlc_read_run_befores.v:348$1615: { $flatten\cavlc_read_run_befores.$verific$n1183$1279 $auto$opt_reduce.cc:134:opt_pmux$4565 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_242$cavlc_read_run_befores.v:348$1616: { $flatten\cavlc_read_run_befores.$verific$n1184$1280 $auto$opt_reduce.cc:134:opt_pmux$4567 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_243$cavlc_read_run_befores.v:348$1617: { $flatten\cavlc_read_run_befores.$verific$n1185$1281 $auto$opt_reduce.cc:134:opt_pmux$4569 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_244$cavlc_read_run_befores.v:348$1618: { $flatten\cavlc_read_run_befores.$verific$n1186$1282 $auto$opt_reduce.cc:134:opt_pmux$4571 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_245$cavlc_read_run_befores.v:348$1619: { $flatten\cavlc_read_run_befores.$verific$n1187$1283 $auto$opt_reduce.cc:134:opt_pmux$4573 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_246$cavlc_read_run_befores.v:348$1620: { $flatten\cavlc_read_run_befores.$verific$n1188$1284 $auto$opt_reduce.cc:134:opt_pmux$4575 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_247$cavlc_read_run_befores.v:348$1621: { $flatten\cavlc_read_run_befores.$verific$n1189$1285 $auto$opt_reduce.cc:134:opt_pmux$4577 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_248$cavlc_read_run_befores.v:348$1622: { $flatten\cavlc_read_run_befores.$verific$n1190$1286 $auto$opt_reduce.cc:134:opt_pmux$4579 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_249$cavlc_read_run_befores.v:348$1623: { $flatten\cavlc_read_run_befores.$verific$n1191$1287 $auto$opt_reduce.cc:134:opt_pmux$4581 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_run_befores.$verific$select_250$cavlc_read_run_befores.v:348$1624: { $auto$opt_reduce.cc:134:opt_pmux$4583 $flatten\cavlc_read_run_befores.$verific$n1192$1288 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_coeffs.$verific$select_1051$cavlc_read_total_coeffs.v:1147$3098: { \cavlc_read_total_coeffs.rbsp_5 [0] $flatten\cavlc_read_total_coeffs.$verific$n4152$1939 $flatten\cavlc_read_total_coeffs.$verific$n4155$1942 $flatten\cavlc_read_total_coeffs.$verific$n4161$1948 $flatten\cavlc_read_total_coeffs.$verific$n4164$1951 $flatten\cavlc_read_total_coeffs.$verific$n4166$1953 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_coeffs.$verific$select_1052$cavlc_read_total_coeffs.v:1147$3099: { \cavlc_read_total_coeffs.rbsp_5 [0] $flatten\cavlc_read_total_coeffs.$verific$n4152$1939 $flatten\cavlc_read_total_coeffs.$verific$n4155$1942 $flatten\cavlc_read_total_coeffs.$verific$n4158$1945 $flatten\cavlc_read_total_coeffs.$verific$n4161$1948 $auto$opt_reduce.cc:134:opt_pmux$4585 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_coeffs.$verific$select_1053$cavlc_read_total_coeffs.v:1147$3100: { \cavlc_read_total_coeffs.rbsp_5 [0] $flatten\cavlc_read_total_coeffs.$verific$n4149$1936 $flatten\cavlc_read_total_coeffs.$verific$n4152$1939 $auto$opt_reduce.cc:134:opt_pmux$4589 $flatten\cavlc_read_total_coeffs.$verific$n4164$1951 $auto$opt_reduce.cc:134:opt_pmux$4587 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_coeffs.$verific$select_384$cavlc_read_total_coeffs.v:444$2767: { $flatten\cavlc_read_total_coeffs.$verific$n1613$1788 $flatten\cavlc_read_total_coeffs.$verific$n1616$1791 $flatten\cavlc_read_total_coeffs.$verific$n1619$1794 $flatten\cavlc_read_total_coeffs.$verific$n1622$1797 $flatten\cavlc_read_total_coeffs.$verific$n1625$1800 $flatten\cavlc_read_total_coeffs.$verific$n1628$1803 $flatten\cavlc_read_total_coeffs.$verific$n1631$1806 $flatten\cavlc_read_total_coeffs.$verific$n1634$1809 $flatten\cavlc_read_total_coeffs.$verific$n1637$1812 $flatten\cavlc_read_total_coeffs.$verific$n1640$1815 $flatten\cavlc_read_total_coeffs.$verific$n1643$1818 $flatten\cavlc_read_total_coeffs.$verific$n1646$1821 $auto$opt_reduce.cc:134:opt_pmux$4591 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_coeffs.$verific$select_385$cavlc_read_total_coeffs.v:444$2768: { $flatten\cavlc_read_total_coeffs.$verific$n1610$1785 $flatten\cavlc_read_total_coeffs.$verific$n1613$1788 $flatten\cavlc_read_total_coeffs.$verific$n1616$1791 $flatten\cavlc_read_total_coeffs.$verific$n1619$1794 $flatten\cavlc_read_total_coeffs.$verific$n1622$1797 $flatten\cavlc_read_total_coeffs.$verific$n1625$1800 $flatten\cavlc_read_total_coeffs.$verific$n1628$1803 $flatten\cavlc_read_total_coeffs.$verific$n1631$1806 $flatten\cavlc_read_total_coeffs.$verific$n1634$1809 $flatten\cavlc_read_total_coeffs.$verific$n1637$1812 $flatten\cavlc_read_total_coeffs.$verific$n1640$1815 $flatten\cavlc_read_total_coeffs.$verific$n1643$1818 $flatten\cavlc_read_total_coeffs.$verific$n1646$1821 $flatten\cavlc_read_total_coeffs.$verific$n1648$1823 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_coeffs.$verific$select_386$cavlc_read_total_coeffs.v:444$2769: { \cavlc_read_total_coeffs.rbsp_1 [0] $flatten\cavlc_read_total_coeffs.$verific$n1610$1785 $flatten\cavlc_read_total_coeffs.$verific$n1613$1788 $flatten\cavlc_read_total_coeffs.$verific$n1616$1791 $flatten\cavlc_read_total_coeffs.$verific$n1619$1794 $flatten\cavlc_read_total_coeffs.$verific$n1622$1797 $flatten\cavlc_read_total_coeffs.$verific$n1625$1800 $flatten\cavlc_read_total_coeffs.$verific$n1628$1803 $flatten\cavlc_read_total_coeffs.$verific$n1631$1806 $flatten\cavlc_read_total_coeffs.$verific$n1634$1809 $flatten\cavlc_read_total_coeffs.$verific$n1637$1812 $auto$opt_reduce.cc:134:opt_pmux$4595 $auto$opt_reduce.cc:134:opt_pmux$4593 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_coeffs.$verific$select_741$cavlc_read_total_coeffs.v:748$2963: { \cavlc_read_total_coeffs.rbsp_2 [0] $flatten\cavlc_read_total_coeffs.$verific$n2947$1866 $flatten\cavlc_read_total_coeffs.$verific$n2950$1869 $flatten\cavlc_read_total_coeffs.$verific$n2953$1872 $flatten\cavlc_read_total_coeffs.$verific$n2956$1875 $flatten\cavlc_read_total_coeffs.$verific$n2959$1878 $flatten\cavlc_read_total_coeffs.$verific$n2962$1881 $flatten\cavlc_read_total_coeffs.$verific$n2965$1884 $flatten\cavlc_read_total_coeffs.$verific$n2968$1887 $flatten\cavlc_read_total_coeffs.$verific$n2974$1893 $flatten\cavlc_read_total_coeffs.$verific$n2977$1896 $auto$opt_reduce.cc:134:opt_pmux$4597 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_coeffs.$verific$select_959$cavlc_read_total_coeffs.v:1052$3048: { \cavlc_read_total_coeffs.rbsp_3 [0] $flatten\cavlc_read_total_coeffs.$verific$n3828$1906 $flatten\cavlc_read_total_coeffs.$verific$n3831$1909 $flatten\cavlc_read_total_coeffs.$verific$n3834$1912 $flatten\cavlc_read_total_coeffs.$verific$n3837$1915 $flatten\cavlc_read_total_coeffs.$verific$n3840$1918 $flatten\cavlc_read_total_coeffs.$verific$n3843$1921 $auto$opt_reduce.cc:134:opt_pmux$4599 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_coeffs.$verific$select_960$cavlc_read_total_coeffs.v:1052$3049: { \cavlc_read_total_coeffs.rbsp_3 [0] $flatten\cavlc_read_total_coeffs.$verific$n3828$1906 $flatten\cavlc_read_total_coeffs.$verific$n3831$1909 $flatten\cavlc_read_total_coeffs.$verific$n3834$1912 $flatten\cavlc_read_total_coeffs.$verific$n3837$1915 $flatten\cavlc_read_total_coeffs.$verific$n3840$1918 $flatten\cavlc_read_total_coeffs.$verific$n3843$1921 $flatten\cavlc_read_total_coeffs.$verific$n3846$1924 $flatten\cavlc_read_total_coeffs.$verific$n3849$1927 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_coeffs.$verific$select_961$cavlc_read_total_coeffs.v:1052$3050: { \cavlc_read_total_coeffs.rbsp_3 [0] $flatten\cavlc_read_total_coeffs.$verific$n3828$1906 $flatten\cavlc_read_total_coeffs.$verific$n3831$1909 $flatten\cavlc_read_total_coeffs.$verific$n3834$1912 $flatten\cavlc_read_total_coeffs.$verific$n3837$1915 $flatten\cavlc_read_total_coeffs.$verific$n3840$1918 $flatten\cavlc_read_total_coeffs.$verific$n3843$1921 $flatten\cavlc_read_total_coeffs.$verific$n3846$1924 $auto$opt_reduce.cc:134:opt_pmux$4601 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_zeros.$verific$select_138$cavlc_read_total_zeros.v:217$3586: { $flatten\cavlc_read_total_zeros.$verific$n440$3150 $flatten\cavlc_read_total_zeros.$verific$n443$3153 $flatten\cavlc_read_total_zeros.$verific$n446$3156 $flatten\cavlc_read_total_zeros.$verific$n449$3159 $flatten\cavlc_read_total_zeros.$verific$n452$3162 $flatten\cavlc_read_total_zeros.$verific$n455$3165 $flatten\cavlc_read_total_zeros.$verific$n458$3168 $flatten\cavlc_read_total_zeros.$verific$n460$3170 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_zeros.$verific$select_139$cavlc_read_total_zeros.v:217$3587: { \cavlc_read_total_zeros.rbsp_LE3 [0] $flatten\cavlc_read_total_zeros.$verific$n440$3150 $flatten\cavlc_read_total_zeros.$verific$n443$3153 $flatten\cavlc_read_total_zeros.$verific$n446$3156 $flatten\cavlc_read_total_zeros.$verific$n449$3159 $flatten\cavlc_read_total_zeros.$verific$n452$3162 $flatten\cavlc_read_total_zeros.$verific$n455$3165 $auto$opt_reduce.cc:134:opt_pmux$4603 }
    New ctrl vector for $pmux cell $flatten\cavlc_read_total_zeros.$verific$select_230$cavlc_read_total_zeros.v:317$3612: { \cavlc_read_total_zeros.rbsp_LE3 [0] $flatten\cavlc_read_total_zeros.$verific$n440$3150 $flatten\cavlc_read_total_zeros.$verific$n443$3153 $auto$opt_reduce.cc:134:opt_pmux$4605 $flatten\cavlc_read_total_zeros.$verific$n451$3161 }
  Optimizing cells in module \cavlc.
Performed a total of 32 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
<suppressed ~36 debug messages>
Removed a total of 12 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\cavlc_read_total_coeffs.$verific$rbsp_5_reg$cavlc_read_total_coeffs.v:149$2546 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_total_coeffs.$verific$rbsp_4_reg$cavlc_read_total_coeffs.v:149$2545 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_total_coeffs.$verific$rbsp_3_reg$cavlc_read_total_coeffs.v:149$2544 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_total_coeffs.$verific$rbsp_2_reg$cavlc_read_total_coeffs.v:149$2543 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_total_coeffs.$verific$rbsp_1_reg$cavlc_read_total_coeffs.v:149$2542 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_total_coeffs.$verific$TrailingOnes_reg$cavlc_read_total_coeffs.v:1193$3132 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_total_coeffs.$verific$TotalCoeff_reg$cavlc_read_total_coeffs.v:1193$3133 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_9_reg$cavlc_read_run_befores.v:366$1728 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_8_reg$cavlc_read_run_befores.v:366$1727 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_7_reg$cavlc_read_run_befores.v:366$1726 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_6_reg$cavlc_read_run_befores.v:366$1725 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_5_reg$cavlc_read_run_befores.v:366$1724 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_4_reg$cavlc_read_run_befores.v:366$1723 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_3_reg$cavlc_read_run_befores.v:366$1722 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_2_reg$cavlc_read_run_befores.v:366$1721 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_1_reg$cavlc_read_run_befores.v:366$1720 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_15_reg$cavlc_read_run_befores.v:366$1734 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_14_reg$cavlc_read_run_befores.v:366$1733 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_13_reg$cavlc_read_run_befores.v:366$1732 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_12_reg$cavlc_read_run_befores.v:366$1731 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_11_reg$cavlc_read_run_befores.v:366$1730 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_10_reg$cavlc_read_run_befores.v:366$1729 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$coeff_0_reg$cavlc_read_run_befores.v:366$1719 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_run_befores.$verific$ZeroLeft_reg$cavlc_read_run_befores.v:286$1583 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$suffixLength_reg$cavlc_read_levels.v:187$1050 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_prefix_reg$cavlc_read_levels.v:165$1022 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_code_tmp_reg$cavlc_read_levels.v:213$1073 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_abs_reg$cavlc_read_levels.v:245$1091 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_9_reg$cavlc_read_levels.v:382$1206 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_8_reg$cavlc_read_levels.v:382$1205 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_7_reg$cavlc_read_levels.v:382$1204 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_6_reg$cavlc_read_levels.v:382$1203 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_5_reg$cavlc_read_levels.v:382$1202 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_4_reg$cavlc_read_levels.v:382$1201 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_3_reg$cavlc_read_levels.v:382$1200 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_2_reg$cavlc_read_levels.v:382$1199 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_1_reg$cavlc_read_levels.v:382$1198 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_15_reg$cavlc_read_levels.v:382$1212 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_14_reg$cavlc_read_levels.v:382$1211 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_13_reg$cavlc_read_levels.v:382$1210 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_12_reg$cavlc_read_levels.v:382$1209 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_11_reg$cavlc_read_levels.v:382$1208 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_10_reg$cavlc_read_levels.v:382$1207 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_read_levels.$verific$level_0_reg$cavlc_read_levels.v:382$1197 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_fsm.$verific$valid_reg$cavlc_fsm.v:155$736 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_fsm.$verific$state_reg$cavlc_fsm.v:155$734 ($aldff) from module cavlc.
Changing const-value async load to async reset on $flatten\cavlc_fsm.$verific$i_reg$cavlc_fsm.v:155$735 ($aldff) from module cavlc.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 0 unused cells and 8 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
<suppressed ~2 debug messages>

yosys> opt_muxtree

3.25. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~82 debug messages>

yosys> opt_reduce

3.26. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_share

3.28. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.29. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.31. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.32. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.32.1. Executing FSM_DETECT pass (finding FSMs in design).
Not marking cavlc.cavlc_fsm.state as FSM state register:
    Register is connected to module port.
    Users of register don't seem to benefit from recoding.
Not marking cavlc.cavlc_read_levels.level_prefix as FSM state register:
    Users of register don't seem to benefit from recoding.

yosys> fsm_extract

3.32.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.32.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.32.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..

yosys> fsm_opt

3.32.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.32.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.32.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.32.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.

yosys> opt_merge -nomux

3.34. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~82 debug messages>

yosys> opt_reduce

3.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_share

3.38. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.39. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\cavlc_read_total_coeffs.$verific$rbsp_5_reg$cavlc_read_total_coeffs.v:149$2546 ($adff) from module cavlc (D = { \rbsp [0] \rbsp [1] \rbsp [2] \rbsp [3] \rbsp [4] \rbsp [5] \rbsp [6] \rbsp [7] }, Q = { \cavlc_read_total_coeffs.rbsp_5 [0] \cavlc_read_total_coeffs.rbsp_5 [1] \cavlc_read_total_coeffs.rbsp_5 [2] \cavlc_read_total_coeffs.rbsp_5 [3] \cavlc_read_total_coeffs.rbsp_5 [4] \cavlc_read_total_coeffs.rbsp_5 [5] \cavlc_read_total_coeffs.rbsp_5 [6] \cavlc_read_total_coeffs.rbsp_5 [7] }).
Adding EN signal on $flatten\cavlc_read_total_coeffs.$verific$rbsp_4_reg$cavlc_read_total_coeffs.v:149$2545 ($adff) from module cavlc (D = { \rbsp [0] \rbsp [1] \rbsp [2] \rbsp [3] \rbsp [4] \rbsp [5] }, Q = { \cavlc_read_total_coeffs.rbsp_4 [0] \cavlc_read_total_coeffs.rbsp_4 [1] \cavlc_read_total_coeffs.rbsp_4 [2] \cavlc_read_total_coeffs.rbsp_4 [3] \cavlc_read_total_coeffs.rbsp_4 [4] \cavlc_read_total_coeffs.rbsp_4 [5] }).
Adding EN signal on $flatten\cavlc_read_total_coeffs.$verific$rbsp_3_reg$cavlc_read_total_coeffs.v:149$2544 ($adff) from module cavlc (D = { \rbsp [0] \rbsp [1] \rbsp [2] \rbsp [3] \rbsp [4] \rbsp [5] \rbsp [6] \rbsp [7] \rbsp [8] \rbsp [9] }, Q = { \cavlc_read_total_coeffs.rbsp_3 [0] \cavlc_read_total_coeffs.rbsp_3 [1] \cavlc_read_total_coeffs.rbsp_3 [2] \cavlc_read_total_coeffs.rbsp_3 [3] \cavlc_read_total_coeffs.rbsp_3 [4] \cavlc_read_total_coeffs.rbsp_3 [5] \cavlc_read_total_coeffs.rbsp_3 [6] \cavlc_read_total_coeffs.rbsp_3 [7] \cavlc_read_total_coeffs.rbsp_3 [8] \cavlc_read_total_coeffs.rbsp_3 [9] }).
Adding EN signal on $flatten\cavlc_read_total_coeffs.$verific$rbsp_2_reg$cavlc_read_total_coeffs.v:149$2543 ($adff) from module cavlc (D = { \rbsp [0] \rbsp [1] \rbsp [2] \rbsp [3] \rbsp [4] \rbsp [5] \rbsp [6] \rbsp [7] \rbsp [8] \rbsp [9] \rbsp [10] \rbsp [11] \rbsp [12] \rbsp [13] }, Q = { \cavlc_read_total_coeffs.rbsp_2 [0] \cavlc_read_total_coeffs.rbsp_2 [1] \cavlc_read_total_coeffs.rbsp_2 [2] \cavlc_read_total_coeffs.rbsp_2 [3] \cavlc_read_total_coeffs.rbsp_2 [4] \cavlc_read_total_coeffs.rbsp_2 [5] \cavlc_read_total_coeffs.rbsp_2 [6] \cavlc_read_total_coeffs.rbsp_2 [7] \cavlc_read_total_coeffs.rbsp_2 [8] \cavlc_read_total_coeffs.rbsp_2 [9] \cavlc_read_total_coeffs.rbsp_2 [10] \cavlc_read_total_coeffs.rbsp_2 [11] \cavlc_read_total_coeffs.rbsp_2 [12] \cavlc_read_total_coeffs.rbsp_2 [13] }).
Adding EN signal on $flatten\cavlc_read_total_coeffs.$verific$rbsp_1_reg$cavlc_read_total_coeffs.v:149$2542 ($adff) from module cavlc (D = { \rbsp [0] \rbsp [1] \rbsp [2] \rbsp [3] \rbsp [4] \rbsp [5] \rbsp [6] \rbsp [7] \rbsp [8] \rbsp [9] \rbsp [10] \rbsp [11] \rbsp [12] \rbsp [13] \rbsp [14] \rbsp [15] }, Q = { \cavlc_read_total_coeffs.rbsp_1 [0] \cavlc_read_total_coeffs.rbsp_1 [1] \cavlc_read_total_coeffs.rbsp_1 [2] \cavlc_read_total_coeffs.rbsp_1 [3] \cavlc_read_total_coeffs.rbsp_1 [4] \cavlc_read_total_coeffs.rbsp_1 [5] \cavlc_read_total_coeffs.rbsp_1 [6] \cavlc_read_total_coeffs.rbsp_1 [7] \cavlc_read_total_coeffs.rbsp_1 [8] \cavlc_read_total_coeffs.rbsp_1 [9] \cavlc_read_total_coeffs.rbsp_1 [10] \cavlc_read_total_coeffs.rbsp_1 [11] \cavlc_read_total_coeffs.rbsp_1 [12] \cavlc_read_total_coeffs.rbsp_1 [13] \cavlc_read_total_coeffs.rbsp_1 [14] \cavlc_read_total_coeffs.rbsp_1 [15] }).
Adding EN signal on $flatten\cavlc_read_total_coeffs.$verific$TrailingOnes_reg$cavlc_read_total_coeffs.v:1193$3132 ($adff) from module cavlc (D = \cavlc_fsm.TrailingOnes_comb, Q = \cavlc_read_total_coeffs.TrailingOnes).
Adding EN signal on $flatten\cavlc_read_total_coeffs.$verific$TotalCoeff_reg$cavlc_read_total_coeffs.v:1193$3133 ($adff) from module cavlc (D = \cavlc_fsm.TotalCoeff_comb, Q = \cavlc_read_total_coeffs.TotalCoeff).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_9_reg$cavlc_read_run_befores.v:366$1728 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2079$1490, Q = \cavlc_read_run_befores.coeff_9).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_8_reg$cavlc_read_run_befores.v:366$1727 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2069$1489, Q = \cavlc_read_run_befores.coeff_8).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_7_reg$cavlc_read_run_befores.v:366$1726 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2059$1488, Q = \cavlc_read_run_befores.coeff_7).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_6_reg$cavlc_read_run_befores.v:366$1725 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2049$1487, Q = \cavlc_read_run_befores.coeff_6).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_5_reg$cavlc_read_run_befores.v:366$1724 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2039$1486, Q = \cavlc_read_run_befores.coeff_5).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_4_reg$cavlc_read_run_befores.v:366$1723 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2029$1485, Q = \cavlc_read_run_befores.coeff_4).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_3_reg$cavlc_read_run_befores.v:366$1722 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2019$1484, Q = \cavlc_read_run_befores.coeff_3).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_2_reg$cavlc_read_run_befores.v:366$1721 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2009$1483, Q = \cavlc_read_run_befores.coeff_2).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_1_reg$cavlc_read_run_befores.v:366$1720 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n1999$1482, Q = \cavlc_read_run_befores.coeff_1).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_15_reg$cavlc_read_run_befores.v:366$1734 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2139$1496, Q = \cavlc_read_run_befores.coeff_15).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_14_reg$cavlc_read_run_befores.v:366$1733 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2129$1495, Q = \cavlc_read_run_befores.coeff_14).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_13_reg$cavlc_read_run_befores.v:366$1732 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2119$1494, Q = \cavlc_read_run_befores.coeff_13).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_12_reg$cavlc_read_run_befores.v:366$1731 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2109$1493, Q = \cavlc_read_run_befores.coeff_12).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_11_reg$cavlc_read_run_befores.v:366$1730 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2099$1492, Q = \cavlc_read_run_befores.coeff_11).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_10_reg$cavlc_read_run_befores.v:366$1729 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n2089$1491, Q = \cavlc_read_run_befores.coeff_10).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$coeff_0_reg$cavlc_read_run_befores.v:366$1719 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n1989$1481, Q = \cavlc_read_run_befores.coeff_0).
Adding EN signal on $flatten\cavlc_read_run_befores.$verific$ZeroLeft_reg$cavlc_read_run_befores.v:286$1583 ($adff) from module cavlc (D = $flatten\cavlc_read_run_befores.$verific$n494$1382, Q = \cavlc_read_run_befores.ZeroLeft).
Adding EN signal on $flatten\cavlc_read_levels.$verific$suffixLength_reg$cavlc_read_levels.v:187$1050 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n363$840, Q = \cavlc_read_levels.suffixLength).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_prefix_reg$cavlc_read_levels.v:165$1022 ($adff) from module cavlc (D = \cavlc_read_levels.level_prefix_comb, Q = \cavlc_read_levels.level_prefix).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_code_tmp_reg$cavlc_read_levels.v:213$1073 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n551$853 [8:0], Q = \cavlc_read_levels.level_code_tmp).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_abs_reg$cavlc_read_levels.v:245$1091 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n800$864, Q = \cavlc_read_levels.level_abs).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_9_reg$cavlc_read_levels.v:382$1206 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3944$957, Q = \cavlc_read_levels.level_9).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_8_reg$cavlc_read_levels.v:382$1205 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3954$958, Q = \cavlc_read_levels.level_8).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_7_reg$cavlc_read_levels.v:382$1204 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3964$959, Q = \cavlc_read_levels.level_7).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_6_reg$cavlc_read_levels.v:382$1203 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3974$960, Q = \cavlc_read_levels.level_6).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_5_reg$cavlc_read_levels.v:382$1202 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3984$961, Q = \cavlc_read_levels.level_5).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_4_reg$cavlc_read_levels.v:382$1201 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3994$962, Q = \cavlc_read_levels.level_4).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_3_reg$cavlc_read_levels.v:382$1200 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n4004$963, Q = \cavlc_read_levels.level_3).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_2_reg$cavlc_read_levels.v:382$1199 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n4014$964, Q = \cavlc_read_levels.level_2).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_1_reg$cavlc_read_levels.v:382$1198 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n4024$965, Q = \cavlc_read_levels.level_1).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_15_reg$cavlc_read_levels.v:382$1212 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3884$951, Q = \cavlc_read_levels.level_15).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_14_reg$cavlc_read_levels.v:382$1211 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3894$952, Q = \cavlc_read_levels.level_14).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_13_reg$cavlc_read_levels.v:382$1210 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3904$953, Q = \cavlc_read_levels.level_13).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_12_reg$cavlc_read_levels.v:382$1209 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3914$954, Q = \cavlc_read_levels.level_12).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_11_reg$cavlc_read_levels.v:382$1208 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3924$955, Q = \cavlc_read_levels.level_11).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_10_reg$cavlc_read_levels.v:382$1207 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n3934$956, Q = \cavlc_read_levels.level_10).
Adding EN signal on $flatten\cavlc_read_levels.$verific$level_0_reg$cavlc_read_levels.v:382$1197 ($adff) from module cavlc (D = $flatten\cavlc_read_levels.$verific$n4034$966, Q = \cavlc_read_levels.level_0).
Adding EN signal on $flatten\cavlc_fsm.$verific$valid_reg$cavlc_fsm.v:155$736 ($adff) from module cavlc (D = $flatten\cavlc_fsm.$verific$n345$626, Q = \cavlc_fsm.valid).
Adding EN signal on $flatten\cavlc_fsm.$verific$state_reg$cavlc_fsm.v:155$734 ($adff) from module cavlc (D = $flatten\cavlc_fsm.$verific$n335$666, Q = \cavlc_fsm.state).
Adding EN signal on $flatten\cavlc_fsm.$verific$i_reg$cavlc_fsm.v:155$735 ($adff) from module cavlc (D = $flatten\cavlc_fsm.$verific$n346$667, Q = \cavlc_fsm.i).

yosys> opt_clean

3.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 28 unused cells and 28 unused wires.
<suppressed ~29 debug messages>

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
<suppressed ~36 debug messages>

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~73 debug messages>

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
<suppressed ~630 debug messages>
Removed a total of 210 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.46. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 0 unused cells and 194 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.

yosys> opt_muxtree

3.49. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~111 debug messages>

yosys> opt_reduce

3.50. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.51. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_share

3.52. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.53. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..

yosys> opt_expr

3.55. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
MAX OPT ITERATION = 3

yosys> wreduce -keepdc

3.56. Executing WREDUCE pass (reducing word size of cells).
Removed top 3 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$5155 ($ne).
Removed top 3 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$5159 ($ne).
Removed top 2 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$5167 ($ne).
Removed top 2 bits (of 5) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$5169 ($ne).
Removed top 1 bits (of 3) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$5182 ($ne).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3701 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3702 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3704 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3706 ($mux).
Removed top 3 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3711 ($mux).
Removed top 3 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3712 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3714 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3717 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3719 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3731 ($mux).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3732 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3734 ($mux).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3736 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3737 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3739 ($mux).
Removed top 3 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3741 ($mux).
Removed top 3 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3742 ($mux).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:60:execute$3744 ($mux).
Removed top 3 bits (of 4) from port B of cell cavlc.$flatten\cavlc_read_total_zeros.$verific$equal_30$cavlc_read_total_zeros.v:115$3519 ($eq).
Removed top 2 bits (of 4) from port B of cell cavlc.$flatten\cavlc_read_total_zeros.$verific$equal_45$cavlc_read_total_zeros.v:131$3527 ($eq).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_101$cavlc_read_total_zeros.v:204$3561 ($mux).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_105$cavlc_read_total_zeros.v:211$3563 ($mux).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_151$cavlc_read_total_zeros.v:240$3591 ($mux).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_152$cavlc_read_total_zeros.v:241$3592 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_153$cavlc_read_total_zeros.v:241$3593 ($mux).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_161$cavlc_read_total_zeros.v:255$3596 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_195$cavlc_read_total_zeros.v:289$3605 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_196$cavlc_read_total_zeros.v:290$3606 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_211$cavlc_read_total_zeros.v:315$3611 ($mux).
Removed top 3 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_247$cavlc_read_total_zeros.v:351$3621 ($mux).
Removed top 3 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_283$cavlc_read_total_zeros.v:393$3637 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_284$cavlc_read_total_zeros.v:394$3638 ($mux).
Removed top 2 bits (of 3) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_359$cavlc_read_total_zeros.v:468$3650 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_471$cavlc_read_total_zeros.v:576$3663 ($mux).
Removed top 3 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_552$cavlc_read_total_zeros.v:664$3676 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_591$cavlc_read_total_zeros.v:712$3694 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_60$cavlc_read_total_zeros.v:150$3532 ($mux).
Removed top 3 bits (of 12) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_626$cavlc_read_total_zeros.v:685$3509 ($mux).
Removed top 3 bits (of 8) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_628$cavlc_read_total_zeros.v:678$3684 ($mux).
Removed top 5 bits (of 6) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_664$cavlc_read_total_zeros.v:678$3682 ($mux).
Removed top 1 bits (of 8) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_682$cavlc_read_total_zeros.v:610$3674 ($mux).
Removed top 3 bits (of 8) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_686$cavlc_read_total_zeros.v:595$3667 ($mux).
Removed top 3 bits (of 8) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_689$cavlc_read_total_zeros.v:505$3662 ($mux).
Removed top 1 bits (of 12) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_690$cavlc_read_total_zeros.v:512$3654 ($mux).
Removed top 3 bits (of 16) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_692$cavlc_read_total_zeros.v:565$3653 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_85$cavlc_read_total_zeros.v:176$3553 ($mux).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_89$cavlc_read_total_zeros.v:183$3555 ($mux).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$mux_97$cavlc_read_total_zeros.v:197$3559 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$select_182$cavlc_read_total_zeros.v:266$3598 ($pmux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$select_230$cavlc_read_total_zeros.v:317$3612 ($pmux).
Removed top 1 bits (of 8) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$select_685$cavlc_read_total_zeros.v:597$3624 ($pmux).
Removed top 1 bits (of 16) from mux cell cavlc.$flatten\cavlc_read_total_zeros.$verific$select_688$cavlc_read_total_zeros.v:567$3664 ($pmux).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4848 ($ne).
Removed top 1 bits (of 5) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4850 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4852 ($ne).
Removed top 1 bits (of 5) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4858 ($ne).
Removed top 1 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4860 ($ne).
Removed top 2 bits (of 3) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4864 ($ne).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4871 ($ne).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4875 ($ne).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4898 ($ne).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4902 ($ne).
Removed top 1 bits (of 5) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4904 ($ne).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4910 ($ne).
Removed top 1 bits (of 5) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4912 ($ne).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4921 ($ne).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4925 ($ne).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4933 ($ne).
Removed top 1 bits (of 5) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4935 ($ne).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4944 ($ne).
Removed top 2 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4948 ($ne).
Removed top 3 bits (of 5) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4950 ($ne).
Removed top 1 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4952 ($ne).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4956 ($ne).
Removed top 2 bits (of 5) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4958 ($ne).
Removed top 3 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4960 ($ne).
Removed top 1 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4962 ($ne).
Removed top 2 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4969 ($ne).
Removed top 2 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4973 ($ne).
Removed top 1 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4981 ($ne).
Removed top 1 bits (of 5) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4983 ($ne).
Removed top 2 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4994 ($ne).
Removed top 4 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4998 ($ne).
Removed top 2 bits (of 5) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$5000 ($ne).
Removed top 2 bits (of 6) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$5006 ($ne).
Removed top 4 bits (of 5) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$5008 ($ne).
Removed top 1 bits (of 3) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$5010 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4710 ($ne).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3789 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3790 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3794 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3795 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3796 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3797 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3799 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3800 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3802 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3805 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3806 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3814 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3815 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3816 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3817 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3819 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3820 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3822 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3824 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3825 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3834 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3835 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3836 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3837 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3839 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3840 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3842 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3846 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3847 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3854 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3855 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3856 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3857 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3859 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3860 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3862 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3865 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3866 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3876 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3877 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3879 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3880 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3882 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3894 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3896 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3897 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3899 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3900 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3902 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3906 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:60:execute$3907 ($mux).
Removed top 3 bits (of 4) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$add_967$cavlc_read_total_coeffs.v:1066$3054 ($add).
Removed top 1 bits (of 2) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_110$cavlc_read_total_coeffs.v:233$2587 ($eq).
Removed top 1 bits (of 2) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_128$cavlc_read_total_coeffs.v:252$2597 ($eq).
Removed top 1 bits (of 2) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_146$cavlc_read_total_coeffs.v:271$2607 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_161$cavlc_read_total_coeffs.v:286$2616 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_170$cavlc_read_total_coeffs.v:298$2621 ($eq).
Removed top 2 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_176$cavlc_read_total_coeffs.v:306$2624 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_202$cavlc_read_total_coeffs.v:325$2644 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_205$cavlc_read_total_coeffs.v:329$2646 ($eq).
Removed top 2 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_211$cavlc_read_total_coeffs.v:337$2648 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_240$cavlc_read_total_coeffs.v:360$2668 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_243$cavlc_read_total_coeffs.v:364$2670 ($eq).
Removed top 2 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_249$cavlc_read_total_coeffs.v:372$2672 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_275$cavlc_read_total_coeffs.v:391$2691 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_284$cavlc_read_total_coeffs.v:403$2695 ($eq).
Removed top 2 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_287$cavlc_read_total_coeffs.v:407$2697 ($eq).
Removed top 1 bits (of 2) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_428$cavlc_read_total_coeffs.v:500$2786 ($eq).
Removed top 1 bits (of 2) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_475$cavlc_read_total_coeffs.v:540$2810 ($eq).
Removed top 1 bits (of 2) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_511$cavlc_read_total_coeffs.v:578$2828 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_526$cavlc_read_total_coeffs.v:593$2837 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_535$cavlc_read_total_coeffs.v:605$2840 ($eq).
Removed top 2 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_538$cavlc_read_total_coeffs.v:609$2841 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_564$cavlc_read_total_coeffs.v:628$2858 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_576$cavlc_read_total_coeffs.v:644$2862 ($eq).
Removed top 2 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_579$cavlc_read_total_coeffs.v:648$2863 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_608$cavlc_read_total_coeffs.v:671$2881 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_611$cavlc_read_total_coeffs.v:675$2882 ($eq).
Removed top 2 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_614$cavlc_read_total_coeffs.v:679$2883 ($eq).
Removed top 1 bits (of 2) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_648$cavlc_read_total_coeffs.v:708$2903 ($eq).
Removed top 2 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_866$cavlc_read_total_coeffs.v:989$2992 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_874$cavlc_read_total_coeffs.v:999$2994 ($eq).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_878$cavlc_read_total_coeffs.v:1004$2995 ($eq).
Removed top 1 bits (of 2) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_92$cavlc_read_total_coeffs.v:214$2577 ($eq).
Removed top 4 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$equal_963$cavlc_read_total_coeffs.v:1060$3052 ($eq).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_1005$cavlc_read_total_coeffs.v:1118$3072 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_115$cavlc_read_total_coeffs.v:240$2589 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_116$cavlc_read_total_coeffs.v:240$2590 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_118$cavlc_read_total_coeffs.v:240$2592 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_120$cavlc_read_total_coeffs.v:240$2594 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_133$cavlc_read_total_coeffs.v:259$2599 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_134$cavlc_read_total_coeffs.v:259$2600 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_136$cavlc_read_total_coeffs.v:259$2602 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_138$cavlc_read_total_coeffs.v:259$2604 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_151$cavlc_read_total_coeffs.v:278$2609 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_152$cavlc_read_total_coeffs.v:278$2610 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_154$cavlc_read_total_coeffs.v:278$2612 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_156$cavlc_read_total_coeffs.v:278$2614 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_181$cavlc_read_total_coeffs.v:313$2627 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_182$cavlc_read_total_coeffs.v:313$2628 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_183$cavlc_read_total_coeffs.v:313$2629 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_184$cavlc_read_total_coeffs.v:313$2630 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_186$cavlc_read_total_coeffs.v:313$2632 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_188$cavlc_read_total_coeffs.v:313$2634 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_190$cavlc_read_total_coeffs.v:313$2636 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_192$cavlc_read_total_coeffs.v:313$2638 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_194$cavlc_read_total_coeffs.v:313$2640 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_220$cavlc_read_total_coeffs.v:348$2653 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_221$cavlc_read_total_coeffs.v:348$2654 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_222$cavlc_read_total_coeffs.v:348$2655 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_223$cavlc_read_total_coeffs.v:348$2656 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_224$cavlc_read_total_coeffs.v:348$2657 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_226$cavlc_read_total_coeffs.v:348$2659 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_228$cavlc_read_total_coeffs.v:348$2661 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_230$cavlc_read_total_coeffs.v:348$2663 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_232$cavlc_read_total_coeffs.v:348$2665 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_258$cavlc_read_total_coeffs.v:383$2677 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_259$cavlc_read_total_coeffs.v:383$2678 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_260$cavlc_read_total_coeffs.v:383$2679 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_261$cavlc_read_total_coeffs.v:383$2680 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_262$cavlc_read_total_coeffs.v:383$2681 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_264$cavlc_read_total_coeffs.v:383$2683 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_266$cavlc_read_total_coeffs.v:383$2685 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_268$cavlc_read_total_coeffs.v:383$2687 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_270$cavlc_read_total_coeffs.v:383$2689 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_297$cavlc_read_total_coeffs.v:418$2703 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_393$cavlc_read_total_coeffs.v:460$2772 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_394$cavlc_read_total_coeffs.v:460$2773 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_407$cavlc_read_total_coeffs.v:477$2776 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_409$cavlc_read_total_coeffs.v:477$2778 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_410$cavlc_read_total_coeffs.v:477$2779 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_411$cavlc_read_total_coeffs.v:477$2780 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_435$cavlc_read_total_coeffs.v:509$2789 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_436$cavlc_read_total_coeffs.v:509$2790 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_439$cavlc_read_total_coeffs.v:509$2793 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_442$cavlc_read_total_coeffs.v:509$2796 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_445$cavlc_read_total_coeffs.v:509$2799 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_446$cavlc_read_total_coeffs.v:509$2800 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_448$cavlc_read_total_coeffs.v:509$2802 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_449$cavlc_read_total_coeffs.v:509$2803 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_463$cavlc_read_total_coeffs.v:528$2805 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_465$cavlc_read_total_coeffs.v:528$2806 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_467$cavlc_read_total_coeffs.v:528$2807 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_480$cavlc_read_total_coeffs.v:547$2811 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_481$cavlc_read_total_coeffs.v:547$2812 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_483$cavlc_read_total_coeffs.v:547$2814 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_485$cavlc_read_total_coeffs.v:547$2816 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_501$cavlc_read_total_coeffs.v:566$2823 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_503$cavlc_read_total_coeffs.v:566$2825 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_516$cavlc_read_total_coeffs.v:585$2830 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_517$cavlc_read_total_coeffs.v:585$2831 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_519$cavlc_read_total_coeffs.v:585$2833 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_521$cavlc_read_total_coeffs.v:585$2835 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_547$cavlc_read_total_coeffs.v:620$2844 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_548$cavlc_read_total_coeffs.v:620$2845 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_549$cavlc_read_total_coeffs.v:620$2846 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_551$cavlc_read_total_coeffs.v:620$2848 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_553$cavlc_read_total_coeffs.v:620$2850 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_555$cavlc_read_total_coeffs.v:620$2852 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_557$cavlc_read_total_coeffs.v:620$2854 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_559$cavlc_read_total_coeffs.v:620$2856 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_584$cavlc_read_total_coeffs.v:655$2864 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_585$cavlc_read_total_coeffs.v:655$2865 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_587$cavlc_read_total_coeffs.v:655$2867 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_589$cavlc_read_total_coeffs.v:655$2869 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_591$cavlc_read_total_coeffs.v:655$2871 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_593$cavlc_read_total_coeffs.v:655$2873 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_595$cavlc_read_total_coeffs.v:655$2875 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_597$cavlc_read_total_coeffs.v:655$2877 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_62$cavlc_read_total_coeffs.v:185$2556 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_623$cavlc_read_total_coeffs.v:690$2887 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_624$cavlc_read_total_coeffs.v:690$2888 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_625$cavlc_read_total_coeffs.v:690$2889 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_627$cavlc_read_total_coeffs.v:690$2891 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_629$cavlc_read_total_coeffs.v:690$2893 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_63$cavlc_read_total_coeffs.v:185$2557 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_631$cavlc_read_total_coeffs.v:690$2895 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_633$cavlc_read_total_coeffs.v:690$2897 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_635$cavlc_read_total_coeffs.v:690$2899 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_66$cavlc_read_total_coeffs.v:185$2560 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_666$cavlc_read_total_coeffs.v:722$2913 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_669$cavlc_read_total_coeffs.v:722$2916 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_67$cavlc_read_total_coeffs.v:185$2561 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_670$cavlc_read_total_coeffs.v:722$2917 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_672$cavlc_read_total_coeffs.v:722$2919 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_673$cavlc_read_total_coeffs.v:722$2920 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_686$cavlc_read_total_coeffs.v:741$2923 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_79$cavlc_read_total_coeffs.v:202$2566 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_80$cavlc_read_total_coeffs.v:202$2567 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_82$cavlc_read_total_coeffs.v:202$2569 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_83$cavlc_read_total_coeffs.v:202$2570 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_84$cavlc_read_total_coeffs.v:202$2571 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_886$cavlc_read_total_coeffs.v:1013$2998 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_889$cavlc_read_total_coeffs.v:1013$3001 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_892$cavlc_read_total_coeffs.v:1013$3004 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_895$cavlc_read_total_coeffs.v:1013$3007 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_898$cavlc_read_total_coeffs.v:1013$3010 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_901$cavlc_read_total_coeffs.v:1013$3013 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_902$cavlc_read_total_coeffs.v:1013$3014 ($mux).
Removed top 1 bits (of 2) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_97$cavlc_read_total_coeffs.v:221$2579 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_98$cavlc_read_total_coeffs.v:221$2580 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_993$cavlc_read_total_coeffs.v:1107$3065 ($mux).
Removed top 4 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_995$cavlc_read_total_coeffs.v:1107$3067 ($mux).
Removed top 3 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_997$cavlc_read_total_coeffs.v:1107$3069 ($mux).
Removed top 2 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$select_1052$cavlc_read_total_coeffs.v:1147$3099 ($pmux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$select_1053$cavlc_read_total_coeffs.v:1147$3100 ($pmux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$select_741$cavlc_read_total_coeffs.v:748$2963 ($pmux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_total_coeffs.$verific$select_959$cavlc_read_total_coeffs.v:1052$3048 ($pmux).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4719 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4728 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4737 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4746 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4755 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4764 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4773 ($ne).
Removed top 1 bits (of 2) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4782 ($ne).
Removed top 1 bits (of 3) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4808 ($ne).
Removed top 1 bits (of 2) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4816 ($ne).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_run_befores.$auto$bmuxmap.cc:60:execute$3933 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_run_befores.$auto$bmuxmap.cc:60:execute$3934 ($mux).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_run_befores.$auto$bmuxmap.cc:60:execute$3935 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_run_befores.$auto$bmuxmap.cc:60:execute$3938 ($mux).
Removed top 2 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_run_befores.$auto$bmuxmap.cc:60:execute$3939 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_run_befores.$auto$bmuxmap.cc:60:execute$3941 ($mux).
Removed top 3 bits (of 4) from port A of cell cavlc.$flatten\cavlc_read_run_befores.$verific$LessThan_127$cavlc_read_run_befores.v:269$1572 ($lt).
Removed top 3 bits (of 4) from port A of cell cavlc.$flatten\cavlc_read_run_befores.$verific$LessThan_203$cavlc_read_run_befores.v:330$1589 ($lt).
Removed top 3 bits (of 4) from port A of cell cavlc.$flatten\cavlc_read_run_befores.$verific$LessThan_253$cavlc_read_run_befores.v:351$1626 ($le).
Removed top 2 bits (of 4) from port A of cell cavlc.$flatten\cavlc_read_run_befores.$verific$LessThan_256$cavlc_read_run_befores.v:352$1629 ($le).
Removed top 2 bits (of 4) from port A of cell cavlc.$flatten\cavlc_read_run_befores.$verific$LessThan_259$cavlc_read_run_befores.v:353$1632 ($le).
Removed top 1 bits (of 4) from port A of cell cavlc.$flatten\cavlc_read_run_befores.$verific$LessThan_262$cavlc_read_run_befores.v:354$1635 ($le).
Removed top 1 bits (of 4) from port A of cell cavlc.$flatten\cavlc_read_run_befores.$verific$LessThan_265$cavlc_read_run_befores.v:355$1638 ($le).
Removed top 1 bits (of 4) from port A of cell cavlc.$flatten\cavlc_read_run_befores.$verific$LessThan_268$cavlc_read_run_befores.v:356$1641 ($le).
Removed top 1 bits (of 4) from port A of cell cavlc.$flatten\cavlc_read_run_befores.$verific$LessThan_271$cavlc_read_run_befores.v:357$1644 ($le).
Removed top 3 bits (of 4) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_114$cavlc_read_run_befores.v:181$1559 ($eq).
Removed top 2 bits (of 4) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_115$cavlc_read_run_befores.v:182$1560 ($eq).
Removed top 2 bits (of 4) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_116$cavlc_read_run_befores.v:195$1561 ($eq).
Removed top 1 bits (of 4) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_117$cavlc_read_run_befores.v:199$1562 ($eq).
Removed top 1 bits (of 4) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_118$cavlc_read_run_befores.v:209$1563 ($eq).
Removed top 1 bits (of 4) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_119$cavlc_read_run_befores.v:223$1564 ($eq).
Removed top 4 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_221$cavlc_read_run_befores.v:332$1593 ($eq).
Removed top 3 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_222$cavlc_read_run_befores.v:333$1594 ($eq).
Removed top 3 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_223$cavlc_read_run_befores.v:334$1595 ($eq).
Removed top 2 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_224$cavlc_read_run_befores.v:335$1596 ($eq).
Removed top 2 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_225$cavlc_read_run_befores.v:336$1597 ($eq).
Removed top 2 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_226$cavlc_read_run_befores.v:337$1598 ($eq).
Removed top 2 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_227$cavlc_read_run_befores.v:338$1599 ($eq).
Removed top 1 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_228$cavlc_read_run_befores.v:339$1600 ($eq).
Removed top 1 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_229$cavlc_read_run_befores.v:340$1601 ($eq).
Removed top 1 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_230$cavlc_read_run_befores.v:341$1602 ($eq).
Removed top 1 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_231$cavlc_read_run_befores.v:342$1603 ($eq).
Removed top 1 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_232$cavlc_read_run_befores.v:343$1604 ($eq).
Removed top 1 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_233$cavlc_read_run_befores.v:344$1605 ($eq).
Removed top 1 bits (of 5) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$equal_234$cavlc_read_run_befores.v:345$1606 ($eq).
Removed top 3 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_run_befores.$verific$mux_30$cavlc_read_run_befores.v:207$1517 ($mux).
Removed top 2 bits (of 8) from mux cell cavlc.$flatten\cavlc_read_run_befores.$verific$mux_364$cavlc_read_run_befores.v:193$1510 ($mux).
Removed top 2 bits (of 8) from mux cell cavlc.$flatten\cavlc_read_run_befores.$verific$mux_372$cavlc_read_run_befores.v:193$1502 ($mux).
Removed top 1 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_run_befores.$verific$mux_55$cavlc_read_run_befores.v:238$1524 ($mux).
Removed top 3 bits (of 4) from mux cell cavlc.$flatten\cavlc_read_run_befores.$verific$mux_56$cavlc_read_run_befores.v:238$1525 ($mux).
Removed top 1 bits (of 3) from port A of cell cavlc.$flatten\cavlc_read_run_befores.$verific$sub_19$cavlc_read_run_befores.v:196$1512 ($sub).
Removed top 1 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$sub_19$cavlc_read_run_befores.v:196$1512 ($sub).
Removed top 1 bits (of 4) from port A of cell cavlc.$flatten\cavlc_read_run_befores.$verific$sub_58$cavlc_read_run_befores.v:242$1527 ($sub).
Removed top 1 bits (of 4) from port B of cell cavlc.$flatten\cavlc_read_run_befores.$verific$sub_58$cavlc_read_run_befores.v:242$1527 ($sub).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4647 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4656 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4665 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4674 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4683 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4692 ($ne).
Removed top 2 bits (of 4) from port B of cell cavlc.$auto$opt_dff.cc:195:make_patterns_logic$4701 ($ne).
Removed top 1 bits (of 5) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$LessThan_59$cavlc_read_levels.v:177$1028 ($lt).
Removed top 7 bits (of 9) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$LessThan_66$cavlc_read_levels.v:181$1034 ($lt).
Removed top 2 bits (of 3) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$LessThan_85$cavlc_read_levels.v:194$1051 ($lt).
Removed top 23 bits (of 32) from port B of cell cavlc.$flatten\cavlc_read_levels.$verific$add_105$cavlc_read_levels.v:211$1067 ($add).
Removed top 28 bits (of 32) from port B of cell cavlc.$flatten\cavlc_read_levels.$verific$add_110$cavlc_read_levels.v:212$1069 ($add).
Removed top 23 bits (of 32) from port Y of cell cavlc.$flatten\cavlc_read_levels.$verific$add_110$cavlc_read_levels.v:212$1069 ($add).
Removed top 23 bits (of 32) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$add_110$cavlc_read_levels.v:212$1069 ($add).
Removed top 7 bits (of 9) from port B of cell cavlc.$flatten\cavlc_read_levels.$verific$add_119$cavlc_read_levels.v:226$1076 ($add).
Removed top 8 bits (of 9) from port B of cell cavlc.$flatten\cavlc_read_levels.$verific$add_120$cavlc_read_levels.v:226$1078 ($add).
Removed top 3 bits (of 4) from port B of cell cavlc.$flatten\cavlc_read_levels.$verific$add_389$cavlc_read_levels.v:388$1214 ($add).
Removed top 2 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_levels.$verific$add_76$cavlc_read_levels.v:186$1042 ($add).
Removed top 28 bits (of 32) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$equal_52$cavlc_read_levels.v:171$1025 ($eq).
Removed top 23 bits (of 32) from mux cell cavlc.$flatten\cavlc_read_levels.$verific$mux_158$cavlc_read_levels.v:259$1093 ($mux).
Removed top 23 bits (of 32) from mux cell cavlc.$flatten\cavlc_read_levels.$verific$mux_162$cavlc_read_levels.v:263$1096 ($mux).
Removed top 23 bits (of 32) from mux cell cavlc.$flatten\cavlc_read_levels.$verific$mux_171$cavlc_read_levels.v:270$1102 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_levels.$verific$mux_403$cavlc_read_levels.v:396$1223 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_levels.$verific$mux_404$cavlc_read_levels.v:396$1224 ($mux).
Removed top 1 bits (of 5) from mux cell cavlc.$flatten\cavlc_read_levels.$verific$mux_405$cavlc_read_levels.v:396$1225 ($mux).
Removed top 28 bits (of 32) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$shift_left_104$cavlc_read_levels.v:211$1066 ($shl).
Removed top 7 bits (of 9) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$shift_left_72$cavlc_read_levels.v:185$1038 ($shl).
Removed top 30 bits (of 32) from port B of cell cavlc.$flatten\cavlc_read_levels.$verific$sub_123$cavlc_read_levels.v:229$1080 ($sub).
Removed top 31 bits (of 32) from port B of cell cavlc.$flatten\cavlc_read_levels.$verific$sub_124$cavlc_read_levels.v:229$1081 ($sub).
Removed top 22 bits (of 32) from port Y of cell cavlc.$flatten\cavlc_read_levels.$verific$sub_124$cavlc_read_levels.v:229$1081 ($sub).
Removed top 22 bits (of 32) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$sub_124$cavlc_read_levels.v:229$1081 ($sub).
Removed top 1 bits (of 6) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$sub_50$cavlc_read_levels.v:171$1023 ($sub).
Removed top 4 bits (of 6) from port B of cell cavlc.$flatten\cavlc_read_levels.$verific$sub_50$cavlc_read_levels.v:171$1023 ($sub).
Removed top 31 bits (of 32) from port B of cell cavlc.$flatten\cavlc_read_levels.$verific$sub_51$cavlc_read_levels.v:171$1024 ($sub).
Removed top 2 bits (of 3) from port B of cell cavlc.$flatten\cavlc_read_levels.$verific$sub_71$cavlc_read_levels.v:185$1037 ($sub).
Removed top 23 bits (of 32) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$unary_minus_122$cavlc_read_levels.v:229$1079 ($neg).
Removed top 1 bits (of 2) from port A of cell cavlc.$flatten\cavlc_fsm.$verific$LessThan_16$cavlc_fsm.v:106$682 ($lt).
Removed top 4 bits (of 5) from port A of cell cavlc.$flatten\cavlc_fsm.$verific$LessThan_17$cavlc_fsm.v:106$683 ($lt).
Removed top 3 bits (of 5) from port A of cell cavlc.$flatten\cavlc_fsm.$verific$equal_28$cavlc_fsm.v:116$692 ($eq).
Removed top 7 bits (of 8) from port B of cell cavlc.$flatten\cavlc_fsm.$verific$equal_66$cavlc_fsm.v:95$719 ($eq).
Removed top 6 bits (of 8) from port B of cell cavlc.$flatten\cavlc_fsm.$verific$equal_67$cavlc_fsm.v:104$720 ($eq).
Removed top 5 bits (of 8) from port B of cell cavlc.$flatten\cavlc_fsm.$verific$equal_68$cavlc_fsm.v:115$721 ($eq).
Removed top 4 bits (of 8) from port B of cell cavlc.$flatten\cavlc_fsm.$verific$equal_69$cavlc_fsm.v:123$722 ($eq).
Removed top 3 bits (of 8) from port B of cell cavlc.$flatten\cavlc_fsm.$verific$equal_70$cavlc_fsm.v:126$723 ($eq).
Removed top 2 bits (of 8) from port B of cell cavlc.$flatten\cavlc_fsm.$verific$equal_71$cavlc_fsm.v:129$724 ($eq).
Removed top 1 bits (of 8) from port B of cell cavlc.$flatten\cavlc_fsm.$verific$equal_72$cavlc_fsm.v:141$725 ($eq).
Removed top 6 bits (of 8) from mux cell cavlc.$flatten\cavlc_fsm.$verific$mux_12$cavlc_fsm.v:102$677 ($mux).
Removed top 4 bits (of 8) from mux cell cavlc.$flatten\cavlc_fsm.$verific$mux_24$cavlc_fsm.v:113$688 ($mux).
Removed top 4 bits (of 8) from mux cell cavlc.$flatten\cavlc_fsm.$verific$mux_26$cavlc_fsm.v:113$690 ($mux).
Removed top 1 bits (of 8) from mux cell cavlc.$flatten\cavlc_fsm.$verific$mux_33$cavlc_fsm.v:121$696 ($mux).
Removed top 1 bits (of 6) from port A of cell cavlc.$flatten\cavlc_fsm.$verific$sub_14$cavlc_fsm.v:105$679 ($sub).
Removed top 5 bits (of 6) from port B of cell cavlc.$flatten\cavlc_fsm.$verific$sub_14$cavlc_fsm.v:105$679 ($sub).
Removed top 2 bits (of 6) from port Y of cell cavlc.$flatten\cavlc_fsm.$verific$sub_14$cavlc_fsm.v:105$679 ($sub).
Removed top 1 bits (of 5) from port A of cell cavlc.$flatten\cavlc_fsm.$verific$sub_14$cavlc_fsm.v:105$679 ($sub).
Removed top 2 bits (of 4) from port B of cell cavlc.$flatten\cavlc_fsm.$verific$sub_31$cavlc_fsm.v:120$694 ($sub).
Removed top 1 bits (of 6) from port A of cell cavlc.$flatten\cavlc_fsm.$verific$sub_43$cavlc_fsm.v:134$703 ($sub).
Removed top 5 bits (of 6) from port B of cell cavlc.$flatten\cavlc_fsm.$verific$sub_43$cavlc_fsm.v:134$703 ($sub).
Removed top 2 bits (of 6) from port Y of cell cavlc.$flatten\cavlc_fsm.$verific$sub_43$cavlc_fsm.v:134$703 ($sub).
Removed top 1 bits (of 5) from port A of cell cavlc.$flatten\cavlc_fsm.$verific$sub_43$cavlc_fsm.v:134$703 ($sub).
Removed top 1 bits (of 5) from port A of cell cavlc.$flatten\cavlc_fsm.$verific$sub_46$cavlc_fsm.v:138$706 ($sub).
Removed top 4 bits (of 5) from port B of cell cavlc.$flatten\cavlc_fsm.$verific$sub_46$cavlc_fsm.v:138$706 ($sub).
Removed top 1 bits (of 5) from port Y of cell cavlc.$flatten\cavlc_fsm.$verific$sub_46$cavlc_fsm.v:138$706 ($sub).
Removed top 23 bits (of 32) from port Y of cell cavlc.$flatten\cavlc_read_levels.$verific$add_105$cavlc_read_levels.v:211$1067 ($add).
Removed top 23 bits (of 32) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$add_105$cavlc_read_levels.v:211$1067 ($add).
Removed top 22 bits (of 32) from port Y of cell cavlc.$flatten\cavlc_read_levels.$verific$sub_123$cavlc_read_levels.v:229$1080 ($sub).
Removed top 22 bits (of 32) from port A of cell cavlc.$flatten\cavlc_read_levels.$verific$sub_123$cavlc_read_levels.v:229$1080 ($sub).
Removed top 23 bits (of 32) from port Y of cell cavlc.$flatten\cavlc_read_levels.$verific$shift_left_104$cavlc_read_levels.v:211$1066 ($shl).
Removed top 22 bits (of 32) from port Y of cell cavlc.$flatten\cavlc_read_levels.$verific$unary_minus_122$cavlc_read_levels.v:229$1079 ($neg).
Removed top 4 bits (of 8) from wire cavlc.$flatten\cavlc_fsm.$verific$n105$639.
Removed top 1 bits (of 8) from wire cavlc.$flatten\cavlc_fsm.$verific$n144$644.
Removed top 2 bits (of 6) from wire cavlc.$flatten\cavlc_fsm.$verific$n198$650.
Removed top 1 bits (of 5) from wire cavlc.$flatten\cavlc_fsm.$verific$n219$653.
Removed top 6 bits (of 8) from wire cavlc.$flatten\cavlc_fsm.$verific$n41$632.
Removed top 2 bits (of 6) from wire cavlc.$flatten\cavlc_fsm.$verific$n51$633.
Removed top 4 bits (of 8) from wire cavlc.$flatten\cavlc_fsm.$verific$n95$638.
Removed top 23 bits (of 32) from wire cavlc.$flatten\cavlc_read_levels.$verific$n1004$867.
Removed top 23 bits (of 32) from wire cavlc.$flatten\cavlc_read_levels.$verific$n1090$869.
Removed top 23 bits (of 32) from wire cavlc.$flatten\cavlc_read_levels.$verific$n1240$873.
Removed top 1 bits (of 5) from wire cavlc.$flatten\cavlc_read_levels.$verific$n4254$974.
Removed top 1 bits (of 5) from wire cavlc.$flatten\cavlc_read_levels.$verific$n4260$975.
Removed top 1 bits (of 5) from wire cavlc.$flatten\cavlc_read_levels.$verific$n4266$976.
Removed top 23 bits (of 32) from wire cavlc.$flatten\cavlc_read_levels.$verific$n475$851.
Removed top 23 bits (of 32) from wire cavlc.$flatten\cavlc_read_levels.$verific$n509$852.
Removed top 23 bits (of 32) from wire cavlc.$flatten\cavlc_read_levels.$verific$n551$853.
Removed top 22 bits (of 32) from wire cavlc.$flatten\cavlc_read_levels.$verific$n656$859.
Removed top 22 bits (of 32) from wire cavlc.$flatten\cavlc_read_levels.$verific$n689$860.
Removed top 22 bits (of 32) from wire cavlc.$flatten\cavlc_read_levels.$verific$n722$861.
Removed top 6 bits (of 16) from wire cavlc.$flatten\cavlc_read_run_befores.$auto$bmuxmap.cc:58:execute$3932.
Removed top 2 bits (of 8) from wire cavlc.$flatten\cavlc_read_run_befores.$auto$bmuxmap.cc:58:execute$3937.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_run_befores.$auto$bmuxmap.cc:58:execute$3940.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_run_befores.$verific$n109$1324.
Removed top 3 bits (of 4) from wire cavlc.$flatten\cavlc_read_run_befores.$verific$n124$1327.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_run_befores.$verific$n233$1346.
Removed top 3 bits (of 4) from wire cavlc.$flatten\cavlc_read_run_befores.$verific$n238$1347.
Removed top 2 bits (of 4) from wire cavlc.$flatten\cavlc_read_run_befores.$verific$n56$1315.
Removed top 2 bits (of 4) from wire cavlc.$flatten\cavlc_read_run_befores.$verific$n71$1318.
Removed top 5 bits (of 10) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3783.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3788.
Removed top 4 bits (of 20) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3793.
Removed top 2 bits (of 10) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3798.
Removed top 2 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3801.
Removed top 1 bits (of 8) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3803.
Removed top 4 bits (of 20) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3813.
Removed top 3 bits (of 10) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3818.
Removed top 1 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3841.
Removed top 1 bits (of 8) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3843.
Removed top 2 bits (of 20) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3853.
Removed top 1 bits (of 10) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3858.
Removed top 4 bits (of 20) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3873.
Removed top 1 bits (of 8) from wire cavlc.$flatten\cavlc_read_total_coeffs.$auto$bmuxmap.cc:58:execute$3903.
Removed top 2 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n1354$2122.
Removed top 4 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n3631$2406.
Removed top 4 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n3646$2409.
Removed top 4 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n3661$2412.
Removed top 4 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n3676$2415.
Removed top 3 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n3691$2418.
Removed top 3 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n3706$2421.
Removed top 3 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n3712$2422.
Removed top 4 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n4000$2458.
Removed top 4 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n4009$2460.
Removed top 3 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n4018$2462.
Removed top 2 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n4052$2467.
Removed top 1 bits (of 2) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n521$2003.
Removed top 3 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n524$2004.
Removed top 3 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n539$2007.
Removed top 3 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n545$2008.
Removed top 1 bits (of 2) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n598$2017.
Removed top 2 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n601$2018.
Removed top 1 bits (of 2) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n613$2020.
Removed top 2 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n616$2021.
Removed top 4 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n622$2022.
Removed top 1 bits (of 2) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n673$2029.
Removed top 3 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n676$2030.
Removed top 1 bits (of 2) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n745$2038.
Removed top 3 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n748$2039.
Removed top 3 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n757$2041.
Removed top 2 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n766$2043.
Removed top 1 bits (of 2) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n817$2047.
Removed top 1 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n820$2048.
Removed top 1 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n829$2050.
Removed top 1 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n838$2052.
Removed top 1 bits (of 2) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n889$2056.
Removed top 1 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n892$2057.
Removed top 1 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n901$2059.
Removed top 1 bits (of 5) from wire cavlc.$flatten\cavlc_read_total_coeffs.$verific$n910$2061.
Removed top 1 bits (of 8) from wire cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:58:execute$3700.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:58:execute$3703.
Removed top 2 bits (of 8) from wire cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:58:execute$3730.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:58:execute$3733.
Removed top 3 bits (of 8) from wire cavlc.$flatten\cavlc_read_total_zeros.$auto$bmuxmap.cc:58:execute$3740.
Removed top 2 bits (of 3) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1246$3370.
Removed top 3 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1356$3390.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1375$3394.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1549$3419.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1568$3421.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1637$3431.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1665$3437.
Removed top 3 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1818$3461.
Removed top 2 bits (of 3) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1832$3464.
Removed top 3 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1872$3473.
Removed top 3 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1904$3480.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n1978$3492.
Removed top 1 bits (of 2) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n223$3207.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n316$3230.
Removed top 2 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n336$3234.
Removed top 2 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n376$3242.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n396$3246.
Removed top 2 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n416$3250.
Removed top 2 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n526$3261.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n536$3263.
Removed top 2 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n576$3267.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n625$3274.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n690$3285.
Removed top 1 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n695$3286.
Removed top 3 bits (of 4) from wire cavlc.$flatten\cavlc_read_total_zeros.$verific$n875$3311.

yosys> peepopt

3.57. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 0 unused cells and 116 unused wires.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.59. Executing BMUXMAP pass.

yosys> demuxmap

3.60. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.61. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module cavlc:
  creating $macc model for $flatten\cavlc_fsm.$verific$sub_14$cavlc_fsm.v:105$679 ($sub).
  creating $macc model for $flatten\cavlc_fsm.$verific$sub_31$cavlc_fsm.v:120$694 ($sub).
  creating $macc model for $flatten\cavlc_fsm.$verific$sub_43$cavlc_fsm.v:134$703 ($sub).
  creating $macc model for $flatten\cavlc_fsm.$verific$sub_46$cavlc_fsm.v:138$706 ($sub).
  creating $macc model for $flatten\cavlc_read_levels.$verific$add_105$cavlc_read_levels.v:211$1067 ($add).
  creating $macc model for $flatten\cavlc_read_levels.$verific$add_110$cavlc_read_levels.v:212$1069 ($add).
  creating $macc model for $flatten\cavlc_read_levels.$verific$add_119$cavlc_read_levels.v:226$1076 ($add).
  creating $macc model for $flatten\cavlc_read_levels.$verific$add_120$cavlc_read_levels.v:226$1078 ($add).
  creating $macc model for $flatten\cavlc_read_levels.$verific$add_389$cavlc_read_levels.v:388$1214 ($add).
  creating $macc model for $flatten\cavlc_read_levels.$verific$add_76$cavlc_read_levels.v:186$1042 ($add).
  creating $macc model for $flatten\cavlc_read_levels.$verific$sub_123$cavlc_read_levels.v:229$1080 ($sub).
  creating $macc model for $flatten\cavlc_read_levels.$verific$sub_124$cavlc_read_levels.v:229$1081 ($sub).
  creating $macc model for $flatten\cavlc_read_levels.$verific$sub_50$cavlc_read_levels.v:171$1023 ($sub).
  creating $macc model for $flatten\cavlc_read_levels.$verific$sub_51$cavlc_read_levels.v:171$1024 ($sub).
  creating $macc model for $flatten\cavlc_read_levels.$verific$sub_71$cavlc_read_levels.v:185$1037 ($sub).
  creating $macc model for $flatten\cavlc_read_levels.$verific$sub_88$cavlc_read_levels.v:195$1054 ($sub).
  creating $macc model for $flatten\cavlc_read_levels.$verific$unary_minus_122$cavlc_read_levels.v:229$1079 ($neg).
  creating $macc model for $flatten\cavlc_read_levels.$verific$unary_minus_133$cavlc_read_levels.v:244$1087 ($neg).
  creating $macc model for $flatten\cavlc_read_run_befores.$verific$add_205$cavlc_read_run_befores.v:331$1591 ($add).
  creating $macc model for $flatten\cavlc_read_run_befores.$verific$sub_140$cavlc_read_run_befores.v:286$1578 ($sub).
  creating $macc model for $flatten\cavlc_read_run_befores.$verific$sub_19$cavlc_read_run_befores.v:196$1512 ($sub).
  creating $macc model for $flatten\cavlc_read_run_befores.$verific$sub_58$cavlc_read_run_befores.v:242$1527 ($sub).
  creating $macc model for $flatten\cavlc_read_total_coeffs.$verific$add_967$cavlc_read_total_coeffs.v:1066$3054 ($add).
  merging $macc model for $flatten\cavlc_read_levels.$verific$sub_123$cavlc_read_levels.v:229$1080 into $flatten\cavlc_read_levels.$verific$sub_124$cavlc_read_levels.v:229$1081.
  merging $macc model for $flatten\cavlc_read_levels.$verific$unary_minus_122$cavlc_read_levels.v:229$1079 into $flatten\cavlc_read_levels.$verific$sub_124$cavlc_read_levels.v:229$1081.
  merging $macc model for $flatten\cavlc_read_levels.$verific$add_105$cavlc_read_levels.v:211$1067 into $flatten\cavlc_read_levels.$verific$add_110$cavlc_read_levels.v:212$1069.
  creating $alu model for $macc $flatten\cavlc_read_run_befores.$verific$sub_140$cavlc_read_run_befores.v:286$1578.
  creating $alu model for $macc $flatten\cavlc_read_run_befores.$verific$add_205$cavlc_read_run_befores.v:331$1591.
  creating $alu model for $macc $flatten\cavlc_read_levels.$verific$unary_minus_133$cavlc_read_levels.v:244$1087.
  creating $alu model for $macc $flatten\cavlc_read_run_befores.$verific$sub_58$cavlc_read_run_befores.v:242$1527.
  creating $alu model for $macc $flatten\cavlc_read_levels.$verific$sub_88$cavlc_read_levels.v:195$1054.
  creating $alu model for $macc $flatten\cavlc_read_levels.$verific$sub_71$cavlc_read_levels.v:185$1037.
  creating $alu model for $macc $flatten\cavlc_read_levels.$verific$sub_51$cavlc_read_levels.v:171$1024.
  creating $alu model for $macc $flatten\cavlc_read_levels.$verific$sub_50$cavlc_read_levels.v:171$1023.
  creating $alu model for $macc $flatten\cavlc_read_run_befores.$verific$sub_19$cavlc_read_run_befores.v:196$1512.
  creating $alu model for $macc $flatten\cavlc_read_levels.$verific$add_76$cavlc_read_levels.v:186$1042.
  creating $alu model for $macc $flatten\cavlc_read_levels.$verific$add_389$cavlc_read_levels.v:388$1214.
  creating $alu model for $macc $flatten\cavlc_read_levels.$verific$add_120$cavlc_read_levels.v:226$1078.
  creating $alu model for $macc $flatten\cavlc_read_levels.$verific$add_119$cavlc_read_levels.v:226$1076.
  creating $alu model for $macc $flatten\cavlc_read_total_coeffs.$verific$add_967$cavlc_read_total_coeffs.v:1066$3054.
  creating $alu model for $macc $flatten\cavlc_fsm.$verific$sub_46$cavlc_fsm.v:138$706.
  creating $alu model for $macc $flatten\cavlc_fsm.$verific$sub_43$cavlc_fsm.v:134$703.
  creating $alu model for $macc $flatten\cavlc_fsm.$verific$sub_31$cavlc_fsm.v:120$694.
  creating $alu model for $macc $flatten\cavlc_fsm.$verific$sub_14$cavlc_fsm.v:105$679.
  creating $macc cell for $flatten\cavlc_read_levels.$verific$add_110$cavlc_read_levels.v:212$1069: $auto$alumacc.cc:365:replace_macc$5308
  creating $macc cell for $flatten\cavlc_read_levels.$verific$sub_124$cavlc_read_levels.v:229$1081: $auto$alumacc.cc:365:replace_macc$5309
  creating $alu model for $flatten\cavlc_fsm.$verific$LessThan_16$cavlc_fsm.v:106$682 ($lt): new $alu
  creating $alu model for $flatten\cavlc_fsm.$verific$LessThan_17$cavlc_fsm.v:106$683 ($lt): new $alu
  creating $alu model for $flatten\cavlc_fsm.$verific$LessThan_38$cavlc_fsm.v:130$700 ($lt): new $alu
  creating $alu model for $flatten\cavlc_read_levels.$verific$LessThan_59$cavlc_read_levels.v:177$1028 ($lt): new $alu
  creating $alu model for $flatten\cavlc_read_levels.$verific$LessThan_60$cavlc_read_levels.v:177$1029 ($lt): new $alu
  creating $alu model for $flatten\cavlc_read_levels.$verific$LessThan_66$cavlc_read_levels.v:181$1034 ($lt): new $alu
  creating $alu model for $flatten\cavlc_read_levels.$verific$LessThan_73$cavlc_read_levels.v:185$1039 ($lt): new $alu
  creating $alu model for $flatten\cavlc_read_levels.$verific$LessThan_74$cavlc_read_levels.v:185$1040 ($lt): new $alu
  creating $alu model for $flatten\cavlc_read_levels.$verific$LessThan_85$cavlc_read_levels.v:194$1051 ($lt): new $alu
  creating $alu model for $flatten\cavlc_read_levels.$verific$LessThan_86$cavlc_read_levels.v:194$1052 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_127$cavlc_read_run_befores.v:269$1572 ($lt): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_203$cavlc_read_run_befores.v:330$1589 ($lt): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_253$cavlc_read_run_befores.v:351$1626 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_256$cavlc_read_run_befores.v:352$1629 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_259$cavlc_read_run_befores.v:353$1632 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_262$cavlc_read_run_befores.v:354$1635 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_265$cavlc_read_run_befores.v:355$1638 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_268$cavlc_read_run_befores.v:356$1641 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_271$cavlc_read_run_befores.v:357$1644 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_274$cavlc_read_run_befores.v:358$1647 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_277$cavlc_read_run_befores.v:359$1650 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_280$cavlc_read_run_befores.v:360$1653 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_283$cavlc_read_run_befores.v:361$1656 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_286$cavlc_read_run_befores.v:362$1659 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_289$cavlc_read_run_befores.v:363$1662 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$LessThan_292$cavlc_read_run_befores.v:364$1665 ($le): new $alu
  creating $alu model for $flatten\cavlc_read_levels.$verific$equal_170$cavlc_read_levels.v:269$1101 ($eq): merged with $flatten\cavlc_read_levels.$verific$LessThan_60$cavlc_read_levels.v:177$1029.
  creating $alu model for $flatten\cavlc_read_levels.$verific$equal_91$cavlc_read_levels.v:196$1057 ($eq): merged with $flatten\cavlc_read_levels.$verific$LessThan_86$cavlc_read_levels.v:194$1052.
  creating $alu model for $flatten\cavlc_read_run_befores.$verific$equal_44$cavlc_read_run_befores.v:224$1519 ($eq): merged with $flatten\cavlc_read_run_befores.$verific$sub_19$cavlc_read_run_befores.v:196$1512.
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_292$cavlc_read_run_befores.v:364$1665: $auto$alumacc.cc:485:replace_alu$5336
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_289$cavlc_read_run_befores.v:363$1662: $auto$alumacc.cc:485:replace_alu$5349
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_286$cavlc_read_run_befores.v:362$1659: $auto$alumacc.cc:485:replace_alu$5362
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_283$cavlc_read_run_befores.v:361$1656: $auto$alumacc.cc:485:replace_alu$5375
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_280$cavlc_read_run_befores.v:360$1653: $auto$alumacc.cc:485:replace_alu$5388
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_277$cavlc_read_run_befores.v:359$1650: $auto$alumacc.cc:485:replace_alu$5401
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_274$cavlc_read_run_befores.v:358$1647: $auto$alumacc.cc:485:replace_alu$5414
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_271$cavlc_read_run_befores.v:357$1644: $auto$alumacc.cc:485:replace_alu$5427
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_268$cavlc_read_run_befores.v:356$1641: $auto$alumacc.cc:485:replace_alu$5436
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_265$cavlc_read_run_befores.v:355$1638: $auto$alumacc.cc:485:replace_alu$5445
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_262$cavlc_read_run_befores.v:354$1635: $auto$alumacc.cc:485:replace_alu$5454
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_259$cavlc_read_run_befores.v:353$1632: $auto$alumacc.cc:485:replace_alu$5463
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_256$cavlc_read_run_befores.v:352$1629: $auto$alumacc.cc:485:replace_alu$5472
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_253$cavlc_read_run_befores.v:351$1626: $auto$alumacc.cc:485:replace_alu$5481
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_203$cavlc_read_run_befores.v:330$1589: $auto$alumacc.cc:485:replace_alu$5490
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$LessThan_127$cavlc_read_run_befores.v:269$1572: $auto$alumacc.cc:485:replace_alu$5495
  creating $alu cell for $flatten\cavlc_read_levels.$verific$LessThan_86$cavlc_read_levels.v:194$1052, $flatten\cavlc_read_levels.$verific$equal_91$cavlc_read_levels.v:196$1057: $auto$alumacc.cc:485:replace_alu$5500
  creating $alu cell for $flatten\cavlc_read_levels.$verific$LessThan_85$cavlc_read_levels.v:194$1051: $auto$alumacc.cc:485:replace_alu$5509
  creating $alu cell for $flatten\cavlc_read_levels.$verific$LessThan_74$cavlc_read_levels.v:185$1040: $auto$alumacc.cc:485:replace_alu$5514
  creating $alu cell for $flatten\cavlc_read_levels.$verific$LessThan_73$cavlc_read_levels.v:185$1039: $auto$alumacc.cc:485:replace_alu$5519
  creating $alu cell for $flatten\cavlc_read_levels.$verific$LessThan_66$cavlc_read_levels.v:181$1034: $auto$alumacc.cc:485:replace_alu$5530
  creating $alu cell for $flatten\cavlc_read_levels.$verific$LessThan_60$cavlc_read_levels.v:177$1029, $flatten\cavlc_read_levels.$verific$equal_170$cavlc_read_levels.v:269$1101: $auto$alumacc.cc:485:replace_alu$5535
  creating $alu cell for $flatten\cavlc_read_levels.$verific$LessThan_59$cavlc_read_levels.v:177$1028: $auto$alumacc.cc:485:replace_alu$5546
  creating $alu cell for $flatten\cavlc_fsm.$verific$LessThan_38$cavlc_fsm.v:130$700: $auto$alumacc.cc:485:replace_alu$5551
  creating $alu cell for $flatten\cavlc_fsm.$verific$LessThan_17$cavlc_fsm.v:106$683: $auto$alumacc.cc:485:replace_alu$5556
  creating $alu cell for $flatten\cavlc_fsm.$verific$LessThan_16$cavlc_fsm.v:106$682: $auto$alumacc.cc:485:replace_alu$5561
  creating $alu cell for $flatten\cavlc_fsm.$verific$sub_14$cavlc_fsm.v:105$679: $auto$alumacc.cc:485:replace_alu$5566
  creating $alu cell for $flatten\cavlc_fsm.$verific$sub_31$cavlc_fsm.v:120$694: $auto$alumacc.cc:485:replace_alu$5569
  creating $alu cell for $flatten\cavlc_fsm.$verific$sub_43$cavlc_fsm.v:134$703: $auto$alumacc.cc:485:replace_alu$5572
  creating $alu cell for $flatten\cavlc_fsm.$verific$sub_46$cavlc_fsm.v:138$706: $auto$alumacc.cc:485:replace_alu$5575
  creating $alu cell for $flatten\cavlc_read_total_coeffs.$verific$add_967$cavlc_read_total_coeffs.v:1066$3054: $auto$alumacc.cc:485:replace_alu$5578
  creating $alu cell for $flatten\cavlc_read_levels.$verific$add_119$cavlc_read_levels.v:226$1076: $auto$alumacc.cc:485:replace_alu$5581
  creating $alu cell for $flatten\cavlc_read_levels.$verific$add_120$cavlc_read_levels.v:226$1078: $auto$alumacc.cc:485:replace_alu$5584
  creating $alu cell for $flatten\cavlc_read_levels.$verific$add_389$cavlc_read_levels.v:388$1214: $auto$alumacc.cc:485:replace_alu$5587
  creating $alu cell for $flatten\cavlc_read_levels.$verific$add_76$cavlc_read_levels.v:186$1042: $auto$alumacc.cc:485:replace_alu$5590
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$sub_19$cavlc_read_run_befores.v:196$1512, $flatten\cavlc_read_run_befores.$verific$equal_44$cavlc_read_run_befores.v:224$1519: $auto$alumacc.cc:485:replace_alu$5593
  creating $alu cell for $flatten\cavlc_read_levels.$verific$sub_50$cavlc_read_levels.v:171$1023: $auto$alumacc.cc:485:replace_alu$5598
  creating $alu cell for $flatten\cavlc_read_levels.$verific$sub_51$cavlc_read_levels.v:171$1024: $auto$alumacc.cc:485:replace_alu$5601
  creating $alu cell for $flatten\cavlc_read_levels.$verific$sub_71$cavlc_read_levels.v:185$1037: $auto$alumacc.cc:485:replace_alu$5604
  creating $alu cell for $flatten\cavlc_read_levels.$verific$sub_88$cavlc_read_levels.v:195$1054: $auto$alumacc.cc:485:replace_alu$5607
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$sub_58$cavlc_read_run_befores.v:242$1527: $auto$alumacc.cc:485:replace_alu$5610
  creating $alu cell for $flatten\cavlc_read_levels.$verific$unary_minus_133$cavlc_read_levels.v:244$1087: $auto$alumacc.cc:485:replace_alu$5613
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$add_205$cavlc_read_run_befores.v:331$1591: $auto$alumacc.cc:485:replace_alu$5616
  creating $alu cell for $flatten\cavlc_read_run_befores.$verific$sub_140$cavlc_read_run_befores.v:286$1578: $auto$alumacc.cc:485:replace_alu$5619
  created 44 $alu and 2 $macc cells.

yosys> opt_expr

3.62. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.63. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.64. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~111 debug messages>

yosys> opt_reduce

3.65. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.66. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
<suppressed ~81 debug messages>
Removed a total of 27 cells.

yosys> opt_share

3.67. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.68. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.69. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 4 unused cells and 43 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.70. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.

yosys> opt_muxtree

3.71. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~119 debug messages>

yosys> opt_reduce

3.72. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_share

3.74. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.75. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.76. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..

yosys> opt_expr

3.77. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
MAX OPT ITERATION = 2

yosys> stat

3.78. Printing statistics.

=== cavlc ===

   Number of wires:               1578
   Number of wire bits:           6938
   Number of public wires:         207
   Number of public wire bits:    1260
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1399
     $adffe                         47
     $alu                           44
     $and                           86
     $eq                           123
     $logic_not                     10
     $macc                           2
     $mux                          624
     $ne                           125
     $not                          109
     $or                            69
     $pmux                          47
     $reduce_and                    58
     $reduce_bool                    6
     $reduce_or                     46
     $shl                            2
     $shr                            1


yosys> memory -nomap

3.79. Executing MEMORY pass.

yosys> opt_mem

3.79.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.79.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.79.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.79.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.79.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.79.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..

yosys> memory_share

3.79.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.79.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.79.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..

yosys> memory_collect

3.79.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.80. Printing statistics.

=== cavlc ===

   Number of wires:               1578
   Number of wire bits:           6938
   Number of public wires:         207
   Number of public wire bits:    1260
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1399
     $adffe                         47
     $alu                           44
     $and                           86
     $eq                           123
     $logic_not                     10
     $macc                           2
     $mux                          624
     $ne                           125
     $not                          109
     $or                            69
     $pmux                          47
     $reduce_and                    58
     $reduce_bool                    6
     $reduce_or                     46
     $shl                            2
     $shr                            1


yosys> muxpack

3.81. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_100$cavlc_read_total_coeffs.v:221$2582 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_102$cavlc_read_total_coeffs.v:221$2584 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_117$cavlc_read_total_coeffs.v:240$2591 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_119$cavlc_read_total_coeffs.v:240$2593 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_135$cavlc_read_total_coeffs.v:259$2601 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_137$cavlc_read_total_coeffs.v:259$2603 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_153$cavlc_read_total_coeffs.v:278$2611 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_155$cavlc_read_total_coeffs.v:278$2613 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_185$cavlc_read_total_coeffs.v:313$2631 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_193$cavlc_read_total_coeffs.v:313$2639 to a pmux with 5 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_190$cavlc_read_total_coeffs.v:313$2636 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_194$cavlc_read_total_coeffs.v:313$2640 to a pmux with 3 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_225$cavlc_read_total_coeffs.v:348$2658 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_231$cavlc_read_total_coeffs.v:348$2664 to a pmux with 4 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_263$cavlc_read_total_coeffs.v:383$2682 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_269$cavlc_read_total_coeffs.v:383$2688 to a pmux with 4 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_268$cavlc_read_total_coeffs.v:383$2687 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_270$cavlc_read_total_coeffs.v:383$2689 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_299$cavlc_read_total_coeffs.v:418$2705 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_307$cavlc_read_total_coeffs.v:418$2713 to a pmux with 5 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_438$cavlc_read_total_coeffs.v:509$2792 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_441$cavlc_read_total_coeffs.v:509$2795 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_444$cavlc_read_total_coeffs.v:509$2798 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_447$cavlc_read_total_coeffs.v:509$2801 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_445$cavlc_read_total_coeffs.v:509$2799 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_448$cavlc_read_total_coeffs.v:509$2802 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_482$cavlc_read_total_coeffs.v:547$2813 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_484$cavlc_read_total_coeffs.v:547$2815 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_518$cavlc_read_total_coeffs.v:585$2832 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_520$cavlc_read_total_coeffs.v:585$2834 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_549$cavlc_read_total_coeffs.v:620$2846 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_557$cavlc_read_total_coeffs.v:620$2854 to a pmux with 5 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_550$cavlc_read_total_coeffs.v:620$2847 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_558$cavlc_read_total_coeffs.v:620$2855 to a pmux with 5 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_586$cavlc_read_total_coeffs.v:655$2866 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_596$cavlc_read_total_coeffs.v:655$2876 to a pmux with 6 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_626$cavlc_read_total_coeffs.v:690$2890 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_634$cavlc_read_total_coeffs.v:690$2898 to a pmux with 5 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_668$cavlc_read_total_coeffs.v:722$2915 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_671$cavlc_read_total_coeffs.v:722$2918 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_669$cavlc_read_total_coeffs.v:722$2916 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_672$cavlc_read_total_coeffs.v:722$2919 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_688$cavlc_read_total_coeffs.v:741$2925 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_690$cavlc_read_total_coeffs.v:741$2927 to a pmux with 2 cases.
Converting cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_99$cavlc_read_total_coeffs.v:221$2581 ... cavlc.$flatten\cavlc_read_total_coeffs.$verific$mux_101$cavlc_read_total_coeffs.v:221$2583 to a pmux with 2 cases.
Converted 70 (p)mux cells into 23 pmux cells.
<suppressed ~467 debug messages>

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 0 unused cells and 47 unused wires.
<suppressed ~1 debug messages>

yosys> pmuxtree

3.83. Executing PMUXTREE pass.

yosys> muxpack

3.84. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6170 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6172 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6162 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6164 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6154 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6156 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6146 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6148 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6134 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6136 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6098 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6100 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6082 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6084 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6070 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6072 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6062 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6064 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6054 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6056 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6038 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6040 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6026 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6028 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6014 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6016 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6002 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$6004 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5988 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5990 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5962 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5964 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5950 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5952 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5942 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5944 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5934 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5936 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5926 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5928 to a pmux with 2 cases.
Converting cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5650 ... cavlc.$auto$pmuxtree.cc:65:recursive_mux_generator$5652 to a pmux with 2 cases.
Converted 42 (p)mux cells into 21 pmux cells.
<suppressed ~681 debug messages>

yosys> memory_map

3.85. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.86. Printing statistics.

=== cavlc ===

   Number of wires:               2108
   Number of wire bits:           8614
   Number of public wires:         207
   Number of public wire bits:    1260
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1838
     $adffe                         47
     $alu                           44
     $and                           86
     $eq                           123
     $logic_not                     10
     $macc                           2
     $mux                          856
     $ne                           125
     $not                          179
     $or                           115
     $pmux                          21
     $reduce_and                    58
     $reduce_bool                    6
     $reduce_or                    163
     $shl                            2
     $shr                            1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.87. Executing TECHMAP pass (map to technology primitives).

3.87.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.87.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.87.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $ne.
Using template $paramod$521ce43182eecb9f60c72393a788160d2c356bf5\_90_pmux for cells of type $pmux.
Using template $paramod$32e7c4d6f92ff4337599ece53082d2e88a82a9f2\_90_pmux for cells of type $pmux.
Using template $paramod$c5c783b17ab1d780abfad8cfe6563a0a7b47a3b0\_90_pmux for cells of type $pmux.
Using extmapper maccmap for cells of type $macc.
  add $auto$wreduce.cc:455:run$5214 [8:0] (9 bits, unsigned)
  add { $flatten\cavlc_read_levels.$verific$n544$779 $flatten\cavlc_read_levels.$verific$n544$779 $flatten\cavlc_read_levels.$verific$n544$779 $flatten\cavlc_read_levels.$verific$n544$779 } (4 bits, unsigned)
  add \cavlc_read_levels.level_suffix (9 bits, unsigned)
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $adffe.
Using template $paramod$fc16b9f758000d363d24f130038bd99b46b4fa1b\_90_pmux for cells of type $pmux.
Using template $paramod$70d30c21ff772b34d0d1da2801fbd781dc3c70e4\_90_pmux for cells of type $pmux.
Using template $paramod$de9286bb3f6c9573089ef1694e580944d318189a\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_bool.
Using template $paramod$740b056ede97228d3eae64ea2fdc81f0a33e0fe7\_90_alu for cells of type $alu.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using template $paramod$f85408ed1aa3d09e465edae8a7bf590332ae9f7b\_90_alu for cells of type $alu.
Using template $paramod$1a3a0c35c4a4896fbfd612699525c057298e72d2\_90_alu for cells of type $alu.
Using template $paramod$e23c72610957bd76b0654139c354e282891d4e8f\_90_alu for cells of type $alu.
Using template $paramod$8045f2881226ae434b154710c783ad25023f386c\_90_alu for cells of type $alu.
Using template $paramod$b18e16801adf491a64caa0542270798e5d4ac6b6\_90_alu for cells of type $alu.
Using template $paramod$7e708ae28ab761f11d0fb59d3ffc72f6a4baf5d9\_90_alu for cells of type $alu.
Using template $paramod$5a51f938fa54bf7015d956f06feadaa94e2be5b1\_90_alu for cells of type $alu.
Using template $paramod$b8c0a997bce700f23568a5ada79cc6781d1f5ca0\_90_alu for cells of type $alu.
Using template $paramod$constmap:1e83989bdaaeae429b09a33fcb9a97ba54f64e9f$paramod$fb16e0492dc88ab7064d5e90ab6662c825c4229e\_90_shift_ops_shr_shl_sshl_sshr for cells of type $shl.
Using template $paramod$d2fa05d38998afabc6d4f34471305d0af4b8b2df\_90_alu for cells of type $alu.
Using template $paramod$78e969f2586efcf3a5b0b0440bcca0db83d5cca2\_90_alu for cells of type $alu.
  sub \cavlc_read_levels.level_code_tmp (9 bits, unsigned)
  sub { \cavlc_read_levels.tmp1 [1] 1'0 } (2 bits, unsigned)
  add 10'1111111111 (10 bits, unsigned)
  packed 1 (1) bits / 1 words into adder tree
Using template $paramod$53700bbee849b2010ad0b60a61ccd204a10e24ca\_90_alu for cells of type $alu.
Using template $paramod$943564b9366bbc392bf4bbc801aa0a2d7742a4e0\_90_alu for cells of type $alu.
Using template $paramod$3ef7d3dd227da7627a99c5e5a6a4deb817573e39\_90_alu for cells of type $alu.
Using template $paramod$649fc39eef2451024566705288528c8671211199\_90_alu for cells of type $alu.
Using template $paramod$83dd457849c736323edf2edb15923eb27f99c683\_90_alu for cells of type $alu.
Using template $paramod$constmap:2a5a90c887f7f17a34d4032fe665c7aac02a3bb8$paramod$27be44c49fb1346b96bf9a9013de8943094e1f11\_90_shift_ops_shr_shl_sshl_sshr for cells of type $shl.
Using template $paramod$constmap:3e07689e7ff5356da68de1ee7387179a05a469ef$paramod$b54d5ebdaecd24844fc43a347f4baf80efcdaf00\_90_shift_ops_shr_shl_sshl_sshr for cells of type $shr.
Using template $paramod$c04af8dbf0e5d1d69bbccb2c7bd8a93fc9ef54dc\_90_alu for cells of type $alu.
Using template $paramod$0563fff2c395e9892f21c131fa33d5e0ad144e72\_90_alu for cells of type $alu.
Using template $paramod$b85fbb3374a1d9ba7ee4f4d6323c30f939df3ada\_90_alu for cells of type $alu.
Using template $paramod$8742280fdebca84e1c87f2a86ed84f62d558f4cc\_90_alu for cells of type $alu.
Using template $paramod$175e67c02b86e96b1288b9dc100122520d7240d8\_90_alu for cells of type $alu.
Using template $paramod$672a140277c71df8314410f22acc08d55222c3c7\_90_alu for cells of type $alu.
Using template $paramod$5ccf584370207a3ccc3032757a8e590623d4de56\_90_alu for cells of type $alu.
Using template $paramod\_90_fa\WIDTH=32'00000000000000000000000000001001 for cells of type $fa.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001010 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
Using template $paramod$484d51534650924b7ed4c69e46eed3a56904771f\_90_alu for cells of type $alu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100000 for cells of type $lcu.
No more expansions possible.
<suppressed ~7076 debug messages>

yosys> stat

3.88. Printing statistics.

=== cavlc ===

   Number of wires:               5642
   Number of wire bits:          74011
   Number of public wires:         207
   Number of public wire bits:    1260
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              10262
     $_AND_                       1138
     $_DFFE_PN0P_                  390
     $_DFFE_PN1P_                    1
     $_MUX_                       4619
     $_NOT_                        581
     $_OR_                        1954
     $_XOR_                       1579


yosys> opt_expr

3.89. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
<suppressed ~4012 debug messages>

yosys> opt_merge -nomux

3.90. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
<suppressed ~5865 debug messages>
Removed a total of 1955 cells.

yosys> opt_muxtree

3.91. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.92. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.93. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_share

3.94. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.95. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.96. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 367 unused cells and 4088 unused wires.
<suppressed ~368 debug messages>

yosys> opt_expr

3.97. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
<suppressed ~3 debug messages>

yosys> opt_muxtree

3.98. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.99. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.100. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_share

3.101. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.102. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.103. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..

yosys> opt_expr

3.104. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.105. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
<suppressed ~1356 debug messages>

yosys> techmap -map +/techmap.v

3.106. Executing TECHMAP pass (map to technology primitives).

3.106.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.106.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.107. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.

yosys> opt_merge -nomux

3.108. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
<suppressed ~252 debug messages>
Removed a total of 84 cells.

yosys> opt_muxtree

3.109. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.110. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.111. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.112. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 1 unused cells and 143 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.

yosys> opt_muxtree

3.115. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.116. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.117. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.118. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.119. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..

yosys> opt_expr

3.120. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
MAX OPT ITERATION = 2

yosys> abc -dff

3.121. Executing ABC pass (technology mapping using ABC).

3.121.1. Summary of detected clock domains:
  47 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4607, arst=!\rst_n, srst={ }
  372 cells in clk=\clk, en=\ena, arst=!\rst_n, srst={ }
  313 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$5199, arst=!\rst_n, srst={ }
  68 cells in clk=\clk, en=$flatten\cavlc_read_levels.$verific$n231$761, arst=!\rst_n, srst={ }
  226 cells in clk=\clk, en=$flatten\cavlc_read_levels.$verific$n474$778, arst=!\rst_n, srst={ }
  91 cells in clk=\clk, en=\cavlc_read_levels.level_abs_refresh, arst=!\rst_n, srst={ }
  61 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4817, arst=!\rst_n, srst={ }
  52 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4840, arst=!\rst_n, srst={ }
  57 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4867, arst=!\rst_n, srst={ }
  56 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4894, arst=!\rst_n, srst={ }
  42 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4917, arst=!\rst_n, srst={ }
  41 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4940, arst=!\rst_n, srst={ }
  55 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4965, arst=!\rst_n, srst={ }
  49 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4990, arst=!\rst_n, srst={ }
  39 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$5013, arst=!\rst_n, srst={ }
  72 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$5034, arst=!\rst_n, srst={ }
  52 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$5055, arst=!\rst_n, srst={ }
  45 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$5078, arst=!\rst_n, srst={ }
  42 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$5101, arst=!\rst_n, srst={ }
  47 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$5126, arst=!\rst_n, srst={ }
  59 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$5151, arst=!\rst_n, srst={ }
  33 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$5174, arst=!\rst_n, srst={ }
  31 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$5187, arst=!\rst_n, srst={ }
  39 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4659, arst=!\rst_n, srst={ }
  32 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4668, arst=!\rst_n, srst={ }
  33 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4677, arst=!\rst_n, srst={ }
  31 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4686, arst=!\rst_n, srst={ }
  32 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4695, arst=!\rst_n, srst={ }
  33 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4704, arst=!\rst_n, srst={ }
  33 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4713, arst=!\rst_n, srst={ }
  32 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4722, arst=!\rst_n, srst={ }
  26 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4731, arst=!\rst_n, srst={ }
  32 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4740, arst=!\rst_n, srst={ }
  32 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4749, arst=!\rst_n, srst={ }
  33 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4758, arst=!\rst_n, srst={ }
  33 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4767, arst=!\rst_n, srst={ }
  34 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4776, arst=!\rst_n, srst={ }
  14 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4783, arst=!\rst_n, srst={ }
  151 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$4786, arst=!\rst_n, srst={ }
  188 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4791, arst=!\rst_n, srst={ }
  23 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4612, arst=!\rst_n, srst={ }
  110 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4619, arst=!\rst_n, srst={ }
  111 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4628, arst=!\rst_n, srst={ }
  118 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4639, arst=!\rst_n, srst={ }
  1095 cells in clk=\clk, en=$auto$simplemap.cc:251:simplemap_eqne$10446 [3], arst=!\rst_n, srst={ }
  34 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$4650, arst=!\rst_n, srst={ }

3.121.2. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4607, asynchronously reset by !\rst_n
Extracted 47 gates and 59 wires to a netlist network with 11 inputs and 19 outputs.

3.121.2.1. Executing ABC.

3.121.3. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \ena, asynchronously reset by !\rst_n
Extracted 372 gates and 527 wires to a netlist network with 153 inputs and 74 outputs.

3.121.3.1. Executing ABC.

3.121.4. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$5199, asynchronously reset by !\rst_n
Extracted 313 gates and 505 wires to a netlist network with 191 inputs and 99 outputs.

3.121.4.1. Executing ABC.

3.121.5. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$21701$flatten\cavlc_read_levels.$verific$n231$761, asynchronously reset by !\rst_n
Extracted 68 gates and 87 wires to a netlist network with 17 inputs and 16 outputs.

3.121.5.1. Executing ABC.

3.121.6. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$21701$flatten\cavlc_read_levels.$verific$n474$778, asynchronously reset by !\rst_n
Extracted 226 gates and 266 wires to a netlist network with 38 inputs and 18 outputs.

3.121.6.1. Executing ABC.

3.121.7. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$21701$cavlc_read_levels.level_abs_refresh, asynchronously reset by !\rst_n
Extracted 91 gates and 107 wires to a netlist network with 15 inputs and 25 outputs.

3.121.7.1. Executing ABC.

3.121.8. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4817, asynchronously reset by !\rst_n
Extracted 61 gates and 100 wires to a netlist network with 37 inputs and 41 outputs.

3.121.8.1. Executing ABC.

3.121.9. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4840, asynchronously reset by !\rst_n
Extracted 52 gates and 90 wires to a netlist network with 37 inputs and 32 outputs.

3.121.9.1. Executing ABC.

3.121.10. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4867, asynchronously reset by !\rst_n
Extracted 57 gates and 99 wires to a netlist network with 41 inputs and 28 outputs.

3.121.10.1. Executing ABC.

3.121.11. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4894, asynchronously reset by !\rst_n
Extracted 56 gates and 99 wires to a netlist network with 42 inputs and 26 outputs.

3.121.11.1. Executing ABC.

3.121.12. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4917, asynchronously reset by !\rst_n
Extracted 42 gates and 77 wires to a netlist network with 34 inputs and 22 outputs.

3.121.12.1. Executing ABC.

3.121.13. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4940, asynchronously reset by !\rst_n
Extracted 41 gates and 75 wires to a netlist network with 33 inputs and 21 outputs.

3.121.13.1. Executing ABC.

3.121.14. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4965, asynchronously reset by !\rst_n
Extracted 55 gates and 94 wires to a netlist network with 38 inputs and 32 outputs.

3.121.14.1. Executing ABC.

3.121.15. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4990, asynchronously reset by !\rst_n
Extracted 49 gates and 85 wires to a netlist network with 35 inputs and 30 outputs.

3.121.15.1. Executing ABC.

3.121.16. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$5013, asynchronously reset by !\rst_n
Extracted 39 gates and 71 wires to a netlist network with 31 inputs and 20 outputs.

3.121.16.1. Executing ABC.

3.121.17. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$5034, asynchronously reset by !\rst_n
Extracted 72 gates and 118 wires to a netlist network with 45 inputs and 42 outputs.

3.121.17.1. Executing ABC.

3.121.18. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$5055, asynchronously reset by !\rst_n
Extracted 52 gates and 89 wires to a netlist network with 36 inputs and 26 outputs.

3.121.18.1. Executing ABC.

3.121.19. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$5078, asynchronously reset by !\rst_n
Extracted 45 gates and 82 wires to a netlist network with 36 inputs and 25 outputs.

3.121.19.1. Executing ABC.

3.121.20. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$5101, asynchronously reset by !\rst_n
Extracted 42 gates and 77 wires to a netlist network with 34 inputs and 22 outputs.

3.121.20.1. Executing ABC.

3.121.21. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$5126, asynchronously reset by !\rst_n
Extracted 47 gates and 85 wires to a netlist network with 37 inputs and 26 outputs.

3.121.21.1. Executing ABC.

3.121.22. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$5151, asynchronously reset by !\rst_n
Extracted 59 gates and 106 wires to a netlist network with 46 inputs and 28 outputs.

3.121.22.1. Executing ABC.

3.121.23. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$5174, asynchronously reset by !\rst_n
Extracted 33 gates and 57 wires to a netlist network with 23 inputs and 24 outputs.

3.121.23.1. Executing ABC.

3.121.24. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$5187, asynchronously reset by !\rst_n
Extracted 31 gates and 52 wires to a netlist network with 20 inputs and 9 outputs.

3.121.24.1. Executing ABC.

3.121.25. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4659, asynchronously reset by !\rst_n
Extracted 39 gates and 66 wires to a netlist network with 26 inputs and 13 outputs.

3.121.25.1. Executing ABC.

3.121.26. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4668, asynchronously reset by !\rst_n
Extracted 32 gates and 54 wires to a netlist network with 21 inputs and 11 outputs.

3.121.26.1. Executing ABC.

3.121.27. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4677, asynchronously reset by !\rst_n
Extracted 33 gates and 56 wires to a netlist network with 22 inputs and 10 outputs.

3.121.27.1. Executing ABC.

3.121.28. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4686, asynchronously reset by !\rst_n
Extracted 31 gates and 52 wires to a netlist network with 20 inputs and 10 outputs.

3.121.28.1. Executing ABC.

3.121.29. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4695, asynchronously reset by !\rst_n
Extracted 32 gates and 54 wires to a netlist network with 21 inputs and 10 outputs.

3.121.29.1. Executing ABC.

3.121.30. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4704, asynchronously reset by !\rst_n
Extracted 33 gates and 56 wires to a netlist network with 22 inputs and 12 outputs.

3.121.30.1. Executing ABC.

3.121.31. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4713, asynchronously reset by !\rst_n
Extracted 33 gates and 55 wires to a netlist network with 21 inputs and 11 outputs.

3.121.31.1. Executing ABC.

3.121.32. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4722, asynchronously reset by !\rst_n
Extracted 32 gates and 54 wires to a netlist network with 21 inputs and 10 outputs.

3.121.32.1. Executing ABC.

3.121.33. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4731, asynchronously reset by !\rst_n
Extracted 26 gates and 43 wires to a netlist network with 16 inputs and 11 outputs.

3.121.33.1. Executing ABC.

3.121.34. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4740, asynchronously reset by !\rst_n
Extracted 32 gates and 53 wires to a netlist network with 20 inputs and 10 outputs.

3.121.34.1. Executing ABC.

3.121.35. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4749, asynchronously reset by !\rst_n
Extracted 32 gates and 52 wires to a netlist network with 19 inputs and 10 outputs.

3.121.35.1. Executing ABC.

3.121.36. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4758, asynchronously reset by !\rst_n
Extracted 33 gates and 54 wires to a netlist network with 20 inputs and 10 outputs.

3.121.36.1. Executing ABC.

3.121.37. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4767, asynchronously reset by !\rst_n
Extracted 33 gates and 54 wires to a netlist network with 20 inputs and 10 outputs.

3.121.37.1. Executing ABC.

3.121.38. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4776, asynchronously reset by !\rst_n
Extracted 34 gates and 57 wires to a netlist network with 22 inputs and 10 outputs.

3.121.38.1. Executing ABC.

3.121.39. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4783, asynchronously reset by !\rst_n
Extracted 14 gates and 26 wires to a netlist network with 12 inputs and 12 outputs.

3.121.39.1. Executing ABC.

3.121.40. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$4786, asynchronously reset by !\rst_n
Extracted 151 gates and 196 wires to a netlist network with 43 inputs and 25 outputs.

3.121.40.1. Executing ABC.

3.121.41. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4791, asynchronously reset by !\rst_n
Extracted 188 gates and 263 wires to a netlist network with 73 inputs and 45 outputs.

3.121.41.1. Executing ABC.

3.121.42. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4612, asynchronously reset by !\rst_n
Extracted 23 gates and 33 wires to a netlist network with 10 inputs and 11 outputs.

3.121.42.1. Executing ABC.

3.121.43. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4619, asynchronously reset by !\rst_n
Extracted 110 gates and 126 wires to a netlist network with 14 inputs and 54 outputs.

3.121.43.1. Executing ABC.

3.121.44. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4628, asynchronously reset by !\rst_n
Extracted 111 gates and 132 wires to a netlist network with 19 inputs and 65 outputs.

3.121.44.1. Executing ABC.

3.121.45. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4639, asynchronously reset by !\rst_n
Extracted 118 gates and 140 wires to a netlist network with 21 inputs and 71 outputs.

3.121.45.1. Executing ABC.

3.121.46. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$21701$auto$simplemap.cc:251:simplemap_eqne$10446[3], asynchronously reset by !\rst_n
Extracted 1095 gates and 1323 wires to a netlist network with 226 inputs and 83 outputs.

3.121.46.1. Executing ABC.

3.121.47. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$4650, asynchronously reset by !\rst_n
Extracted 34 gates and 55 wires to a netlist network with 20 inputs and 11 outputs.

3.121.47.1. Executing ABC.

yosys> abc -dff

3.122. Executing ABC pass (technology mapping using ABC).

3.122.1. Summary of detected clock domains:
  178 cells in clk=\clk, en=$abc$22055$auto$opt_dff.cc:219:make_patterns_logic$5199, arst=!\rst_n, srst={ }
  31 cells in clk=\clk, en=$abc$24105$auto$opt_dff.cc:219:make_patterns_logic$5187, arst=!\rst_n, srst={ }
  827 cells in clk=\clk, en=$abc$21701$auto$simplemap.cc:251:simplemap_eqne$10446[3], arst=!\rst_n, srst={ }
  37 cells in clk=\clk, en=$abc$23236$auto$opt_dff.cc:219:make_patterns_logic$4940, arst=!\rst_n, srst={ }
  152 cells in clk=\clk, en=$abc$23753$auto$opt_dff.cc:219:make_patterns_logic$5078, arst=!\rst_n, srst={ }
  111 cells in clk=\clk, en=$abc$24881$auto$opt_dff.cc:219:make_patterns_logic$4791, arst=!\rst_n, srst={ }
  60 cells in clk=\clk, en=$abc$21701$flatten\cavlc_read_levels.$verific$n231$761, arst=!\rst_n, srst={ }
  61 cells in clk=\clk, en=$abc$24452$auto$opt_dff.cc:219:make_patterns_logic$4731, arst=!\rst_n, srst={ }
  68 cells in clk=\clk, en=$abc$23091$auto$opt_dff.cc:219:make_patterns_logic$4894, arst=!\rst_n, srst={ }
  38 cells in clk=\clk, en=$abc$21653$auto$opt_dff.cc:219:make_patterns_logic$4607, arst=!\rst_n, srst={ }
  63 cells in clk=\clk, en=$abc$24174$auto$opt_dff.cc:219:make_patterns_logic$4668, arst=!\rst_n, srst={ }
  20 cells in clk=\clk, en=$abc$24677$auto$opt_dff.cc:219:make_patterns_logic$4783, arst=!\rst_n, srst={ }
  35 cells in clk=\clk, en=$abc$23816$auto$opt_dff.cc:219:make_patterns_logic$5101, arst=!\rst_n, srst={ }
  32 cells in clk=\clk, en=$abc$24599$auto$opt_dff.cc:219:make_patterns_logic$4767, arst=!\rst_n, srst={ }
  62 cells in clk=\clk, en=$abc$24373$auto$opt_dff.cc:219:make_patterns_logic$4713, arst=!\rst_n, srst={ }
  67 cells in clk=\clk, en=$abc$24333$auto$opt_dff.cc:219:make_patterns_logic$4704, arst=!\rst_n, srst={ }
  59 cells in clk=\clk, en=$abc$24255$auto$opt_dff.cc:219:make_patterns_logic$4686, arst=!\rst_n, srst={ }
  101 cells in clk=\clk, en=$abc$25031$auto$opt_dff.cc:219:make_patterns_logic$4619, arst=!\rst_n, srst={ }
  53 cells in clk=\clk, en=$abc$23960$auto$opt_dff.cc:219:make_patterns_logic$5151, arst=!\rst_n, srst={ }
  65 cells in clk=\clk, en=$abc$24131$auto$opt_dff.cc:219:make_patterns_logic$4659, arst=!\rst_n, srst={ }
  27 cells in clk=\clk, en=$abc$24525$auto$opt_dff.cc:219:make_patterns_logic$4749, arst=!\rst_n, srst={ }
  48 cells in clk=\clk, en=$abc$23567$auto$opt_dff.cc:219:make_patterns_logic$5034, arst=!\rst_n, srst={ }
  93 cells in clk=\clk, en=$abc$25245$auto$opt_dff.cc:219:make_patterns_logic$4639, arst=!\rst_n, srst={ }
  58 cells in clk=\clk, en=$abc$24562$auto$opt_dff.cc:219:make_patterns_logic$4758, arst=!\rst_n, srst={ }
  85 cells in clk=\clk, en=$abc$25135$auto$opt_dff.cc:219:make_patterns_logic$4628, arst=!\rst_n, srst={ }
  65 cells in clk=\clk, en=$abc$21701$cavlc_read_levels.level_abs_refresh, arst=!\rst_n, srst={ }
  52 cells in clk=\clk, en=$abc$23672$auto$opt_dff.cc:219:make_patterns_logic$5055, arst=!\rst_n, srst={ }
  264 cells in clk=\clk, en=\ena, arst=!\rst_n, srst={ }
  24 cells in clk=\clk, en=$abc$24055$auto$opt_dff.cc:219:make_patterns_logic$5174, arst=!\rst_n, srst={ }
  49 cells in clk=\clk, en=$abc$23313$auto$opt_dff.cc:219:make_patterns_logic$4965, arst=!\rst_n, srst={ }
  52 cells in clk=\clk, en=$abc$23406$auto$opt_dff.cc:219:make_patterns_logic$4990, arst=!\rst_n, srst={ }
  54 cells in clk=\clk, en=$abc$23005$auto$opt_dff.cc:219:make_patterns_logic$4867, arst=!\rst_n, srst={ }
  32 cells in clk=\clk, en=$abc$23158$auto$opt_dff.cc:219:make_patterns_logic$4917, arst=!\rst_n, srst={ }
  161 cells in clk=\clk, en=$abc$21701$flatten\cavlc_read_levels.$verific$n474$778, arst=!\rst_n, srst={ }
  46 cells in clk=\clk, en=$abc$22916$auto$opt_dff.cc:219:make_patterns_logic$4840, arst=!\rst_n, srst={ }
  64 cells in clk=\clk, en=$abc$24294$auto$opt_dff.cc:219:make_patterns_logic$4695, arst=!\rst_n, srst={ }
  527 cells in clk=\clk, en=$abc$24709$auto$opt_dff.cc:194:make_patterns_logic$4786, arst=!\rst_n, srst={ }
  48 cells in clk=\clk, en=$abc$22819$auto$opt_dff.cc:219:make_patterns_logic$4817, arst=!\rst_n, srst={ }
  161 cells in clk=\clk, en=$abc$23894$auto$opt_dff.cc:219:make_patterns_logic$5126, arst=!\rst_n, srst={ }
  33 cells in clk=\clk, en=$abc$24214$auto$opt_dff.cc:219:make_patterns_logic$4677, arst=!\rst_n, srst={ }
  21 cells in clk=\clk, en=$abc$25002$auto$opt_dff.cc:219:make_patterns_logic$4612, arst=!\rst_n, srst={ }
  65 cells in clk=\clk, en=$abc$24637$auto$opt_dff.cc:219:make_patterns_logic$4776, arst=!\rst_n, srst={ }
  60 cells in clk=\clk, en=$abc$24413$auto$opt_dff.cc:219:make_patterns_logic$4722, arst=!\rst_n, srst={ }
  65 cells in clk=\clk, en=$abc$24487$auto$opt_dff.cc:219:make_patterns_logic$4740, arst=!\rst_n, srst={ }
  36 cells in clk=\clk, en=$abc$23492$auto$opt_dff.cc:219:make_patterns_logic$5013, arst=!\rst_n, srst={ }
  57 cells in clk=\clk, en=$abc$26477$auto$opt_dff.cc:219:make_patterns_logic$4650, arst=!\rst_n, srst={ }

3.122.2. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$22055$auto$opt_dff.cc:219:make_patterns_logic$5199, asynchronously reset by !\rst_n
Extracted 178 gates and 302 wires to a netlist network with 124 inputs and 104 outputs.

3.122.2.1. Executing ABC.

3.122.3. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24105$auto$opt_dff.cc:219:make_patterns_logic$5187, asynchronously reset by !\rst_n
Extracted 31 gates and 52 wires to a netlist network with 21 inputs and 10 outputs.

3.122.3.1. Executing ABC.

3.122.4. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$21701$auto$simplemap.cc:251:simplemap_eqne$10446[3], asynchronously reset by !\rst_n
Extracted 827 gates and 1068 wires to a netlist network with 241 inputs and 118 outputs.

3.122.4.1. Executing ABC.

3.122.5. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23236$auto$opt_dff.cc:219:make_patterns_logic$4940, asynchronously reset by !\rst_n
Extracted 37 gates and 63 wires to a netlist network with 26 inputs and 28 outputs.

3.122.5.1. Executing ABC.

3.122.6. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23753$auto$opt_dff.cc:219:make_patterns_logic$5078, asynchronously reset by !\rst_n
Extracted 152 gates and 255 wires to a netlist network with 103 inputs and 31 outputs.

3.122.6.1. Executing ABC.

3.122.7. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24881$auto$opt_dff.cc:219:make_patterns_logic$4791, asynchronously reset by !\rst_n
Extracted 111 gates and 163 wires to a netlist network with 52 inputs and 31 outputs.

3.122.7.1. Executing ABC.

3.122.8. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$21701$flatten\cavlc_read_levels.$verific$n231$761, asynchronously reset by !\rst_n
Extracted 60 gates and 79 wires to a netlist network with 19 inputs and 28 outputs.

3.122.8.1. Executing ABC.

3.122.9. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24452$auto$opt_dff.cc:219:make_patterns_logic$4731, asynchronously reset by !\rst_n
Extracted 61 gates and 96 wires to a netlist network with 35 inputs and 14 outputs.

3.122.9.1. Executing ABC.

3.122.10. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23091$auto$opt_dff.cc:219:make_patterns_logic$4894, asynchronously reset by !\rst_n
Extracted 68 gates and 114 wires to a netlist network with 46 inputs and 26 outputs.

3.122.10.1. Executing ABC.

3.122.11. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$21653$auto$opt_dff.cc:219:make_patterns_logic$4607, asynchronously reset by !\rst_n
Extracted 38 gates and 49 wires to a netlist network with 11 inputs and 21 outputs.

3.122.11.1. Executing ABC.

3.122.12. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24174$auto$opt_dff.cc:219:make_patterns_logic$4668, asynchronously reset by !\rst_n
Extracted 63 gates and 98 wires to a netlist network with 35 inputs and 15 outputs.

3.122.12.1. Executing ABC.

3.122.13. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24677$auto$opt_dff.cc:219:make_patterns_logic$4783, asynchronously reset by !\rst_n
Extracted 20 gates and 32 wires to a netlist network with 12 inputs and 12 outputs.

3.122.13.1. Executing ABC.

3.122.14. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23816$auto$opt_dff.cc:219:make_patterns_logic$5101, asynchronously reset by !\rst_n
Extracted 35 gates and 61 wires to a netlist network with 26 inputs and 26 outputs.

3.122.14.1. Executing ABC.

3.122.15. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24599$auto$opt_dff.cc:219:make_patterns_logic$4767, asynchronously reset by !\rst_n
Extracted 32 gates and 54 wires to a netlist network with 22 inputs and 13 outputs.

3.122.15.1. Executing ABC.

3.122.16. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24373$auto$opt_dff.cc:219:make_patterns_logic$4713, asynchronously reset by !\rst_n
Extracted 62 gates and 96 wires to a netlist network with 34 inputs and 14 outputs.

3.122.16.1. Executing ABC.

3.122.17. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24333$auto$opt_dff.cc:219:make_patterns_logic$4704, asynchronously reset by !\rst_n
Extracted 67 gates and 104 wires to a netlist network with 37 inputs and 19 outputs.

3.122.17.1. Executing ABC.

3.122.18. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24255$auto$opt_dff.cc:219:make_patterns_logic$4686, asynchronously reset by !\rst_n
Extracted 59 gates and 92 wires to a netlist network with 33 inputs and 12 outputs.

3.122.18.1. Executing ABC.

3.122.19. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$25031$auto$opt_dff.cc:219:make_patterns_logic$4619, asynchronously reset by !\rst_n
Extracted 101 gates and 115 wires to a netlist network with 14 inputs and 55 outputs.

3.122.19.1. Executing ABC.

3.122.20. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23960$auto$opt_dff.cc:219:make_patterns_logic$5151, asynchronously reset by !\rst_n
Extracted 53 gates and 84 wires to a netlist network with 31 inputs and 23 outputs.

3.122.20.1. Executing ABC.

3.122.21. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24131$auto$opt_dff.cc:219:make_patterns_logic$4659, asynchronously reset by !\rst_n
Extracted 65 gates and 103 wires to a netlist network with 38 inputs and 15 outputs.

3.122.21.1. Executing ABC.

3.122.22. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24525$auto$opt_dff.cc:219:make_patterns_logic$4749, asynchronously reset by !\rst_n
Extracted 27 gates and 46 wires to a netlist network with 19 inputs and 10 outputs.

3.122.22.1. Executing ABC.

3.122.23. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23567$auto$opt_dff.cc:219:make_patterns_logic$5034, asynchronously reset by !\rst_n
Extracted 48 gates and 74 wires to a netlist network with 26 inputs and 23 outputs.

3.122.23.1. Executing ABC.

3.122.24. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$25245$auto$opt_dff.cc:219:make_patterns_logic$4639, asynchronously reset by !\rst_n
Extracted 93 gates and 114 wires to a netlist network with 21 inputs and 67 outputs.

3.122.24.1. Executing ABC.

3.122.25. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24562$auto$opt_dff.cc:219:make_patterns_logic$4758, asynchronously reset by !\rst_n
Extracted 58 gates and 90 wires to a netlist network with 32 inputs and 13 outputs.

3.122.25.1. Executing ABC.

3.122.26. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$25135$auto$opt_dff.cc:219:make_patterns_logic$4628, asynchronously reset by !\rst_n
Extracted 85 gates and 104 wires to a netlist network with 19 inputs and 61 outputs.

3.122.26.1. Executing ABC.

3.122.27. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$21701$cavlc_read_levels.level_abs_refresh, asynchronously reset by !\rst_n
Extracted 65 gates and 84 wires to a netlist network with 19 inputs and 25 outputs.

3.122.27.1. Executing ABC.

3.122.28. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23672$auto$opt_dff.cc:219:make_patterns_logic$5055, asynchronously reset by !\rst_n
Extracted 52 gates and 77 wires to a netlist network with 25 inputs and 26 outputs.

3.122.28.1. Executing ABC.

3.122.29. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \ena, asynchronously reset by !\rst_n
Extracted 264 gates and 399 wires to a netlist network with 135 inputs and 75 outputs.

3.122.29.1. Executing ABC.

3.122.30. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24055$auto$opt_dff.cc:219:make_patterns_logic$5174, asynchronously reset by !\rst_n
Extracted 24 gates and 49 wires to a netlist network with 25 inputs and 15 outputs.

3.122.30.1. Executing ABC.

3.122.31. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23313$auto$opt_dff.cc:219:make_patterns_logic$4965, asynchronously reset by !\rst_n
Extracted 49 gates and 75 wires to a netlist network with 26 inputs and 21 outputs.

3.122.31.1. Executing ABC.

3.122.32. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23406$auto$opt_dff.cc:219:make_patterns_logic$4990, asynchronously reset by !\rst_n
Extracted 52 gates and 83 wires to a netlist network with 31 inputs and 24 outputs.

3.122.32.1. Executing ABC.

3.122.33. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23005$auto$opt_dff.cc:219:make_patterns_logic$4867, asynchronously reset by !\rst_n
Extracted 54 gates and 83 wires to a netlist network with 29 inputs and 26 outputs.

3.122.33.1. Executing ABC.

3.122.34. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23158$auto$opt_dff.cc:219:make_patterns_logic$4917, asynchronously reset by !\rst_n
Extracted 32 gates and 56 wires to a netlist network with 24 inputs and 24 outputs.

3.122.34.1. Executing ABC.

3.122.35. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$21701$flatten\cavlc_read_levels.$verific$n474$778, asynchronously reset by !\rst_n
Extracted 161 gates and 199 wires to a netlist network with 38 inputs and 20 outputs.

3.122.35.1. Executing ABC.

3.122.36. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$22916$auto$opt_dff.cc:219:make_patterns_logic$4840, asynchronously reset by !\rst_n
Extracted 46 gates and 78 wires to a netlist network with 32 inputs and 26 outputs.

3.122.36.1. Executing ABC.

3.122.37. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24294$auto$opt_dff.cc:219:make_patterns_logic$4695, asynchronously reset by !\rst_n
Extracted 64 gates and 100 wires to a netlist network with 36 inputs and 16 outputs.

3.122.37.1. Executing ABC.

3.122.38. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24709$auto$opt_dff.cc:194:make_patterns_logic$4786, asynchronously reset by !\rst_n
Extracted 527 gates and 608 wires to a netlist network with 81 inputs and 25 outputs.

3.122.38.1. Executing ABC.

3.122.39. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$22819$auto$opt_dff.cc:219:make_patterns_logic$4817, asynchronously reset by !\rst_n
Extracted 48 gates and 78 wires to a netlist network with 30 inputs and 25 outputs.

3.122.39.1. Executing ABC.

3.122.40. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23894$auto$opt_dff.cc:219:make_patterns_logic$5126, asynchronously reset by !\rst_n
Extracted 161 gates and 257 wires to a netlist network with 96 inputs and 36 outputs.

3.122.40.1. Executing ABC.

3.122.41. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24214$auto$opt_dff.cc:219:make_patterns_logic$4677, asynchronously reset by !\rst_n
Extracted 33 gates and 55 wires to a netlist network with 22 inputs and 12 outputs.

3.122.41.1. Executing ABC.

3.122.42. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$25002$auto$opt_dff.cc:219:make_patterns_logic$4612, asynchronously reset by !\rst_n
Extracted 21 gates and 31 wires to a netlist network with 10 inputs and 11 outputs.

3.122.42.1. Executing ABC.

3.122.43. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24637$auto$opt_dff.cc:219:make_patterns_logic$4776, asynchronously reset by !\rst_n
Extracted 65 gates and 104 wires to a netlist network with 39 inputs and 14 outputs.

3.122.43.1. Executing ABC.

3.122.44. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24413$auto$opt_dff.cc:219:make_patterns_logic$4722, asynchronously reset by !\rst_n
Extracted 60 gates and 94 wires to a netlist network with 34 inputs and 12 outputs.

3.122.44.1. Executing ABC.

3.122.45. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$24487$auto$opt_dff.cc:219:make_patterns_logic$4740, asynchronously reset by !\rst_n
Extracted 65 gates and 100 wires to a netlist network with 35 inputs and 18 outputs.

3.122.45.1. Executing ABC.

3.122.46. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$23492$auto$opt_dff.cc:219:make_patterns_logic$5013, asynchronously reset by !\rst_n
Extracted 36 gates and 64 wires to a netlist network with 28 inputs and 24 outputs.

3.122.46.1. Executing ABC.

3.122.47. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$26477$auto$opt_dff.cc:219:make_patterns_logic$4650, asynchronously reset by !\rst_n
Extracted 57 gates and 89 wires to a netlist network with 32 inputs and 12 outputs.

3.122.47.1. Executing ABC.

yosys> abc -dff

3.123. Executing ABC pass (technology mapping using ABC).

3.123.1. Summary of detected clock domains:
  21 cells in clk=\clk, en=$abc$26694$abc$24105$auto$opt_dff.cc:219:make_patterns_logic$5187, arst=!\rst_n, srst={ }
  819 cells in clk=\clk, en=$abc$26722$abc$21701$auto$simplemap.cc:251:simplemap_eqne$10446[3], arst=!\rst_n, srst={ }
  43 cells in clk=\clk, en=$abc$27540$abc$23236$auto$opt_dff.cc:219:make_patterns_logic$4940, arst=!\rst_n, srst={ }
  48 cells in clk=\clk, en=$abc$31004$abc$23492$auto$opt_dff.cc:219:make_patterns_logic$5013, arst=!\rst_n, srst={ }
  109 cells in clk=\clk, en=$abc$27774$abc$24881$auto$opt_dff.cc:219:make_patterns_logic$4791, arst=!\rst_n, srst={ }
  53 cells in clk=\clk, en=$abc$27877$abc$21701$flatten\cavlc_read_levels.$verific$n231$761, arst=!\rst_n, srst={ }
  51 cells in clk=\clk, en=$abc$27939$abc$24452$auto$opt_dff.cc:219:make_patterns_logic$4731, arst=!\rst_n, srst={ }
  36 cells in clk=\clk, en=$abc$28089$abc$21653$auto$opt_dff.cc:219:make_patterns_logic$4607, arst=!\rst_n, srst={ }
  53 cells in clk=\clk, en=$abc$28135$abc$24174$auto$opt_dff.cc:219:make_patterns_logic$4668, arst=!\rst_n, srst={ }
  55 cells in clk=\clk, en=$abc$28002$abc$23091$auto$opt_dff.cc:219:make_patterns_logic$4894, arst=!\rst_n, srst={ }
  18 cells in clk=\clk, en=$abc$28199$abc$24677$auto$opt_dff.cc:219:make_patterns_logic$4783, arst=!\rst_n, srst={ }
  38 cells in clk=\clk, en=$abc$28230$abc$23816$auto$opt_dff.cc:219:make_patterns_logic$5101, arst=!\rst_n, srst={ }
  51 cells in clk=\clk, en=$abc$28284$abc$24599$auto$opt_dff.cc:219:make_patterns_logic$4767, arst=!\rst_n, srst={ }
  59 cells in clk=\clk, en=$abc$28325$abc$24373$auto$opt_dff.cc:219:make_patterns_logic$4713, arst=!\rst_n, srst={ }
  53 cells in clk=\clk, en=$abc$28388$abc$24333$auto$opt_dff.cc:219:make_patterns_logic$4704, arst=!\rst_n, srst={ }
  52 cells in clk=\clk, en=$abc$28455$abc$24255$auto$opt_dff.cc:219:make_patterns_logic$4686, arst=!\rst_n, srst={ }
  40 cells in clk=\clk, en=$abc$27596$abc$23753$auto$opt_dff.cc:219:make_patterns_logic$5078, arst=!\rst_n, srst={ }
  53 cells in clk=\clk, en=$abc$28629$abc$23960$auto$opt_dff.cc:219:make_patterns_logic$5151, arst=!\rst_n, srst={ }
  54 cells in clk=\clk, en=$abc$28684$abc$24131$auto$opt_dff.cc:219:make_patterns_logic$4659, arst=!\rst_n, srst={ }
  47 cells in clk=\clk, en=$abc$28749$abc$24525$auto$opt_dff.cc:219:make_patterns_logic$4749, arst=!\rst_n, srst={ }
  51 cells in clk=\clk, en=$abc$28786$abc$23567$auto$opt_dff.cc:219:make_patterns_logic$5034, arst=!\rst_n, srst={ }
  57 cells in clk=\clk, en=$abc$28947$abc$24562$auto$opt_dff.cc:219:make_patterns_logic$4758, arst=!\rst_n, srst={ }
  84 cells in clk=\clk, en=$abc$29007$abc$25135$auto$opt_dff.cc:219:make_patterns_logic$4628, arst=!\rst_n, srst={ }
  64 cells in clk=\clk, en=$abc$29107$abc$21701$cavlc_read_levels.level_abs_refresh, arst=!\rst_n, srst={ }
  48 cells in clk=\clk, en=$abc$29172$abc$23672$auto$opt_dff.cc:219:make_patterns_logic$5055, arst=!\rst_n, srst={ }
  281 cells in clk=\clk, en=\ena, arst=!\rst_n, srst={ }
  66 cells in clk=\clk, en=$abc$28516$abc$25031$auto$opt_dff.cc:219:make_patterns_logic$4619, arst=!\rst_n, srst={ }
  28 cells in clk=\clk, en=$abc$29489$abc$24055$auto$opt_dff.cc:219:make_patterns_logic$5174, arst=!\rst_n, srst={ }
  51 cells in clk=\clk, en=$abc$29531$abc$23313$auto$opt_dff.cc:219:make_patterns_logic$4965, arst=!\rst_n, srst={ }
  51 cells in clk=\clk, en=$abc$29582$abc$23406$auto$opt_dff.cc:219:make_patterns_logic$4990, arst=!\rst_n, srst={ }
  54 cells in clk=\clk, en=$abc$29636$abc$23005$auto$opt_dff.cc:219:make_patterns_logic$4867, arst=!\rst_n, srst={ }
  35 cells in clk=\clk, en=$abc$29692$abc$23158$auto$opt_dff.cc:219:make_patterns_logic$4917, arst=!\rst_n, srst={ }
  164 cells in clk=\clk, en=$abc$29743$abc$21701$flatten\cavlc_read_levels.$verific$n474$778, arst=!\rst_n, srst={ }
  46 cells in clk=\clk, en=$abc$29904$abc$22916$auto$opt_dff.cc:219:make_patterns_logic$4840, arst=!\rst_n, srst={ }
  55 cells in clk=\clk, en=$abc$29959$abc$24294$auto$opt_dff.cc:219:make_patterns_logic$4695, arst=!\rst_n, srst={ }
  494 cells in clk=\clk, en=$abc$30025$abc$24709$auto$opt_dff.cc:194:make_patterns_logic$4786, arst=!\rst_n, srst={ }
  46 cells in clk=\clk, en=$abc$30509$abc$22819$auto$opt_dff.cc:219:make_patterns_logic$4817, arst=!\rst_n, srst={ }
  59 cells in clk=\clk, en=$abc$30566$abc$23894$auto$opt_dff.cc:219:make_patterns_logic$5126, arst=!\rst_n, srst={ }
  69 cells in clk=\clk, en=$abc$30738$abc$24214$auto$opt_dff.cc:219:make_patterns_logic$4677, arst=!\rst_n, srst={ }
  21 cells in clk=\clk, en=$abc$30781$abc$25002$auto$opt_dff.cc:219:make_patterns_logic$4612, arst=!\rst_n, srst={ }
  60 cells in clk=\clk, en=$abc$30809$abc$24637$auto$opt_dff.cc:219:make_patterns_logic$4776, arst=!\rst_n, srst={ }
  52 cells in clk=\clk, en=$abc$30876$abc$24413$auto$opt_dff.cc:219:make_patterns_logic$4722, arst=!\rst_n, srst={ }
  54 cells in clk=\clk, en=$abc$30937$abc$24487$auto$opt_dff.cc:219:make_patterns_logic$4740, arst=!\rst_n, srst={ }
  93 cells in clk=\clk, en=$abc$28836$abc$25245$auto$opt_dff.cc:219:make_patterns_logic$4639, arst=!\rst_n, srst={ }
  156 cells in clk=\clk, en=$abc$26515$abc$22055$auto$opt_dff.cc:219:make_patterns_logic$5199, arst=!\rst_n, srst={ }
  228 cells in clk=\clk, en=$abc$31059$abc$26477$auto$opt_dff.cc:219:make_patterns_logic$4650, arst=!\rst_n, srst={ }

3.123.2. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$26694$abc$24105$auto$opt_dff.cc:219:make_patterns_logic$5187, asynchronously reset by !\rst_n
Extracted 21 gates and 38 wires to a netlist network with 17 inputs and 5 outputs.

3.123.2.1. Executing ABC.

3.123.3. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$26722$abc$21701$auto$simplemap.cc:251:simplemap_eqne$10446[3], asynchronously reset by !\rst_n
Extracted 819 gates and 1059 wires to a netlist network with 240 inputs and 109 outputs.

3.123.3.1. Executing ABC.

3.123.4. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$27540$abc$23236$auto$opt_dff.cc:219:make_patterns_logic$4940, asynchronously reset by !\rst_n
Extracted 43 gates and 72 wires to a netlist network with 29 inputs and 29 outputs.

3.123.4.1. Executing ABC.

3.123.5. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$31004$abc$23492$auto$opt_dff.cc:219:make_patterns_logic$5013, asynchronously reset by !\rst_n
Extracted 48 gates and 85 wires to a netlist network with 37 inputs and 29 outputs.

3.123.5.1. Executing ABC.

3.123.6. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$27774$abc$24881$auto$opt_dff.cc:219:make_patterns_logic$4791, asynchronously reset by !\rst_n
Extracted 109 gates and 163 wires to a netlist network with 54 inputs and 31 outputs.

3.123.6.1. Executing ABC.

3.123.7. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$27877$abc$21701$flatten\cavlc_read_levels.$verific$n231$761, asynchronously reset by !\rst_n
Extracted 53 gates and 71 wires to a netlist network with 18 inputs and 24 outputs.

3.123.7.1. Executing ABC.

3.123.8. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$27939$abc$24452$auto$opt_dff.cc:219:make_patterns_logic$4731, asynchronously reset by !\rst_n
Extracted 51 gates and 83 wires to a netlist network with 32 inputs and 12 outputs.

3.123.8.1. Executing ABC.

3.123.9. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28089$abc$21653$auto$opt_dff.cc:219:make_patterns_logic$4607, asynchronously reset by !\rst_n
Extracted 36 gates and 47 wires to a netlist network with 11 inputs and 20 outputs.

3.123.9.1. Executing ABC.

3.123.10. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28135$abc$24174$auto$opt_dff.cc:219:make_patterns_logic$4668, asynchronously reset by !\rst_n
Extracted 53 gates and 88 wires to a netlist network with 35 inputs and 13 outputs.

3.123.10.1. Executing ABC.

3.123.11. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28002$abc$23091$auto$opt_dff.cc:219:make_patterns_logic$4894, asynchronously reset by !\rst_n
Extracted 55 gates and 87 wires to a netlist network with 32 inputs and 25 outputs.

3.123.11.1. Executing ABC.

3.123.12. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28199$abc$24677$auto$opt_dff.cc:219:make_patterns_logic$4783, asynchronously reset by !\rst_n
Extracted 18 gates and 30 wires to a netlist network with 12 inputs and 12 outputs.

3.123.12.1. Executing ABC.

3.123.13. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28230$abc$23816$auto$opt_dff.cc:219:make_patterns_logic$5101, asynchronously reset by !\rst_n
Extracted 38 gates and 67 wires to a netlist network with 29 inputs and 22 outputs.

3.123.13.1. Executing ABC.

3.123.14. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28284$abc$24599$auto$opt_dff.cc:219:make_patterns_logic$4767, asynchronously reset by !\rst_n
Extracted 51 gates and 85 wires to a netlist network with 34 inputs and 12 outputs.

3.123.14.1. Executing ABC.

3.123.15. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28325$abc$24373$auto$opt_dff.cc:219:make_patterns_logic$4713, asynchronously reset by !\rst_n
Extracted 59 gates and 97 wires to a netlist network with 38 inputs and 18 outputs.

3.123.15.1. Executing ABC.

3.123.16. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28388$abc$24333$auto$opt_dff.cc:219:make_patterns_logic$4704, asynchronously reset by !\rst_n
Extracted 53 gates and 88 wires to a netlist network with 35 inputs and 14 outputs.

3.123.16.1. Executing ABC.

3.123.17. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28455$abc$24255$auto$opt_dff.cc:219:make_patterns_logic$4686, asynchronously reset by !\rst_n
Extracted 52 gates and 85 wires to a netlist network with 33 inputs and 11 outputs.

3.123.17.1. Executing ABC.

3.123.18. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$27596$abc$23753$auto$opt_dff.cc:219:make_patterns_logic$5078, asynchronously reset by !\rst_n
Extracted 40 gates and 67 wires to a netlist network with 27 inputs and 26 outputs.

3.123.18.1. Executing ABC.

3.123.19. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28629$abc$23960$auto$opt_dff.cc:219:make_patterns_logic$5151, asynchronously reset by !\rst_n
Extracted 53 gates and 81 wires to a netlist network with 28 inputs and 23 outputs.

3.123.19.1. Executing ABC.

3.123.20. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28684$abc$24131$auto$opt_dff.cc:219:make_patterns_logic$4659, asynchronously reset by !\rst_n
Extracted 54 gates and 89 wires to a netlist network with 35 inputs and 13 outputs.

3.123.20.1. Executing ABC.

3.123.21. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28749$abc$24525$auto$opt_dff.cc:219:make_patterns_logic$4749, asynchronously reset by !\rst_n
Extracted 47 gates and 77 wires to a netlist network with 30 inputs and 11 outputs.

3.123.21.1. Executing ABC.

3.123.22. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28786$abc$23567$auto$opt_dff.cc:219:make_patterns_logic$5034, asynchronously reset by !\rst_n
Extracted 51 gates and 79 wires to a netlist network with 28 inputs and 24 outputs.

3.123.22.1. Executing ABC.

3.123.23. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28947$abc$24562$auto$opt_dff.cc:219:make_patterns_logic$4758, asynchronously reset by !\rst_n
Extracted 57 gates and 96 wires to a netlist network with 39 inputs and 14 outputs.

3.123.23.1. Executing ABC.

3.123.24. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$29007$abc$25135$auto$opt_dff.cc:219:make_patterns_logic$4628, asynchronously reset by !\rst_n
Extracted 84 gates and 103 wires to a netlist network with 19 inputs and 60 outputs.

3.123.24.1. Executing ABC.

3.123.25. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$29107$abc$21701$cavlc_read_levels.level_abs_refresh, asynchronously reset by !\rst_n
Extracted 64 gates and 84 wires to a netlist network with 20 inputs and 24 outputs.

3.123.25.1. Executing ABC.

3.123.26. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$29172$abc$23672$auto$opt_dff.cc:219:make_patterns_logic$5055, asynchronously reset by !\rst_n
Extracted 48 gates and 72 wires to a netlist network with 24 inputs and 23 outputs.

3.123.26.1. Executing ABC.

3.123.27. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \ena, asynchronously reset by !\rst_n
Extracted 281 gates and 412 wires to a netlist network with 131 inputs and 76 outputs.

3.123.27.1. Executing ABC.

3.123.28. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28516$abc$25031$auto$opt_dff.cc:219:make_patterns_logic$4619, asynchronously reset by !\rst_n
Extracted 66 gates and 80 wires to a netlist network with 14 inputs and 51 outputs.

3.123.28.1. Executing ABC.

3.123.29. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$29489$abc$24055$auto$opt_dff.cc:219:make_patterns_logic$5174, asynchronously reset by !\rst_n
Extracted 28 gates and 52 wires to a netlist network with 24 inputs and 19 outputs.

3.123.29.1. Executing ABC.

3.123.30. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$29531$abc$23313$auto$opt_dff.cc:219:make_patterns_logic$4965, asynchronously reset by !\rst_n
Extracted 51 gates and 77 wires to a netlist network with 26 inputs and 23 outputs.

3.123.30.1. Executing ABC.

3.123.31. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$29582$abc$23406$auto$opt_dff.cc:219:make_patterns_logic$4990, asynchronously reset by !\rst_n
Extracted 51 gates and 81 wires to a netlist network with 30 inputs and 24 outputs.

3.123.31.1. Executing ABC.

3.123.32. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$29636$abc$23005$auto$opt_dff.cc:219:make_patterns_logic$4867, asynchronously reset by !\rst_n
Extracted 54 gates and 84 wires to a netlist network with 30 inputs and 26 outputs.

3.123.32.1. Executing ABC.

3.123.33. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$29692$abc$23158$auto$opt_dff.cc:219:make_patterns_logic$4917, asynchronously reset by !\rst_n
Extracted 35 gates and 60 wires to a netlist network with 25 inputs and 24 outputs.

3.123.33.1. Executing ABC.

3.123.34. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$29743$abc$21701$flatten\cavlc_read_levels.$verific$n474$778, asynchronously reset by !\rst_n
Extracted 164 gates and 201 wires to a netlist network with 37 inputs and 20 outputs.

3.123.34.1. Executing ABC.

3.123.35. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$29904$abc$22916$auto$opt_dff.cc:219:make_patterns_logic$4840, asynchronously reset by !\rst_n
Extracted 46 gates and 77 wires to a netlist network with 31 inputs and 25 outputs.

3.123.35.1. Executing ABC.

3.123.36. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$29959$abc$24294$auto$opt_dff.cc:219:make_patterns_logic$4695, asynchronously reset by !\rst_n
Extracted 55 gates and 90 wires to a netlist network with 35 inputs and 14 outputs.

3.123.36.1. Executing ABC.

3.123.37. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$30025$abc$24709$auto$opt_dff.cc:194:make_patterns_logic$4786, asynchronously reset by !\rst_n
Extracted 494 gates and 569 wires to a netlist network with 75 inputs and 28 outputs.

3.123.37.1. Executing ABC.

3.123.38. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$30509$abc$22819$auto$opt_dff.cc:219:make_patterns_logic$4817, asynchronously reset by !\rst_n
Extracted 46 gates and 77 wires to a netlist network with 31 inputs and 22 outputs.

3.123.38.1. Executing ABC.

3.123.39. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$30566$abc$23894$auto$opt_dff.cc:219:make_patterns_logic$5126, asynchronously reset by !\rst_n
Extracted 59 gates and 90 wires to a netlist network with 31 inputs and 27 outputs.

3.123.39.1. Executing ABC.

3.123.40. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$30738$abc$24214$auto$opt_dff.cc:219:make_patterns_logic$4677, asynchronously reset by !\rst_n
Extracted 69 gates and 109 wires to a netlist network with 40 inputs and 18 outputs.

3.123.40.1. Executing ABC.

3.123.41. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$30781$abc$25002$auto$opt_dff.cc:219:make_patterns_logic$4612, asynchronously reset by !\rst_n
Extracted 21 gates and 31 wires to a netlist network with 10 inputs and 11 outputs.

3.123.41.1. Executing ABC.

3.123.42. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$30809$abc$24637$auto$opt_dff.cc:219:make_patterns_logic$4776, asynchronously reset by !\rst_n
Extracted 60 gates and 101 wires to a netlist network with 41 inputs and 17 outputs.

3.123.42.1. Executing ABC.

3.123.43. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$30876$abc$24413$auto$opt_dff.cc:219:make_patterns_logic$4722, asynchronously reset by !\rst_n
Extracted 52 gates and 87 wires to a netlist network with 35 inputs and 12 outputs.

3.123.43.1. Executing ABC.

3.123.44. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$30937$abc$24487$auto$opt_dff.cc:219:make_patterns_logic$4740, asynchronously reset by !\rst_n
Extracted 54 gates and 89 wires to a netlist network with 35 inputs and 14 outputs.

3.123.44.1. Executing ABC.

3.123.45. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$28836$abc$25245$auto$opt_dff.cc:219:make_patterns_logic$4639, asynchronously reset by !\rst_n
Extracted 93 gates and 114 wires to a netlist network with 21 inputs and 67 outputs.

3.123.45.1. Executing ABC.

3.123.46. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$26515$abc$22055$auto$opt_dff.cc:219:make_patterns_logic$5199, asynchronously reset by !\rst_n
Extracted 156 gates and 256 wires to a netlist network with 100 inputs and 85 outputs.

3.123.46.1. Executing ABC.

3.123.47. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$31059$abc$26477$auto$opt_dff.cc:219:make_patterns_logic$4650, asynchronously reset by !\rst_n
Extracted 228 gates and 360 wires to a netlist network with 132 inputs and 21 outputs.

3.123.47.1. Executing ABC.

yosys> abc -dff

3.124. Executing ABC pass (technology mapping using ABC).

3.124.1. Summary of detected clock domains:
  19 cells in clk=\clk, en=$abc$31118$abc$26694$abc$24105$auto$opt_dff.cc:219:make_patterns_logic$5187, arst=!\rst_n, srst={ }
  847 cells in clk=\clk, en=$abc$31139$abc$26722$abc$21701$auto$simplemap.cc:251:simplemap_eqne$10446[3], arst=!\rst_n, srst={ }
  47 cells in clk=\clk, en=$abc$31959$abc$27540$abc$23236$auto$opt_dff.cc:219:make_patterns_logic$4940, arst=!\rst_n, srst={ }
  43 cells in clk=\clk, en=$abc$32016$abc$31004$abc$23492$auto$opt_dff.cc:219:make_patterns_logic$5013, arst=!\rst_n, srst={ }
  97 cells in clk=\clk, en=$abc$32075$abc$27774$abc$24881$auto$opt_dff.cc:219:make_patterns_logic$4791, arst=!\rst_n, srst={ }
  57 cells in clk=\clk, en=$abc$32187$abc$27877$abc$21701$flatten\cavlc_read_levels.$verific$n231$761, arst=!\rst_n, srst={ }
  36 cells in clk=\clk, en=$abc$32303$abc$28089$abc$21653$auto$opt_dff.cc:219:make_patterns_logic$4607, arst=!\rst_n, srst={ }
  57 cells in clk=\clk, en=$abc$32348$abc$28135$abc$24174$auto$opt_dff.cc:219:make_patterns_logic$4668, arst=!\rst_n, srst={ }
  138 cells in clk=\clk, en=$abc$35267$abc$26515$abc$22055$auto$opt_dff.cc:219:make_patterns_logic$5199, arst=!\rst_n, srst={ }
  53 cells in clk=\clk, en=$abc$32410$abc$28002$abc$23091$auto$opt_dff.cc:219:make_patterns_logic$4894, arst=!\rst_n, srst={ }
  15 cells in clk=\clk, en=$abc$32467$abc$28199$abc$24677$auto$opt_dff.cc:219:make_patterns_logic$4783, arst=!\rst_n, srst={ }
  43 cells in clk=\clk, en=$abc$32498$abc$28230$abc$23816$auto$opt_dff.cc:219:make_patterns_logic$5101, arst=!\rst_n, srst={ }
  47 cells in clk=\clk, en=$abc$32548$abc$28284$abc$24599$auto$opt_dff.cc:219:make_patterns_logic$4767, arst=!\rst_n, srst={ }
  58 cells in clk=\clk, en=$abc$32608$abc$28325$abc$24373$auto$opt_dff.cc:219:make_patterns_logic$4713, arst=!\rst_n, srst={ }
  50 cells in clk=\clk, en=$abc$32678$abc$28388$abc$24333$auto$opt_dff.cc:219:make_patterns_logic$4704, arst=!\rst_n, srst={ }
  51 cells in clk=\clk, en=$abc$32740$abc$28455$abc$24255$auto$opt_dff.cc:219:make_patterns_logic$4686, arst=!\rst_n, srst={ }
  44 cells in clk=\clk, en=$abc$32800$abc$27596$abc$23753$auto$opt_dff.cc:219:make_patterns_logic$5078, arst=!\rst_n, srst={ }
  52 cells in clk=\clk, en=$abc$32854$abc$28629$abc$23960$auto$opt_dff.cc:219:make_patterns_logic$5151, arst=!\rst_n, srst={ }
  52 cells in clk=\clk, en=$abc$32908$abc$28684$abc$24131$auto$opt_dff.cc:219:make_patterns_logic$4659, arst=!\rst_n, srst={ }
  47 cells in clk=\clk, en=$abc$32970$abc$28749$abc$24525$auto$opt_dff.cc:219:make_patterns_logic$4749, arst=!\rst_n, srst={ }
  54 cells in clk=\clk, en=$abc$32244$abc$27939$abc$24452$auto$opt_dff.cc:219:make_patterns_logic$4731, arst=!\rst_n, srst={ }
  50 cells in clk=\clk, en=$abc$33027$abc$28786$abc$23567$auto$opt_dff.cc:219:make_patterns_logic$5034, arst=!\rst_n, srst={ }
  54 cells in clk=\clk, en=$abc$33080$abc$28947$abc$24562$auto$opt_dff.cc:219:make_patterns_logic$4758, arst=!\rst_n, srst={ }
  85 cells in clk=\clk, en=$abc$33145$abc$29007$abc$25135$auto$opt_dff.cc:219:make_patterns_logic$4628, arst=!\rst_n, srst={ }
  63 cells in clk=\clk, en=$abc$33244$abc$29107$abc$21701$cavlc_read_levels.level_abs_refresh, arst=!\rst_n, srst={ }
  52 cells in clk=\clk, en=$abc$33308$abc$29172$abc$23672$auto$opt_dff.cc:219:make_patterns_logic$5055, arst=!\rst_n, srst={ }
  231 cells in clk=\clk, en=\ena, arst=!\rst_n, srst={ }
  66 cells in clk=\clk, en=$abc$33635$abc$28516$abc$25031$auto$opt_dff.cc:219:make_patterns_logic$4619, arst=!\rst_n, srst={ }
  37 cells in clk=\clk, en=$abc$33712$abc$29489$abc$24055$auto$opt_dff.cc:219:make_patterns_logic$5174, arst=!\rst_n, srst={ }
  55 cells in clk=\clk, en=$abc$33758$abc$29531$abc$23313$auto$opt_dff.cc:219:make_patterns_logic$4965, arst=!\rst_n, srst={ }
  54 cells in clk=\clk, en=$abc$33811$abc$29582$abc$23406$auto$opt_dff.cc:219:make_patterns_logic$4990, arst=!\rst_n, srst={ }
  54 cells in clk=\clk, en=$abc$33864$abc$29636$abc$23005$auto$opt_dff.cc:219:make_patterns_logic$4867, arst=!\rst_n, srst={ }
  40 cells in clk=\clk, en=$abc$33920$abc$29692$abc$23158$auto$opt_dff.cc:219:make_patterns_logic$4917, arst=!\rst_n, srst={ }
  178 cells in clk=\clk, en=$abc$33971$abc$29743$abc$21701$flatten\cavlc_read_levels.$verific$n474$778, arst=!\rst_n, srst={ }
  50 cells in clk=\clk, en=$abc$34144$abc$29904$abc$22916$auto$opt_dff.cc:219:make_patterns_logic$4840, arst=!\rst_n, srst={ }
  54 cells in clk=\clk, en=$abc$34200$abc$29959$abc$24294$auto$opt_dff.cc:219:make_patterns_logic$4695, arst=!\rst_n, srst={ }
  492 cells in clk=\clk, en=$abc$34262$abc$30025$abc$24709$auto$opt_dff.cc:194:make_patterns_logic$4786, arst=!\rst_n, srst={ }
  47 cells in clk=\clk, en=$abc$34749$abc$30509$abc$22819$auto$opt_dff.cc:219:make_patterns_logic$4817, arst=!\rst_n, srst={ }
  58 cells in clk=\clk, en=$abc$34803$abc$30566$abc$23894$auto$opt_dff.cc:219:make_patterns_logic$5126, arst=!\rst_n, srst={ }
  54 cells in clk=\clk, en=$abc$34864$abc$30738$abc$24214$auto$opt_dff.cc:219:make_patterns_logic$4677, arst=!\rst_n, srst={ }
  22 cells in clk=\clk, en=$abc$34936$abc$30781$abc$25002$auto$opt_dff.cc:219:make_patterns_logic$4612, arst=!\rst_n, srst={ }
  62 cells in clk=\clk, en=$abc$34964$abc$30809$abc$24637$auto$opt_dff.cc:219:make_patterns_logic$4776, arst=!\rst_n, srst={ }
  51 cells in clk=\clk, en=$abc$35034$abc$30876$abc$24413$auto$opt_dff.cc:219:make_patterns_logic$4722, arst=!\rst_n, srst={ }
  54 cells in clk=\clk, en=$abc$35095$abc$30937$abc$24487$auto$opt_dff.cc:219:make_patterns_logic$4740, arst=!\rst_n, srst={ }
  91 cells in clk=\clk, en=$abc$35158$abc$28836$abc$25245$auto$opt_dff.cc:219:make_patterns_logic$4639, arst=!\rst_n, srst={ }
  228 cells in clk=\clk, en=$abc$35422$abc$31059$abc$26477$auto$opt_dff.cc:219:make_patterns_logic$4650, arst=!\rst_n, srst={ }

3.124.2. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$31118$abc$26694$abc$24105$auto$opt_dff.cc:219:make_patterns_logic$5187, asynchronously reset by !\rst_n
Extracted 19 gates and 35 wires to a netlist network with 16 inputs and 4 outputs.

3.124.2.1. Executing ABC.

3.124.3. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$31139$abc$26722$abc$21701$auto$simplemap.cc:251:simplemap_eqne$10446[3], asynchronously reset by !\rst_n
Extracted 847 gates and 1087 wires to a netlist network with 240 inputs and 122 outputs.

3.124.3.1. Executing ABC.

3.124.4. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$31959$abc$27540$abc$23236$auto$opt_dff.cc:219:make_patterns_logic$4940, asynchronously reset by !\rst_n
Extracted 47 gates and 79 wires to a netlist network with 32 inputs and 25 outputs.

3.124.4.1. Executing ABC.

3.124.5. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32016$abc$31004$abc$23492$auto$opt_dff.cc:219:make_patterns_logic$5013, asynchronously reset by !\rst_n
Extracted 43 gates and 74 wires to a netlist network with 31 inputs and 21 outputs.

3.124.5.1. Executing ABC.

3.124.6. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32075$abc$27774$abc$24881$auto$opt_dff.cc:219:make_patterns_logic$4791, asynchronously reset by !\rst_n
Extracted 97 gates and 149 wires to a netlist network with 52 inputs and 26 outputs.

3.124.6.1. Executing ABC.

3.124.7. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32187$abc$27877$abc$21701$flatten\cavlc_read_levels.$verific$n231$761, asynchronously reset by !\rst_n
Extracted 57 gates and 79 wires to a netlist network with 22 inputs and 26 outputs.

3.124.7.1. Executing ABC.

3.124.8. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32303$abc$28089$abc$21653$auto$opt_dff.cc:219:make_patterns_logic$4607, asynchronously reset by !\rst_n
Extracted 36 gates and 47 wires to a netlist network with 11 inputs and 20 outputs.

3.124.8.1. Executing ABC.

3.124.9. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32348$abc$28135$abc$24174$auto$opt_dff.cc:219:make_patterns_logic$4668, asynchronously reset by !\rst_n
Extracted 57 gates and 92 wires to a netlist network with 35 inputs and 17 outputs.

3.124.9.1. Executing ABC.

3.124.10. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$35267$abc$26515$abc$22055$auto$opt_dff.cc:219:make_patterns_logic$5199, asynchronously reset by !\rst_n
Extracted 138 gates and 214 wires to a netlist network with 76 inputs and 72 outputs.

3.124.10.1. Executing ABC.

3.124.11. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32410$abc$28002$abc$23091$auto$opt_dff.cc:219:make_patterns_logic$4894, asynchronously reset by !\rst_n
Extracted 53 gates and 84 wires to a netlist network with 31 inputs and 23 outputs.

3.124.11.1. Executing ABC.

3.124.12. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32467$abc$28199$abc$24677$auto$opt_dff.cc:219:make_patterns_logic$4783, asynchronously reset by !\rst_n
Extracted 15 gates and 27 wires to a netlist network with 12 inputs and 12 outputs.

3.124.12.1. Executing ABC.

3.124.13. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32498$abc$28230$abc$23816$auto$opt_dff.cc:219:make_patterns_logic$5101, asynchronously reset by !\rst_n
Extracted 43 gates and 73 wires to a netlist network with 30 inputs and 21 outputs.

3.124.13.1. Executing ABC.

3.124.14. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32548$abc$28284$abc$24599$auto$opt_dff.cc:219:make_patterns_logic$4767, asynchronously reset by !\rst_n
Extracted 47 gates and 78 wires to a netlist network with 31 inputs and 10 outputs.

3.124.14.1. Executing ABC.

3.124.15. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32608$abc$28325$abc$24373$auto$opt_dff.cc:219:make_patterns_logic$4713, asynchronously reset by !\rst_n
Extracted 58 gates and 95 wires to a netlist network with 37 inputs and 19 outputs.

3.124.15.1. Executing ABC.

3.124.16. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32678$abc$28388$abc$24333$auto$opt_dff.cc:219:make_patterns_logic$4704, asynchronously reset by !\rst_n
Extracted 50 gates and 84 wires to a netlist network with 34 inputs and 13 outputs.

3.124.16.1. Executing ABC.

3.124.17. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32740$abc$28455$abc$24255$auto$opt_dff.cc:219:make_patterns_logic$4686, asynchronously reset by !\rst_n
Extracted 51 gates and 84 wires to a netlist network with 33 inputs and 12 outputs.

3.124.17.1. Executing ABC.

3.124.18. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32800$abc$27596$abc$23753$auto$opt_dff.cc:219:make_patterns_logic$5078, asynchronously reset by !\rst_n
Extracted 44 gates and 72 wires to a netlist network with 28 inputs and 24 outputs.

3.124.18.1. Executing ABC.

3.124.19. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32854$abc$28629$abc$23960$auto$opt_dff.cc:219:make_patterns_logic$5151, asynchronously reset by !\rst_n
Extracted 52 gates and 80 wires to a netlist network with 28 inputs and 22 outputs.

3.124.19.1. Executing ABC.

3.124.20. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32908$abc$28684$abc$24131$auto$opt_dff.cc:219:make_patterns_logic$4659, asynchronously reset by !\rst_n
Extracted 52 gates and 87 wires to a netlist network with 35 inputs and 13 outputs.

3.124.20.1. Executing ABC.

3.124.21. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32970$abc$28749$abc$24525$auto$opt_dff.cc:219:make_patterns_logic$4749, asynchronously reset by !\rst_n
Extracted 47 gates and 77 wires to a netlist network with 30 inputs and 11 outputs.

3.124.21.1. Executing ABC.

3.124.22. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$32244$abc$27939$abc$24452$auto$opt_dff.cc:219:make_patterns_logic$4731, asynchronously reset by !\rst_n
Extracted 54 gates and 88 wires to a netlist network with 34 inputs and 14 outputs.

3.124.22.1. Executing ABC.

3.124.23. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33027$abc$28786$abc$23567$auto$opt_dff.cc:219:make_patterns_logic$5034, asynchronously reset by !\rst_n
Extracted 50 gates and 77 wires to a netlist network with 27 inputs and 24 outputs.

3.124.23.1. Executing ABC.

3.124.24. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33080$abc$28947$abc$24562$auto$opt_dff.cc:219:make_patterns_logic$4758, asynchronously reset by !\rst_n
Extracted 54 gates and 91 wires to a netlist network with 37 inputs and 14 outputs.

3.124.24.1. Executing ABC.

3.124.25. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33145$abc$29007$abc$25135$auto$opt_dff.cc:219:make_patterns_logic$4628, asynchronously reset by !\rst_n
Extracted 85 gates and 105 wires to a netlist network with 20 inputs and 60 outputs.

3.124.25.1. Executing ABC.

3.124.26. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33244$abc$29107$abc$21701$cavlc_read_levels.level_abs_refresh, asynchronously reset by !\rst_n
Extracted 63 gates and 83 wires to a netlist network with 20 inputs and 24 outputs.

3.124.26.1. Executing ABC.

3.124.27. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33308$abc$29172$abc$23672$auto$opt_dff.cc:219:make_patterns_logic$5055, asynchronously reset by !\rst_n
Extracted 52 gates and 81 wires to a netlist network with 29 inputs and 26 outputs.

3.124.27.1. Executing ABC.

3.124.28. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \ena, asynchronously reset by !\rst_n
Extracted 231 gates and 340 wires to a netlist network with 109 inputs and 64 outputs.

3.124.28.1. Executing ABC.

3.124.29. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33635$abc$28516$abc$25031$auto$opt_dff.cc:219:make_patterns_logic$4619, asynchronously reset by !\rst_n
Extracted 66 gates and 80 wires to a netlist network with 14 inputs and 51 outputs.

3.124.29.1. Executing ABC.

3.124.30. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33712$abc$29489$abc$24055$auto$opt_dff.cc:219:make_patterns_logic$5174, asynchronously reset by !\rst_n
Extracted 37 gates and 65 wires to a netlist network with 28 inputs and 19 outputs.

3.124.30.1. Executing ABC.

3.124.31. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33758$abc$29531$abc$23313$auto$opt_dff.cc:219:make_patterns_logic$4965, asynchronously reset by !\rst_n
Extracted 55 gates and 85 wires to a netlist network with 30 inputs and 26 outputs.

3.124.31.1. Executing ABC.

3.124.32. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33811$abc$29582$abc$23406$auto$opt_dff.cc:219:make_patterns_logic$4990, asynchronously reset by !\rst_n
Extracted 54 gates and 84 wires to a netlist network with 30 inputs and 26 outputs.

3.124.32.1. Executing ABC.

3.124.33. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33864$abc$29636$abc$23005$auto$opt_dff.cc:219:make_patterns_logic$4867, asynchronously reset by !\rst_n
Extracted 54 gates and 82 wires to a netlist network with 28 inputs and 26 outputs.

3.124.33.1. Executing ABC.

3.124.34. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33920$abc$29692$abc$23158$auto$opt_dff.cc:219:make_patterns_logic$4917, asynchronously reset by !\rst_n
Extracted 40 gates and 66 wires to a netlist network with 26 inputs and 21 outputs.

3.124.34.1. Executing ABC.

3.124.35. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$33971$abc$29743$abc$21701$flatten\cavlc_read_levels.$verific$n474$778, asynchronously reset by !\rst_n
Extracted 178 gates and 216 wires to a netlist network with 38 inputs and 20 outputs.

3.124.35.1. Executing ABC.

3.124.36. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$34144$abc$29904$abc$22916$auto$opt_dff.cc:219:make_patterns_logic$4840, asynchronously reset by !\rst_n
Extracted 50 gates and 86 wires to a netlist network with 36 inputs and 26 outputs.

3.124.36.1. Executing ABC.

3.124.37. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$34200$abc$29959$abc$24294$auto$opt_dff.cc:219:make_patterns_logic$4695, asynchronously reset by !\rst_n
Extracted 54 gates and 90 wires to a netlist network with 36 inputs and 14 outputs.

3.124.37.1. Executing ABC.

3.124.38. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$34262$abc$30025$abc$24709$auto$opt_dff.cc:194:make_patterns_logic$4786, asynchronously reset by !\rst_n
Extracted 492 gates and 562 wires to a netlist network with 70 inputs and 24 outputs.

3.124.38.1. Executing ABC.

3.124.39. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$34749$abc$30509$abc$22819$auto$opt_dff.cc:219:make_patterns_logic$4817, asynchronously reset by !\rst_n
Extracted 47 gates and 77 wires to a netlist network with 30 inputs and 24 outputs.

3.124.39.1. Executing ABC.

3.124.40. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$34803$abc$30566$abc$23894$auto$opt_dff.cc:219:make_patterns_logic$5126, asynchronously reset by !\rst_n
Extracted 58 gates and 93 wires to a netlist network with 35 inputs and 25 outputs.

3.124.40.1. Executing ABC.

3.124.41. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$34864$abc$30738$abc$24214$auto$opt_dff.cc:219:make_patterns_logic$4677, asynchronously reset by !\rst_n
Extracted 54 gates and 90 wires to a netlist network with 36 inputs and 13 outputs.

3.124.41.1. Executing ABC.

3.124.42. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$34936$abc$30781$abc$25002$auto$opt_dff.cc:219:make_patterns_logic$4612, asynchronously reset by !\rst_n
Extracted 22 gates and 32 wires to a netlist network with 10 inputs and 12 outputs.

3.124.42.1. Executing ABC.

3.124.43. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$34964$abc$30809$abc$24637$auto$opt_dff.cc:219:make_patterns_logic$4776, asynchronously reset by !\rst_n
Extracted 62 gates and 103 wires to a netlist network with 41 inputs and 18 outputs.

3.124.43.1. Executing ABC.

3.124.44. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$35034$abc$30876$abc$24413$auto$opt_dff.cc:219:make_patterns_logic$4722, asynchronously reset by !\rst_n
Extracted 51 gates and 86 wires to a netlist network with 35 inputs and 12 outputs.

3.124.44.1. Executing ABC.

3.124.45. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$35095$abc$30937$abc$24487$auto$opt_dff.cc:219:make_patterns_logic$4740, asynchronously reset by !\rst_n
Extracted 54 gates and 90 wires to a netlist network with 36 inputs and 14 outputs.

3.124.45.1. Executing ABC.

3.124.46. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$35158$abc$28836$abc$25245$auto$opt_dff.cc:219:make_patterns_logic$4639, asynchronously reset by !\rst_n
Extracted 91 gates and 112 wires to a netlist network with 21 inputs and 66 outputs.

3.124.46.1. Executing ABC.

3.124.47. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$35422$abc$31059$abc$26477$auto$opt_dff.cc:219:make_patterns_logic$4650, asynchronously reset by !\rst_n
Extracted 228 gates and 360 wires to a netlist network with 132 inputs and 20 outputs.

3.124.47.1. Executing ABC.

yosys> opt_ffinv

3.125. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
<suppressed ~18 debug messages>

yosys> opt_merge -nomux

3.127. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
<suppressed ~303 debug messages>
Removed a total of 101 cells.

yosys> opt_muxtree

3.128. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.129. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.130. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_share

3.131. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.132. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.133. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 0 unused cells and 23826 unused wires.
<suppressed ~61 debug messages>

yosys> opt_expr

3.134. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.135. Executing BMUXMAP pass.

yosys> demuxmap

3.136. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_1fbpHM/abc_tmp_1.scr

3.137. Executing ABC pass (technology mapping using ABC).

3.137.1. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Extracted 3679 gates and 3953 wires to a netlist network with 274 inputs and 309 outputs.

3.137.1.1. Executing ABC.
DE:   #PIs = 274  #Luts =  1014  Max Lvl =  16  Avg Lvl =   7.18  [   0.35 sec. at Pass 0]
DE:   #PIs = 274  #Luts =   812  Max Lvl =  17  Avg Lvl =   5.13  [   8.28 sec. at Pass 1]
DE:   #PIs = 274  #Luts =   794  Max Lvl =  15  Avg Lvl =   4.96  [   2.20 sec. at Pass 2]
DE:   #PIs = 274  #Luts =   785  Max Lvl =  16  Avg Lvl =   4.96  [   4.97 sec. at Pass 3]
DE:   #PIs = 274  #Luts =   771  Max Lvl =  13  Avg Lvl =   4.76  [   2.14 sec. at Pass 4]
DE:   #PIs = 274  #Luts =   764  Max Lvl =  15  Avg Lvl =   4.86  [   6.50 sec. at Pass 5]
DE:   #PIs = 274  #Luts =   761  Max Lvl =  13  Avg Lvl =   4.75  [   3.76 sec. at Pass 6]
DE:   #PIs = 274  #Luts =   749  Max Lvl =  14  Avg Lvl =   4.85  [   5.58 sec. at Pass 7]
DE:   #PIs = 274  #Luts =   749  Max Lvl =  14  Avg Lvl =   4.85  [   3.68 sec. at Pass 8]
DE:   #PIs = 274  #Luts =   749  Max Lvl =  14  Avg Lvl =   4.85  [   7.33 sec. at Pass 9]
DE:   #PIs = 274  #Luts =   749  Max Lvl =  14  Avg Lvl =   4.85  [   3.41 sec. at Pass 10]
DE:   #PIs = 274  #Luts =   749  Max Lvl =  14  Avg Lvl =   4.85  [   1.41 sec. at Pass 11]

yosys> opt_expr

3.138. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.

yosys> opt_merge -nomux

3.139. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.140. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.141. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.142. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_share

3.143. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.144. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.145. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 0 unused cells and 3885 unused wires.
<suppressed ~16 debug messages>

yosys> opt_expr

3.146. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.147. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.148. Printing statistics.

=== cavlc ===

   Number of wires:               1070
   Number of wire bits:           1714
   Number of public wires:         132
   Number of public wire bits:     776
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1139
     $_DFFE_PN0P_                  391
     $lut                          748


yosys> shregmap -minlen 8 -maxlen 20

3.149. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.150. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.151. Printing statistics.

=== cavlc ===

   Number of wires:               1070
   Number of wire bits:           1714
   Number of public wires:         132
   Number of public wire bits:     776
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1139
     $_DFFE_PN0P_                  391
     $lut                          748


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.152. Executing TECHMAP pass (map to technology primitives).

3.152.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.152.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.152.3. Continuing TECHMAP pass.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~1275 debug messages>

yosys> opt_expr -mux_undef

3.153. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
<suppressed ~18712 debug messages>

yosys> simplemap

3.154. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.155. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.

yosys> opt_merge

3.156. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
<suppressed ~5274 debug messages>
Removed a total of 1758 cells.

yosys> opt_dff -nodffe -nosdff

3.157. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.158. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 0 unused cells and 3537 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.159. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
<suppressed ~400 debug messages>

yosys> opt_merge -nomux

3.160. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.161. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.162. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.163. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_share

3.164. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.165. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.166. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 0 unused cells and 120 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.167. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_1fbpHM/abc_tmp_2.scr

3.168. Executing ABC pass (technology mapping using ABC).

3.168.1. Extracting gate netlist of module `\cavlc' to `<abc-temp-dir>/input.blif'..
Extracted 3226 gates and 3502 wires to a netlist network with 274 inputs and 308 outputs.

3.168.1.1. Executing ABC.
DE:   #PIs = 274  #Luts =   747  Max Lvl =  13  Avg Lvl =   4.85  [   0.24 sec. at Pass 0]
DE:   #PIs = 274  #Luts =   747  Max Lvl =  13  Avg Lvl =   4.85  [   7.89 sec. at Pass 1]
DE:   #PIs = 274  #Luts =   747  Max Lvl =  13  Avg Lvl =   4.85  [   1.96 sec. at Pass 2]
DE:   #PIs = 274  #Luts =   743  Max Lvl =  14  Avg Lvl =   4.76  [   5.03 sec. at Pass 3]
DE:   #PIs = 274  #Luts =   743  Max Lvl =  14  Avg Lvl =   4.76  [   3.15 sec. at Pass 4]
DE:   #PIs = 274  #Luts =   741  Max Lvl =  14  Avg Lvl =   4.79  [   5.50 sec. at Pass 5]
DE:   #PIs = 274  #Luts =   740  Max Lvl =  14  Avg Lvl =   4.80  [   3.05 sec. at Pass 6]
DE:   #PIs = 274  #Luts =   740  Max Lvl =  14  Avg Lvl =   4.80  [   3.95 sec. at Pass 7]
DE:   #PIs = 274  #Luts =   740  Max Lvl =  14  Avg Lvl =   4.80  [   3.25 sec. at Pass 8]
DE:   #PIs = 274  #Luts =   740  Max Lvl =  13  Avg Lvl =   4.81  [   4.79 sec. at Pass 9]
DE:   #PIs = 274  #Luts =   739  Max Lvl =  14  Avg Lvl =   4.80  [   3.33 sec. at Pass 10]
DE:   #PIs = 274  #Luts =   738  Max Lvl =  14  Avg Lvl =   4.77  [   6.55 sec. at Pass 11]
DE:   #PIs = 274  #Luts =   738  Max Lvl =  12  Avg Lvl =   4.75  [   4.03 sec. at Pass 12]
DE:   #PIs = 274  #Luts =   735  Max Lvl =  14  Avg Lvl =   4.78  [   4.15 sec. at Pass 13]
DE:   #PIs = 274  #Luts =   735  Max Lvl =  12  Avg Lvl =   4.82  [   1.94 sec. at Pass 14]
DE:   #PIs = 274  #Luts =   735  Max Lvl =  12  Avg Lvl =   4.82  [   3.61 sec. at Pass 15]
DE:   #PIs = 274  #Luts =   734  Max Lvl =  12  Avg Lvl =   4.73  [   2.91 sec. at Pass 16]
DE:   #PIs = 274  #Luts =   731  Max Lvl =  14  Avg Lvl =   4.81  [   5.33 sec. at Pass 17]
DE:   #PIs = 274  #Luts =   731  Max Lvl =  14  Avg Lvl =   4.81  [   4.36 sec. at Pass 18]
DE:   #PIs = 274  #Luts =   729  Max Lvl =  14  Avg Lvl =   4.81  [   4.42 sec. at Pass 19]
DE:   #PIs = 274  #Luts =   729  Max Lvl =  13  Avg Lvl =   4.79  [   3.72 sec. at Pass 20]
DE:   #PIs = 274  #Luts =   725  Max Lvl =  14  Avg Lvl =   4.82  [   5.94 sec. at Pass 21]
DE:   #PIs = 274  #Luts =   725  Max Lvl =  14  Avg Lvl =   4.82  [   5.37 sec. at Pass 22]
DE:   #PIs = 274  #Luts =   725  Max Lvl =  14  Avg Lvl =   4.82  [   7.87 sec. at Pass 23]
DE:   #PIs = 274  #Luts =   724  Max Lvl =  13  Avg Lvl =   4.80  [   5.97 sec. at Pass 24]
DE:   #PIs = 274  #Luts =   724  Max Lvl =  13  Avg Lvl =   4.80  [  11.80 sec. at Pass 25]
DE:   #PIs = 274  #Luts =   722  Max Lvl =  12  Avg Lvl =   4.80  [   3.35 sec. at Pass 26]
DE:   #PIs = 274  #Luts =   722  Max Lvl =  12  Avg Lvl =   4.80  [   6.00 sec. at Pass 27]
DE:   #PIs = 274  #Luts =   722  Max Lvl =  12  Avg Lvl =   4.80  [   2.21 sec. at Pass 28]
DE:   #PIs = 274  #Luts =   722  Max Lvl =  12  Avg Lvl =   4.80  [   4.57 sec. at Pass 29]
DE:   #PIs = 274  #Luts =   722  Max Lvl =  12  Avg Lvl =   4.80  [   1.09 sec. at Pass 30]

yosys> opt_expr

3.169. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.

yosys> opt_merge -nomux

3.170. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.171. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \cavlc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.172. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \cavlc.
Performed a total of 0 changes.

yosys> opt_merge

3.173. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\cavlc'.
Removed a total of 0 cells.

yosys> opt_share

3.174. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.175. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.176. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 0 unused cells and 2694 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.177. Executing OPT_EXPR pass (perform const folding).
Optimizing module cavlc.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.178. Executing HIERARCHY pass (managing design hierarchy).

3.178.1. Analyzing design hierarchy..
Top module:  \cavlc

3.178.2. Analyzing design hierarchy..
Top module:  \cavlc
Removed 0 unused modules.

yosys> stat

3.179. Printing statistics.

=== cavlc ===

   Number of wires:               1044
   Number of wire bits:           1688
   Number of public wires:         132
   Number of public wire bits:     776
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1113
     $lut                          722
     dffsre                        391


yosys> opt_clean -purge

3.180. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \cavlc..
Removed 0 unused cells and 93 unused wires.
<suppressed ~93 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.181. Executing Verilog backend.
Dumping module `\cavlc'.

Warnings: 74 unique messages, 75 total
End of script. Logfile hash: 4694523e7a, CPU: user 28.71s system 1.37s, MEM: 82.48 MB peak
Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)
Time spent: 97% 6x abc (836 sec), 0% 24x opt_dff (6 sec), ...
real 267.27
user 783.89
sys 75.66
