
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.50
 Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Tue May 31 17:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k atahost.v atahost_controller.v atahost_pio_tctrl.v atahost_top.v atahost_wb_slave.v ro_cnt.v timescale.v ud_cnt.v

yosys> verific -vlog2k atahost.v atahost_controller.v atahost_pio_tctrl.v atahost_top.v atahost_wb_slave.v ro_cnt.v timescale.v ud_cnt.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Tue May 31 17:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost.v'
VERIFIC-INFO [VERI-2561] atahost.v:192: undeclared symbol 'PIOsel', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_controller.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_pio_tctrl.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_top.v'
VERIFIC-INFO [VERI-2561] atahost_top.v:191: undeclared symbol 'PIOsel', assumed default net type 'wire'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'atahost_wb_slave.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ro_cnt.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'timescale.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ud_cnt.v'

yosys> synth_rs -top atahost_top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.59

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top atahost_top

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] atahost_top.v:83: compiling module 'atahost_top'
VERIFIC-INFO [VERI-1018] atahost_wb_slave.v:52: compiling module 'atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)'
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:241: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:265: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:266: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:270: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:271: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:274: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:297: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:298: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:302: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:303: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:307: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:308: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:330: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:331: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:332: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:333: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:337: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:338: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:339: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:340: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:344: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:345: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:346: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:347: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:354: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:355: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:356: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:357: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:361: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:362: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:363: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:364: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:368: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:369: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:370: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:371: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:378: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:379: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:380: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:381: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:385: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:386: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:387: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:388: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:392: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:393: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:394: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:395: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:402: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:403: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:404: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:408: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:409: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:410: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:414: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:415: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:416: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:423: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:424: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:425: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:429: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:430: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:431: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:435: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:436: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_wb_slave.v:437: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] atahost_controller.v:63: compiling module 'atahost_controller'
VERIFIC-WARNING [VERI-2371] atahost_controller.v:161: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:162: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:164: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:165: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:172: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:173: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:174: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:175: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:176: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:177: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:178: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:179: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:183: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:184: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:185: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:186: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:187: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:188: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:190: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:194: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:195: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:196: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:197: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:199: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:200: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:201: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:202: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:214: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:220: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:221: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:225: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:226: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:230: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:231: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] atahost_pio_tctrl.v:91: compiling module 'atahost_pio_tctrl'
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:156: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:157: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:161: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:162: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:166: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:167: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=6)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=6)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:189: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:190: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:191: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:195: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:196: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:197: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:201: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:202: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:203: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=28)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=28)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:223: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:225: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:227: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_pio_tctrl.v:233: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=2)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=2)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ro_cnt.v:57: compiling module 'ro_cnt(ID=23)'
VERIFIC-WARNING [VERI-2371] ro_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ro_cnt.v:89: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] ud_cnt.v:55: compiling module 'ud_cnt(RESD=23)'
VERIFIC-WARNING [VERI-2371] ud_cnt.v:85: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] ud_cnt.v:91: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] atahost_controller.v:263: delay control is not supported for synthesis
Importing module atahost_top.
Importing module atahost_controller.
Importing module atahost_pio_tctrl.
Importing module atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
Importing module ro_cnt(ID=2).
Importing module ro_cnt(ID=23).
Importing module ro_cnt(ID=28).
Importing module ro_cnt(ID=6).
Importing module ud_cnt(RESD=2).
Importing module ud_cnt(RESD=23).
Importing module ud_cnt(RESD=28).
Importing module ud_cnt(RESD=6).

3.3.1. Analyzing design hierarchy..
Top module:  \atahost_top
Used module:     \atahost_controller
Used module:         \atahost_pio_tctrl
Used module:             \ro_cnt(ID=23)
Used module:                 \ud_cnt(RESD=23)
Used module:             \ro_cnt(ID=2)
Used module:                 \ud_cnt(RESD=2)
Used module:             \ro_cnt(ID=28)
Used module:                 \ud_cnt(RESD=28)
Used module:             \ro_cnt(ID=6)
Used module:                 \ud_cnt(RESD=6)
Used module:     \atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)

3.3.2. Analyzing design hierarchy..
Top module:  \atahost_top
Used module:     \atahost_controller
Used module:         \atahost_pio_tctrl
Used module:             \ro_cnt(ID=23)
Used module:                 \ud_cnt(RESD=23)
Used module:             \ro_cnt(ID=2)
Used module:                 \ud_cnt(RESD=2)
Used module:             \ro_cnt(ID=28)
Used module:                 \ud_cnt(RESD=28)
Used module:             \ro_cnt(ID=6)
Used module:                 \ud_cnt(RESD=6)
Used module:     \atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0)
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module ud_cnt(RESD=6).
<suppressed ~2 debug messages>
Optimizing module ud_cnt(RESD=28).
<suppressed ~2 debug messages>
Optimizing module ud_cnt(RESD=23).
<suppressed ~2 debug messages>
Optimizing module ud_cnt(RESD=2).
<suppressed ~2 debug messages>
Optimizing module ro_cnt(ID=6).
<suppressed ~1 debug messages>
Optimizing module ro_cnt(ID=28).
<suppressed ~1 debug messages>
Optimizing module ro_cnt(ID=23).
<suppressed ~1 debug messages>
Optimizing module ro_cnt(ID=2).
<suppressed ~1 debug messages>
Optimizing module atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
<suppressed ~28 debug messages>
Optimizing module atahost_pio_tctrl.
<suppressed ~10 debug messages>
Optimizing module atahost_controller.
<suppressed ~12 debug messages>
Optimizing module atahost_top.

yosys> bmuxmap

3.5. Executing BMUXMAP pass.

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).
Deleting now unused module atahost_controller.
Deleting now unused module atahost_pio_tctrl.
Deleting now unused module atahost_wb_slave(DeviceId=4'b01,DMA_mode0_Tm=0,DMA_mode0_Td=0,DMA_mode0_Teoc=0).
Deleting now unused module ro_cnt(ID=2).
Deleting now unused module ro_cnt(ID=23).
Deleting now unused module ro_cnt(ID=28).
Deleting now unused module ro_cnt(ID=6).
Deleting now unused module ud_cnt(RESD=2).
Deleting now unused module ud_cnt(RESD=23).
Deleting now unused module ud_cnt(RESD=28).
Deleting now unused module ud_cnt(RESD=6).
<suppressed ~11 debug messages>

yosys> bmuxmap

3.8. Executing BMUXMAP pass.

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~9 debug messages>

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 19 unused cells and 694 unused wires.
<suppressed ~136 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module atahost_top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.15. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.15.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~4 debug messages>

yosys> opt_merge -nomux

3.15.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.15.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~49 debug messages>

yosys> opt_reduce

3.15.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
    New ctrl vector for $pmux cell $flatten\u0.$verific$select_313$atahost_wb_slave.v:476$949: { $flatten\u0.$verific$n37$653 $flatten\u0.$verific$n41$655 $flatten\u0.$verific$n45$657 $flatten\u0.$verific$n49$659 $flatten\u0.$verific$n53$661 $flatten\u0.$verific$n57$663 $flatten\u0.$verific$n61$665 }
  Optimizing cells in module \atahost_top.
Performed a total of 1 changes.

yosys> opt_merge

3.15.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.6. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1216 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t2_cnt.$verific$rci_reg$ro_cnt.v:89$1059 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Teoc_reg$atahost_wb_slave.v:438$938 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1245 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\t1_cnt.$verific$rci_reg$ro_cnt.v:89$1104 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Td_reg$atahost_wb_slave.v:438$937 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1187 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\eoc_cnt.$verific$rci_reg$ro_cnt.v:89$1014 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Tm_reg$atahost_wb_slave.v:417$927 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Teoc_reg$atahost_wb_slave.v:417$929 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$Qi_reg$ud_cnt.v:91$1158 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.\dhold_cnt.$verific$rci_reg$ro_cnt.v:89$969 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev0_Td_reg$atahost_wb_slave.v:417$928 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$CtrlReg_reg$atahost_wb_slave.v:274$848 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$oe_reg$atahost_pio_tctrl.v:204$574 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$hold_go_reg$atahost_pio_tctrl.v:168$535 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$hT2done_reg$atahost_pio_tctrl.v:227$593 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$busy_reg$atahost_pio_tctrl.v:168$534 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$DIOW_reg$atahost_pio_tctrl.v:204$573 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.\PIO_timing_controller.$verific$DIOR_reg$atahost_pio_tctrl.v:204$572 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$dPIOreq_reg$atahost_controller.v:232$412 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$RESETn_reg$atahost_controller.v:203$392 ($aldff) from module atahost_top.
Removing never-active async load on $flatten\u1.$verific$PIOq_reg$atahost_controller.v:214$402 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$PIOgo_reg$atahost_controller.v:232$413 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DIOWn_reg$atahost_controller.v:203$394 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DIORn_reg$atahost_controller.v:203$393 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DDoe_reg$atahost_controller.v:203$399 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DDo_reg$atahost_controller.v:203$398 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$DA_reg$atahost_controller.v:203$395 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$CS1n_reg$atahost_controller.v:203$397 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u1.$verific$CS0n_reg$atahost_controller.v:203$396 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$inti_reg$atahost_wb_slave.v:309$873 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$dirq_reg$atahost_wb_slave.v:309$874 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_Teoc_reg$atahost_wb_slave.v:396$919 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T4_reg$atahost_wb_slave.v:396$918 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T2_reg$atahost_wb_slave.v:396$917 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport1_T1_reg$atahost_wb_slave.v:396$916 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_Teoc_reg$atahost_wb_slave.v:372$907 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T4_reg$atahost_wb_slave.v:372$906 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T2_reg$atahost_wb_slave.v:372$905 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_dport0_T1_reg$atahost_wb_slave.v:372$904 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_Teoc_reg$atahost_wb_slave.v:348$895 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T4_reg$atahost_wb_slave.v:348$894 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T2_reg$atahost_wb_slave.v:348$893 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$PIO_cmdport_T1_reg$atahost_wb_slave.v:348$892 ($aldff) from module atahost_top.
Changing const-value async load to async reset on $flatten\u0.$verific$DMA_dev1_Tm_reg$atahost_wb_slave.v:438$936 ($aldff) from module atahost_top.

yosys> opt_clean

3.15.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 3 unused cells and 8 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.15.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.15.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.15.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~49 debug messages>

yosys> opt_reduce

3.15.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.15.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.15.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.15.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.15.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.16. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.16.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.16.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.16.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.16.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> fsm_opt

3.16.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.16.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.16.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.16.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat -nosdff

3.17. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.17.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.17.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~49 debug messages>

yosys> opt_reduce

3.17.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.17.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.17.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\u1.$verific$PIOq_reg$atahost_controller.v:214$402 ($dff) from module atahost_top (D = \dd_pad_i, Q = \u1.PIOq).
Adding EN signal on $flatten\u0.$verific$store_pp_full_reg$atahost_wb_slave.v:241$816 ($dff) from module atahost_top (D = 1'0, Q = \u0.store_pp_full).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_Teoc_reg$atahost_wb_slave.v:396$919 ($adff) from module atahost_top (D = $flatten\u0.$verific$n946$768, Q = \u0.PIO_dport1_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T4_reg$atahost_wb_slave.v:396$918 ($adff) from module atahost_top (D = $flatten\u0.$verific$n937$767, Q = \u0.PIO_dport1_T4).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T2_reg$atahost_wb_slave.v:396$917 ($adff) from module atahost_top (D = $flatten\u0.$verific$n928$766, Q = \u0.PIO_dport1_T2).
Adding EN signal on $flatten\u0.$verific$PIO_dport1_T1_reg$atahost_wb_slave.v:396$916 ($adff) from module atahost_top (D = $flatten\u0.$verific$n919$765, Q = \u0.PIO_dport1_T1).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_Teoc_reg$atahost_wb_slave.v:372$907 ($adff) from module atahost_top (D = $flatten\u0.$verific$n727$760, Q = \u0.PIO_dport0_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T4_reg$atahost_wb_slave.v:372$906 ($adff) from module atahost_top (D = $flatten\u0.$verific$n718$759, Q = \u0.PIO_dport0_T4).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T2_reg$atahost_wb_slave.v:372$905 ($adff) from module atahost_top (D = $flatten\u0.$verific$n709$758, Q = \u0.PIO_dport0_T2).
Adding EN signal on $flatten\u0.$verific$PIO_dport0_T1_reg$atahost_wb_slave.v:372$904 ($adff) from module atahost_top (D = $flatten\u0.$verific$n700$757, Q = \u0.PIO_dport0_T1).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_Teoc_reg$atahost_wb_slave.v:348$895 ($adff) from module atahost_top (D = $flatten\u0.$verific$n508$752, Q = \u0.PIO_cmdport_Teoc).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T4_reg$atahost_wb_slave.v:348$894 ($adff) from module atahost_top (D = $flatten\u0.$verific$n499$751, Q = \u0.PIO_cmdport_T4).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T2_reg$atahost_wb_slave.v:348$893 ($adff) from module atahost_top (D = $flatten\u0.$verific$n490$750, Q = \u0.PIO_cmdport_T2).
Adding EN signal on $flatten\u0.$verific$PIO_cmdport_T1_reg$atahost_wb_slave.v:348$892 ($adff) from module atahost_top (D = $flatten\u0.$verific$n481$749, Q = \u0.PIO_cmdport_T1).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Tm_reg$atahost_wb_slave.v:438$936 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1267$779, Q = \u0.DMA_dev1_Tm).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Teoc_reg$atahost_wb_slave.v:438$938 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1285$781, Q = \u0.DMA_dev1_Teoc).
Adding EN signal on $flatten\u0.$verific$DMA_dev1_Td_reg$atahost_wb_slave.v:438$937 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1276$780, Q = \u0.DMA_dev1_Td).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Tm_reg$atahost_wb_slave.v:417$927 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1102$773, Q = \u0.DMA_dev0_Tm).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Teoc_reg$atahost_wb_slave.v:417$929 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1120$775, Q = \u0.DMA_dev0_Teoc).
Adding EN signal on $flatten\u0.$verific$DMA_dev0_Td_reg$atahost_wb_slave.v:417$928 ($adff) from module atahost_top (D = $flatten\u0.$verific$n1111$774, Q = \u0.DMA_dev0_Td).
Adding EN signal on $flatten\u0.$verific$CtrlReg_reg$atahost_wb_slave.v:274$848 ($adff) from module atahost_top (D = $flatten\u0.$verific$n199$736, Q = \u0.CtrlReg).
Setting constant 0-bit at position 0 on $auto$ff.cc:262:slice$1249 ($dffe) from module atahost_top.

yosys> opt_clean

3.17.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 2 unused cells and 2 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.17.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~21 debug messages>

3.17.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.17.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~47 debug messages>

yosys> opt_reduce

3.17.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.17.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~39 debug messages>
Removed a total of 13 cells.

yosys> opt_dff -sat -nosdff

3.17.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.17.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 15 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.17.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.17.16. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.17.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~47 debug messages>

yosys> opt_reduce

3.17.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.17.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.17.20. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.17.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.17.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.17.23. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.18. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1177 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1177 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1148 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1148 ($sub).
Removed top 1 bits (of 9) from port A of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1206 ($sub).
Removed top 8 bits (of 9) from port B of cell atahost_top.$flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1206 ($sub).
Removed top 3 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_40$atahost_wb_slave.v:251$824 ($eq).
Removed top 2 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_44$atahost_wb_slave.v:252$827 ($eq).
Removed top 2 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_48$atahost_wb_slave.v:253$830 ($eq).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_52$atahost_wb_slave.v:254$833 ($eq).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_56$atahost_wb_slave.v:255$836 ($eq).
Removed top 1 bits (of 4) from port B of cell atahost_top.$flatten\u0.$verific$equal_60$atahost_wb_slave.v:256$839 ($eq).

yosys> peepopt

3.19. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.20. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> bmuxmap

3.21. Executing BMUXMAP pass.

yosys> demuxmap

3.22. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.23. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module atahost_top:
  creating $macc model for $flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1148 ($sub).
  creating $macc model for $flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1177 ($sub).
  creating $macc model for $flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235 ($sub).
  creating $macc model for $flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1206 ($sub).
  creating $alu model for $macc $flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1206.
  creating $alu model for $macc $flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235.
  creating $alu model for $macc $flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1177.
  creating $alu model for $macc $flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1148.
  creating $alu cell for $flatten\u1.\PIO_timing_controller.\dhold_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1148: $auto$alumacc.cc:485:replace_alu$1307
  creating $alu cell for $flatten\u1.\PIO_timing_controller.\eoc_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1177: $auto$alumacc.cc:485:replace_alu$1310
  creating $alu cell for $flatten\u1.\PIO_timing_controller.\t1_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1235: $auto$alumacc.cc:485:replace_alu$1313
  creating $alu cell for $flatten\u1.\PIO_timing_controller.\t2_cnt.\cnt.$verific$sub_4$ud_cnt.v:80$1206: $auto$alumacc.cc:485:replace_alu$1316
  created 4 $alu and 0 $macc cells.

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.25. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~47 debug messages>

yosys> opt_reduce

3.27. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.28. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.29. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.30. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.32. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> stat

3.33. Printing statistics.

=== atahost_top ===

   Number of wires:                423
   Number of wire bits:           1701
   Number of public wires:         272
   Number of public wire bits:    1099
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                220
     $adff                          26
     $adffe                         19
     $alu                            4
     $and                           39
     $dff                            6
     $dffe                           1
     $eq                             6
     $logic_not                      1
     $mux                           70
     $not                           24
     $or                            15
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    6


yosys> memory -nomap

3.34. Executing MEMORY pass.

yosys> opt_mem

3.34.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.34.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.34.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.34.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.34.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.34.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> memory_share

3.34.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.34.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.34.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> memory_collect

3.34.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.35. Printing statistics.

=== atahost_top ===

   Number of wires:                423
   Number of wire bits:           1701
   Number of public wires:         272
   Number of public wire bits:    1099
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                220
     $adff                          26
     $adffe                         19
     $alu                            4
     $and                           39
     $dff                            6
     $dffe                           1
     $eq                             6
     $logic_not                      1
     $mux                           70
     $not                           24
     $or                            15
     $pmux                           1
     $reduce_and                     2
     $reduce_bool                    6


yosys> muxpack

3.36. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~57 debug messages>

yosys> opt_clean

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> pmuxtree

3.38. Executing PMUXTREE pass.

yosys> muxpack

3.39. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~63 debug messages>

yosys> memory_map

3.40. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.41. Printing statistics.

=== atahost_top ===

   Number of wires:                435
   Number of wire bits:           1930
   Number of public wires:         272
   Number of public wire bits:    1099
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                231
     $adff                          26
     $adffe                         19
     $alu                            4
     $and                           39
     $dff                            6
     $dffe                           1
     $eq                             6
     $logic_not                      1
     $mux                           77
     $not                           25
     $or                            17
     $reduce_and                     2
     $reduce_bool                    6
     $reduce_or                      2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.42. Executing TECHMAP pass (map to technology primitives).

3.42.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.42.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.42.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $not.
Using template $paramod$19189243523493d505a4933d1bad417c570ea8a6\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
Using extmapper simplemap for cells of type $xor.
No more expansions possible.
<suppressed ~671 debug messages>

yosys> stat

3.43. Printing statistics.

=== atahost_top ===

   Number of wires:                659
   Number of wire bits:           7099
   Number of public wires:         272
   Number of public wire bits:    1099
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1436
     $_AND_                        147
     $_DFFE_PN0P_                  145
     $_DFFE_PN1P_                   31
     $_DFFE_PP_                     16
     $_DFF_PN0_                     57
     $_DFF_PN1_                     14
     $_DFF_P_                        6
     $_MUX_                        748
     $_NOT_                         68
     $_OR_                         104
     $_XOR_                        100


yosys> opt_expr

3.44. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~328 debug messages>

yosys> opt_merge -nomux

3.45. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~57 debug messages>
Removed a total of 19 cells.

yosys> opt_muxtree

3.46. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.47. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.48. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.49. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.50. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 4 unused cells and 179 unused wires.
<suppressed ~9 debug messages>

yosys> opt_expr

3.52. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_muxtree

3.53. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.54. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.55. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.56. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.57. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.59. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 2

yosys> opt -nodffe -fast -full -nosdff

3.60. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.60.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~223 debug messages>

yosys> opt_merge

3.60.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~447 debug messages>
Removed a total of 149 cells.

yosys> opt_dff -nodffe -nosdff

3.60.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.60.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 31 unused wires.
<suppressed ~1 debug messages>

3.60.5. Finished fast OPT passes.

yosys> techmap -map +/techmap.v

3.61. Executing TECHMAP pass (map to technology primitives).

3.61.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.61.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -nodffe -sat -nosdff

3.62. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.62.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.62.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.62.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.62.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.62.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat -nosdff

3.62.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.62.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.62.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.62.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.63. Executing ABC pass (technology mapping using ABC).

3.63.1. Summary of detected clock domains:
  104 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1251, arst=!\arst_i, srst={ }
  37 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1263, arst=!\arst_i, srst={ }
  162 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1275, arst=!\arst_i, srst={ }
  61 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1287, arst=!\arst_i, srst={ }
  30 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1296, arst=!\arst_i, srst={ }
  95 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1305, arst=!\arst_i, srst={ }
  23 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  295 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  134 cells in clk=\wb_clk_i, en=\u1.PIO_timing_controller.dstrb, arst={ }, srst={ }

3.63.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1251, asynchronously reset by !\arst_i
Extracted 104 gates and 176 wires to a netlist network with 71 inputs and 69 outputs.

3.63.2.1. Executing ABC.

3.63.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1263, asynchronously reset by !\arst_i
Extracted 37 gates and 74 wires to a netlist network with 37 inputs and 34 outputs.

3.63.3.1. Executing ABC.

3.63.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1275, asynchronously reset by !\arst_i
Extracted 162 gates and 264 wires to a netlist network with 101 inputs and 86 outputs.

3.63.4.1. Executing ABC.

3.63.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1287, asynchronously reset by !\arst_i
Extracted 61 gates and 114 wires to a netlist network with 52 inputs and 35 outputs.

3.63.5.1. Executing ABC.

3.63.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1296, asynchronously reset by !\arst_i
Extracted 30 gates and 59 wires to a netlist network with 29 inputs and 28 outputs.

3.63.6.1. Executing ABC.

3.63.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1305, asynchronously reset by !\arst_i
Extracted 95 gates and 154 wires to a netlist network with 58 inputs and 55 outputs.

3.63.7.1. Executing ABC.

3.63.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 23 gates and 38 wires to a netlist network with 15 inputs and 11 outputs.

3.63.8.1. Executing ABC.

3.63.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 295 gates and 378 wires to a netlist network with 82 inputs and 93 outputs.

3.63.9.1. Executing ABC.

3.63.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3878$lo0
Extracted 134 gates and 279 wires to a netlist network with 144 inputs and 33 outputs.

3.63.10.1. Executing ABC.

yosys> abc -dff

3.64. Executing ABC pass (technology mapping using ABC).

3.64.1. Summary of detected clock domains:
  91 cells in clk=\wb_clk_i, en=$abc$3284$auto$opt_dff.cc:194:make_patterns_logic$1263, arst=!\arst_i, srst={ }
  141 cells in clk=\wb_clk_i, en=$abc$3385$auto$opt_dff.cc:194:make_patterns_logic$1275, arst=!\arst_i, srst={ }
  52 cells in clk=\wb_clk_i, en=$abc$3590$auto$opt_dff.cc:194:make_patterns_logic$1287, arst=!\arst_i, srst={ }
  42 cells in clk=\wb_clk_i, en=$abc$3675$auto$opt_dff.cc:194:make_patterns_logic$1296, arst=!\arst_i, srst={ }
  79 cells in clk=\wb_clk_i, en=$abc$3753$auto$opt_dff.cc:194:make_patterns_logic$1305, arst=!\arst_i, srst={ }
  57 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  279 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  81 cells in clk=\wb_clk_i, en=$abc$3139$auto$opt_dff.cc:194:make_patterns_logic$1251, arst=!\arst_i, srst={ }
  201 cells in clk=\wb_clk_i, en=$abc$3878$lo0, arst={ }, srst={ }

3.64.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3284$auto$opt_dff.cc:194:make_patterns_logic$1263, asynchronously reset by !\arst_i
Extracted 91 gates and 147 wires to a netlist network with 56 inputs and 50 outputs.

3.64.2.1. Executing ABC.

3.64.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3385$auto$opt_dff.cc:194:make_patterns_logic$1275, asynchronously reset by !\arst_i
Extracted 141 gates and 226 wires to a netlist network with 85 inputs and 75 outputs.

3.64.3.1. Executing ABC.

3.64.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3590$auto$opt_dff.cc:194:make_patterns_logic$1287, asynchronously reset by !\arst_i
Extracted 52 gates and 95 wires to a netlist network with 43 inputs and 29 outputs.

3.64.4.1. Executing ABC.

3.64.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3675$auto$opt_dff.cc:194:make_patterns_logic$1296, asynchronously reset by !\arst_i
Extracted 42 gates and 82 wires to a netlist network with 40 inputs and 30 outputs.

3.64.5.1. Executing ABC.

3.64.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3753$auto$opt_dff.cc:194:make_patterns_logic$1305, asynchronously reset by !\arst_i
Extracted 79 gates and 116 wires to a netlist network with 37 inputs and 44 outputs.

3.64.6.1. Executing ABC.

3.64.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 57 gates and 110 wires to a netlist network with 53 inputs and 43 outputs.

3.64.7.1. Executing ABC.

3.64.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 279 gates and 350 wires to a netlist network with 71 inputs and 84 outputs.

3.64.8.1. Executing ABC.

3.64.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$3139$auto$opt_dff.cc:194:make_patterns_logic$1251, asynchronously reset by !\arst_i
Extracted 81 gates and 121 wires to a netlist network with 40 inputs and 43 outputs.

3.64.9.1. Executing ABC.

3.64.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4955$lo0
Extracted 201 gates and 369 wires to a netlist network with 168 inputs and 49 outputs.

3.64.10.1. Executing ABC.

yosys> abc -dff

3.65. Executing ABC pass (technology mapping using ABC).

3.65.1. Summary of detected clock domains:
  109 cells in clk=\wb_clk_i, en=$abc$4401$abc$3284$auto$opt_dff.cc:194:make_patterns_logic$1263, arst=!\arst_i, srst={ }
  141 cells in clk=\wb_clk_i, en=$abc$4519$abc$3385$auto$opt_dff.cc:194:make_patterns_logic$1275, arst=!\arst_i, srst={ }
  54 cells in clk=\wb_clk_i, en=$abc$4685$abc$3590$auto$opt_dff.cc:194:make_patterns_logic$1287, arst=!\arst_i, srst={ }
  49 cells in clk=\wb_clk_i, en=$abc$4764$abc$3675$auto$opt_dff.cc:194:make_patterns_logic$1296, arst=!\arst_i, srst={ }
  83 cells in clk=\wb_clk_i, en=$abc$4844$abc$3753$auto$opt_dff.cc:194:make_patterns_logic$1305, arst=!\arst_i, srst={ }
  60 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  259 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  88 cells in clk=\wb_clk_i, en=$abc$5314$abc$3139$auto$opt_dff.cc:194:make_patterns_logic$1251, arst=!\arst_i, srst={ }
  215 cells in clk=\wb_clk_i, en=$abc$4955$lo0, arst={ }, srst={ }

3.65.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4401$abc$3284$auto$opt_dff.cc:194:make_patterns_logic$1263, asynchronously reset by !\arst_i
Extracted 109 gates and 171 wires to a netlist network with 62 inputs and 45 outputs.

3.65.2.1. Executing ABC.

3.65.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4519$abc$3385$auto$opt_dff.cc:194:make_patterns_logic$1275, asynchronously reset by !\arst_i
Extracted 141 gates and 227 wires to a netlist network with 86 inputs and 72 outputs.

3.65.3.1. Executing ABC.

3.65.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4685$abc$3590$auto$opt_dff.cc:194:make_patterns_logic$1287, asynchronously reset by !\arst_i
Extracted 54 gates and 96 wires to a netlist network with 42 inputs and 30 outputs.

3.65.4.1. Executing ABC.

3.65.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4764$abc$3675$auto$opt_dff.cc:194:make_patterns_logic$1296, asynchronously reset by !\arst_i
Extracted 49 gates and 89 wires to a netlist network with 40 inputs and 30 outputs.

3.65.5.1. Executing ABC.

3.65.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$4844$abc$3753$auto$opt_dff.cc:194:make_patterns_logic$1305, asynchronously reset by !\arst_i
Extracted 83 gates and 120 wires to a netlist network with 37 inputs and 40 outputs.

3.65.6.1. Executing ABC.

3.65.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 60 gates and 109 wires to a netlist network with 49 inputs and 42 outputs.

3.65.7.1. Executing ABC.

3.65.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 259 gates and 324 wires to a netlist network with 65 inputs and 88 outputs.

3.65.8.1. Executing ABC.

3.65.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5314$abc$3139$auto$opt_dff.cc:194:make_patterns_logic$1251, asynchronously reset by !\arst_i
Extracted 88 gates and 134 wires to a netlist network with 46 inputs and 34 outputs.

3.65.9.1. Executing ABC.

3.65.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6225$lo0
Extracted 215 gates and 378 wires to a netlist network with 163 inputs and 50 outputs.

3.65.10.1. Executing ABC.

yosys> abc -dff

3.66. Executing ABC pass (technology mapping using ABC).

3.66.1. Summary of detected clock domains:
  108 cells in clk=\wb_clk_i, en=$abc$5668$abc$4401$abc$3284$auto$opt_dff.cc:194:make_patterns_logic$1263, arst=!\arst_i, srst={ }
  141 cells in clk=\wb_clk_i, en=$abc$5796$abc$4519$abc$3385$auto$opt_dff.cc:194:make_patterns_logic$1275, arst=!\arst_i, srst={ }
  64 cells in clk=\wb_clk_i, en=$abc$5958$abc$4685$abc$3590$auto$opt_dff.cc:194:make_patterns_logic$1287, arst=!\arst_i, srst={ }
  47 cells in clk=\wb_clk_i, en=$abc$6038$abc$4764$abc$3675$auto$opt_dff.cc:194:make_patterns_logic$1296, arst=!\arst_i, srst={ }
  91 cells in clk=\wb_clk_i, en=$abc$6118$abc$4844$abc$3753$auto$opt_dff.cc:194:make_patterns_logic$1305, arst=!\arst_i, srst={ }
  24 cells in clk=\wb_clk_i, en={ }, arst={ }, srst={ }
  300 cells in clk=\wb_clk_i, en={ }, arst=!\arst_i, srst={ }
  128 cells in clk=\wb_clk_i, en=$abc$6586$abc$5314$abc$3139$auto$opt_dff.cc:194:make_patterns_logic$1251, arst=!\arst_i, srst={ }
  211 cells in clk=\wb_clk_i, en=$abc$6225$lo0, arst={ }, srst={ }

3.66.2. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5668$abc$4401$abc$3284$auto$opt_dff.cc:194:make_patterns_logic$1263, asynchronously reset by !\arst_i
Extracted 108 gates and 165 wires to a netlist network with 57 inputs and 37 outputs.

3.66.2.1. Executing ABC.

3.66.3. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5796$abc$4519$abc$3385$auto$opt_dff.cc:194:make_patterns_logic$1275, asynchronously reset by !\arst_i
Extracted 141 gates and 226 wires to a netlist network with 85 inputs and 64 outputs.

3.66.3.1. Executing ABC.

3.66.4. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$5958$abc$4685$abc$3590$auto$opt_dff.cc:194:make_patterns_logic$1287, asynchronously reset by !\arst_i
Extracted 64 gates and 112 wires to a netlist network with 48 inputs and 32 outputs.

3.66.4.1. Executing ABC.

3.66.5. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6038$abc$4764$abc$3675$auto$opt_dff.cc:194:make_patterns_logic$1296, asynchronously reset by !\arst_i
Extracted 47 gates and 83 wires to a netlist network with 36 inputs and 27 outputs.

3.66.5.1. Executing ABC.

3.66.6. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6118$abc$4844$abc$3753$auto$opt_dff.cc:194:make_patterns_logic$1305, asynchronously reset by !\arst_i
Extracted 91 gates and 128 wires to a netlist network with 37 inputs and 39 outputs.

3.66.6.1. Executing ABC.

3.66.7. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i
Extracted 24 gates and 44 wires to a netlist network with 20 inputs and 12 outputs.

3.66.7.1. Executing ABC.

3.66.8. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by !\arst_i
Extracted 300 gates and 403 wires to a netlist network with 103 inputs and 116 outputs.

3.66.8.1. Executing ABC.

3.66.9. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$6586$abc$5314$abc$3139$auto$opt_dff.cc:194:make_patterns_logic$1251, asynchronously reset by !\arst_i
Extracted 128 gates and 197 wires to a netlist network with 69 inputs and 45 outputs.

3.66.9.1. Executing ABC.

3.66.10. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$7510$lo0
Extracted 211 gates and 372 wires to a netlist network with 161 inputs and 61 outputs.

3.66.10.1. Executing ABC.

yosys> opt_ffinv

3.67. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat -nosdff

3.68. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.68.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.68.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~372 debug messages>
Removed a total of 124 cells.

yosys> opt_muxtree

3.68.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.68.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.68.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.68.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 6871 unused wires.
<suppressed ~82 debug messages>

yosys> opt_expr

3.68.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.68.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.68.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.68.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.68.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.68.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.68.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.68.16. Finished OPT passes. (There is nothing left to do.)

yosys> bmuxmap

3.69. Executing BMUXMAP pass.

yosys> demuxmap

3.70. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /home/users/temp_dir/yosys_tAnDtW/abc_tmp_1.scr

3.71. Executing ABC pass (technology mapping using ABC).

3.71.1. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Extracted 758 gates and 1047 wires to a netlist network with 289 inputs and 143 outputs.

3.71.1.1. Executing ABC.
DE:   #PIs = 289  #Luts =   251  Max Lvl =   7  Avg Lvl =   2.69  [   0.09 sec. at Pass 0]
DE:   #PIs = 289  #Luts =   236  Max Lvl =   5  Avg Lvl =   2.81  [   0.90 sec. at Pass 1]
DE:   #PIs = 289  #Luts =   231  Max Lvl =   8  Avg Lvl =   2.82  [   0.16 sec. at Pass 2]
DE:   #PIs = 289  #Luts =   229  Max Lvl =   5  Avg Lvl =   2.42  [   0.23 sec. at Pass 3]
DE:   #PIs = 289  #Luts =   227  Max Lvl =   6  Avg Lvl =   2.50  [   0.16 sec. at Pass 4]
DE:   #PIs = 289  #Luts =   227  Max Lvl =   5  Avg Lvl =   2.48  [   0.31 sec. at Pass 5]
DE:   #PIs = 289  #Luts =   224  Max Lvl =   5  Avg Lvl =   2.38  [   0.36 sec. at Pass 6]
DE:   #PIs = 289  #Luts =   222  Max Lvl =   6  Avg Lvl =   2.62  [   0.66 sec. at Pass 7]
DE:   #PIs = 289  #Luts =   221  Max Lvl =   6  Avg Lvl =   2.45  [   0.25 sec. at Pass 8]
DE:   #PIs = 289  #Luts =   221  Max Lvl =   5  Avg Lvl =   2.46  [   0.40 sec. at Pass 9]
DE:   #PIs = 289  #Luts =   221  Max Lvl =   5  Avg Lvl =   2.46  [   0.22 sec. at Pass 10]
DE:   #PIs = 289  #Luts =   220  Max Lvl =   5  Avg Lvl =   2.54  [   0.25 sec. at Pass 11]
DE:   #PIs = 289  #Luts =   220  Max Lvl =   5  Avg Lvl =   2.54  [   0.23 sec. at Pass 12]
DE:   #PIs = 289  #Luts =   220  Max Lvl =   5  Avg Lvl =   2.54  [   0.29 sec. at Pass 13]
DE:   #PIs = 289  #Luts =   220  Max Lvl =   5  Avg Lvl =   2.54  [   0.29 sec. at Pass 14]
DE:   #PIs = 289  #Luts =   220  Max Lvl =   5  Avg Lvl =   2.54  [   1.13 sec. at Pass 15]
DE:   #PIs = 289  #Luts =   220  Max Lvl =   5  Avg Lvl =   2.54  [   0.15 sec. at Pass 16]

yosys> opt_expr

3.72. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.74. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.75. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.77. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.78. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.79. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 997 unused wires.
<suppressed ~11 debug messages>

yosys> opt_expr

3.80. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.81. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 4 inverters.

yosys> stat

3.82. Printing statistics.

=== atahost_top ===

   Number of wires:                592
   Number of wire bits:           1203
   Number of public wires:         177
   Number of public wire bits:     788
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                484
     $_DFFE_PN0P_                  176
     $_DFFE_PP_                     16
     $_DFF_PN0_                     66
     $_DFF_PN1_                      4
     $_DFF_P_                        6
     $lut                          216


yosys> shregmap -minlen 8 -maxlen 20

3.83. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.84. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.85. Printing statistics.

=== atahost_top ===

   Number of wires:                592
   Number of wire bits:           1203
   Number of public wires:         177
   Number of public wire bits:     788
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                484
     $_DFFE_PN0P_                  176
     $_DFFE_PP0P_                   16
     $_DFF_PN0_                     66
     $_DFF_PN1_                      4
     $_DFF_P_                        6
     $lut                          216


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.86. Executing TECHMAP pass (map to technology primitives).

3.86.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.86.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.86.3. Continuing TECHMAP pass.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFF_PN1_ for cells of type $_DFF_PN1_.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~636 debug messages>

yosys> opt_expr -mux_undef

3.87. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~5238 debug messages>

yosys> simplemap

3.88. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.89. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge

3.90. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
<suppressed ~1629 debug messages>
Removed a total of 543 cells.

yosys> opt_dff -nodffe -nosdff

3.91. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.92. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 1680 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.93. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.93.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
<suppressed ~199 debug messages>

yosys> opt_merge -nomux

3.93.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.93.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.93.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.93.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.93.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 41 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.93.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.93.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.93.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.93.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.93.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.93.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..

yosys> opt_expr

3.93.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

3.93.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_tAnDtW/abc_tmp_2.scr

3.94. Executing ABC pass (technology mapping using ABC).

3.94.1. Extracting gate netlist of module `\atahost_top' to `<abc-temp-dir>/input.blif'..
Extracted 856 gates and 1143 wires to a netlist network with 285 inputs and 139 outputs.

3.94.1.1. Executing ABC.
DE:   #PIs = 285  #Luts =   217  Max Lvl =   5  Avg Lvl =   2.63  [   0.11 sec. at Pass 0]
DE:   #PIs = 285  #Luts =   217  Max Lvl =   5  Avg Lvl =   2.63  [   0.81 sec. at Pass 1]
DE:   #PIs = 285  #Luts =   216  Max Lvl =   5  Avg Lvl =   2.61  [   0.15 sec. at Pass 2]
DE:   #PIs = 285  #Luts =   216  Max Lvl =   5  Avg Lvl =   2.61  [   0.23 sec. at Pass 3]
DE:   #PIs = 285  #Luts =   215  Max Lvl =   5  Avg Lvl =   2.62  [   0.24 sec. at Pass 4]
DE:   #PIs = 285  #Luts =   215  Max Lvl =   5  Avg Lvl =   2.62  [   0.68 sec. at Pass 5]
DE:   #PIs = 285  #Luts =   215  Max Lvl =   5  Avg Lvl =   2.62  [   0.76 sec. at Pass 6]
DE:   #PIs = 285  #Luts =   215  Max Lvl =   5  Avg Lvl =   2.62  [   0.63 sec. at Pass 7]
DE:   #PIs = 285  #Luts =   215  Max Lvl =   5  Avg Lvl =   2.62  [   0.77 sec. at Pass 8]
DE:   #PIs = 285  #Luts =   215  Max Lvl =   5  Avg Lvl =   2.62  [   0.14 sec. at Pass 9]

yosys> opt_expr

3.95. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.

yosys> opt_merge -nomux

3.96. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.97. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \atahost_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.98. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \atahost_top.
Performed a total of 0 changes.

yosys> opt_merge

3.99. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\atahost_top'.
Removed a total of 0 cells.

yosys> opt_share

3.100. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.101. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.102. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 993 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.103. Executing OPT_EXPR pass (perform const folding).
Optimizing module atahost_top.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.104. Executing HIERARCHY pass (managing design hierarchy).

3.104.1. Analyzing design hierarchy..
Top module:  \atahost_top

3.104.2. Analyzing design hierarchy..
Top module:  \atahost_top
Removed 0 unused modules.

yosys> stat

3.105. Printing statistics.

=== atahost_top ===

   Number of wires:                587
   Number of wire bits:           1198
   Number of public wires:         177
   Number of public wire bits:     788
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                483
     $lut                          215
     dffsre                        268


yosys> opt_clean -purge

3.106. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \atahost_top..
Removed 0 unused cells and 148 unused wires.
<suppressed ~148 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.107. Executing Verilog backend.
Dumping module `\atahost_top'.

Warnings: 128 unique messages, 149 total
End of script. Logfile hash: 5ae5f3aab0, CPU: user 3.67s system 0.23s, MEM: 37.06 MB peak
Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)
Time spent: 96% 6x abc (85 sec), 1% 31x opt_expr (1 sec), ...
real 24.83
user 71.22
sys 17.04
