
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.50
 Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Tue May 31 17:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k mod3.v

yosys> verific -vlog2k mod3.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Tue May 31 17:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'mod3.v'

yosys> synth_rs -top mod3 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.59

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top mod3

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] mod3.v:1: compiling module 'mod3'
VERIFIC-INFO [VERI-1018] mod3.v:50: compiling module 'type_conv'
VERIFIC-INFO [VERI-1018] mod3.v:69: compiling module 'mod3_adder'
Importing module mod3.
Importing module mod3_adder.
Importing module type_conv.

3.3.1. Analyzing design hierarchy..
Top module:  \mod3
Used module:     \mod3_adder
Used module:     \type_conv

3.3.2. Analyzing design hierarchy..
Top module:  \mod3
Used module:     \mod3_adder
Used module:     \type_conv
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module type_conv.
Optimizing module mod3_adder.
Optimizing module mod3.

yosys> bmuxmap

3.5. Executing BMUXMAP pass.

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).
Deleting now unused module mod3_adder.
Deleting now unused module type_conv.
<suppressed ~7 debug messages>

yosys> bmuxmap

3.8. Executing BMUXMAP pass.

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.
<suppressed ~12 debug messages>

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..
Removed 0 unused cells and 55 unused wires.
<suppressed ~1 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module mod3...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

3.15. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.15.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

yosys> opt_merge -nomux

3.15.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.15.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \mod3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce

3.15.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \mod3.
Performed a total of 0 changes.

yosys> opt_merge

3.15.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_dff -nodffe -nosdff

3.15.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.15.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> opt_expr

3.15.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

3.15.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.15.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \mod3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.15.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \mod3.
Performed a total of 0 changes.

yosys> opt_merge

3.15.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.15.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.15.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> opt_expr

3.15.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

3.15.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm -encoding binary

3.16. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.16.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.16.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.16.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.16.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> fsm_opt

3.16.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.16.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.16.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.16.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt -sat -nosdff

3.17. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.17.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

yosys> opt_merge -nomux

3.17.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \mod3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.17.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \mod3.
Performed a total of 0 changes.

yosys> opt_merge

3.17.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.17.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.17.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> opt_expr

3.17.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

3.17.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce -keepdc

3.18. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 2) from mux cell mod3.$flatten\TC3.$auto$bmuxmap.cc:60:execute$47 ($mux).
Removed top 1 bits (of 2) from mux cell mod3.$flatten\TC2.$auto$bmuxmap.cc:60:execute$47 ($mux).
Removed top 1 bits (of 2) from mux cell mod3.$flatten\TC1.$auto$bmuxmap.cc:60:execute$47 ($mux).
Removed top 1 bits (of 2) from mux cell mod3.$flatten\TC0.$auto$bmuxmap.cc:60:execute$47 ($mux).
Removed top 1 bits (of 2) from mux cell mod3.$flatten\MA3.$auto$bmuxmap.cc:60:execute$51 ($mux).
Removed top 1 bits (of 2) from mux cell mod3.$flatten\MA3.$auto$bmuxmap.cc:60:execute$56 ($mux).
Removed top 1 bits (of 2) from mux cell mod3.$flatten\MA1.$auto$bmuxmap.cc:60:execute$51 ($mux).
Removed top 1 bits (of 2) from mux cell mod3.$flatten\MA1.$auto$bmuxmap.cc:60:execute$56 ($mux).
Removed top 1 bits (of 2) from mux cell mod3.$flatten\MA0.$auto$bmuxmap.cc:60:execute$51 ($mux).
Removed top 1 bits (of 2) from mux cell mod3.$flatten\MA0.$auto$bmuxmap.cc:60:execute$56 ($mux).
Removed top 5 bits (of 16) from wire mod3.$flatten\MA0.$auto$bmuxmap.cc:58:execute$50.
Removed top 2 bits (of 8) from wire mod3.$flatten\MA0.$auto$bmuxmap.cc:58:execute$59.
Removed top 5 bits (of 16) from wire mod3.$flatten\MA1.$auto$bmuxmap.cc:58:execute$50.
Removed top 2 bits (of 8) from wire mod3.$flatten\MA1.$auto$bmuxmap.cc:58:execute$59.
Removed top 2 bits (of 4) from wire mod3.$flatten\MA1.$auto$bmuxmap.cc:58:execute$64.
Removed top 5 bits (of 16) from wire mod3.$flatten\MA3.$auto$bmuxmap.cc:58:execute$50.
Removed top 2 bits (of 8) from wire mod3.$flatten\MA3.$auto$bmuxmap.cc:58:execute$59.
Removed top 1 bits (of 4) from wire mod3.$flatten\TC0.$auto$bmuxmap.cc:58:execute$45.
Removed top 1 bits (of 4) from wire mod3.$flatten\TC1.$auto$bmuxmap.cc:58:execute$45.
Removed top 1 bits (of 4) from wire mod3.$flatten\TC2.$auto$bmuxmap.cc:58:execute$45.
Removed top 2 bits (of 4) from wire mod3.$flatten\TC3.$auto$bmuxmap.cc:58:execute$45.

yosys> peepopt

3.19. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.20. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..
Removed 0 unused cells and 11 unused wires.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.21. Executing BMUXMAP pass.

yosys> demuxmap

3.22. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.23. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module mod3:
  created 0 $alu and 0 $macc cells.

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

yosys> opt_merge -nomux

3.25. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \mod3..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.27. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \mod3.
Performed a total of 0 changes.

yosys> opt_merge

3.28. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_share

3.29. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.30. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.31. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> opt_expr

3.32. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.
MAX OPT ITERATION = 1

yosys> stat

3.33. Printing statistics.

=== mod3 ===

   Number of wires:                 42
   Number of wire bits:            156
   Number of public wires:          29
   Number of public wire bits:      56
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 42
     $mux                           42


yosys> memory -nomap

3.34. Executing MEMORY pass.

yosys> opt_mem

3.34.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.34.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.34.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.34.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.34.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.34.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> memory_share

3.34.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.34.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.34.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> memory_collect

3.34.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.35. Printing statistics.

=== mod3 ===

   Number of wires:                 42
   Number of wire bits:            156
   Number of public wires:          29
   Number of public wire bits:      56
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 42
     $mux                           42


yosys> muxpack

3.36. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~25 debug messages>

yosys> opt_clean

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> pmuxtree

3.38. Executing PMUXTREE pass.

yosys> muxpack

3.39. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~25 debug messages>

yosys> memory_map

3.40. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.41. Printing statistics.

=== mod3 ===

   Number of wires:                 42
   Number of wire bits:            156
   Number of public wires:          29
   Number of public wire bits:      56
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 42
     $mux                           42


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.42. Executing TECHMAP pass (map to technology primitives).

3.42.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.42.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.42.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
No more expansions possible.
<suppressed ~113 debug messages>

yosys> stat

3.43. Printing statistics.

=== mod3 ===

   Number of wires:                 42
   Number of wire bits:            156
   Number of public wires:          29
   Number of public wire bits:      56
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 74
     $_MUX_                         74


yosys> opt_expr

3.44. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.
<suppressed ~17 debug messages>

yosys> opt_merge -nomux

3.45. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
<suppressed ~45 debug messages>
Removed a total of 15 cells.

yosys> opt_muxtree

3.46. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \mod3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.47. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \mod3.
Performed a total of 0 changes.

yosys> opt_merge

3.48. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_share

3.49. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.50. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> opt_expr

3.52. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.
MAX OPT ITERATION = 1

yosys> opt -nodffe -fast -full -nosdff

3.53. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

3.53.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.
<suppressed ~7 debug messages>

yosys> opt_merge

3.53.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.53.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.53.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

3.53.5. Finished fast OPT passes.

yosys> techmap -map +/techmap.v

3.54. Executing TECHMAP pass (map to technology primitives).

3.54.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.54.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt -nodffe -sat -nosdff

3.55. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.55.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

yosys> opt_merge -nomux

3.55.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.55.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \mod3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.55.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \mod3.
Performed a total of 0 changes.

yosys> opt_merge

3.55.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -sat -nosdff

3.55.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> opt_expr

3.55.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

3.55.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -dff

3.56. Executing ABC pass (technology mapping using ABC).

3.56.1. Summary of detected clock domains:
  42 cells in clk={ }, en={ }, arst={ }, srst={ }

3.56.2. Extracting gate netlist of module `\mod3' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 42 gates and 51 wires to a netlist network with 8 inputs and 2 outputs.

3.56.2.1. Executing ABC.

yosys> abc -dff

3.57. Executing ABC pass (technology mapping using ABC).

3.57.1. Summary of detected clock domains:
  33 cells in clk={ }, en={ }, arst={ }, srst={ }

3.57.2. Extracting gate netlist of module `\mod3' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 33 gates and 41 wires to a netlist network with 8 inputs and 2 outputs.

3.57.2.1. Executing ABC.

yosys> abc -dff

3.58. Executing ABC pass (technology mapping using ABC).

3.58.1. Summary of detected clock domains:
  34 cells in clk={ }, en={ }, arst={ }, srst={ }

3.58.2. Extracting gate netlist of module `\mod3' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 34 gates and 42 wires to a netlist network with 8 inputs and 2 outputs.

3.58.2.1. Executing ABC.

yosys> abc -dff

3.59. Executing ABC pass (technology mapping using ABC).

3.59.1. Summary of detected clock domains:
  34 cells in clk={ }, en={ }, arst={ }, srst={ }

3.59.2. Extracting gate netlist of module `\mod3' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 34 gates and 42 wires to a netlist network with 8 inputs and 2 outputs.

3.59.2.1. Executing ABC.

yosys> opt_ffinv

3.60. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt -sat -nosdff

3.61. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.61.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

yosys> opt_merge -nomux

3.61.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.61.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \mod3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.61.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \mod3.
Performed a total of 0 changes.

yosys> opt_merge

3.61.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.61.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.61.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..
Removed 0 unused cells and 166 unused wires.
<suppressed ~19 debug messages>

yosys> opt_expr

3.61.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

3.61.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

3.61.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \mod3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.61.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \mod3.
Performed a total of 0 changes.

yosys> opt_merge

3.61.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_dff -sat -nosdff

3.61.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.61.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> opt_expr

3.61.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

3.61.16. Finished OPT passes. (There is nothing left to do.)

yosys> bmuxmap

3.62. Executing BMUXMAP pass.

yosys> demuxmap

3.63. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /home/users/temp_dir/yosys_IMBGVM/abc_tmp_1.scr

3.64. Executing ABC pass (technology mapping using ABC).

3.64.1. Extracting gate netlist of module `\mod3' to `<abc-temp-dir>/input.blif'..
Extracted 34 gates and 42 wires to a netlist network with 8 inputs and 2 outputs.

3.64.1.1. Executing ABC.
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.04 sec. at Pass 0]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.39 sec. at Pass 1]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.09 sec. at Pass 2]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.18 sec. at Pass 3]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.27 sec. at Pass 4]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.60 sec. at Pass 5]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   1.03 sec. at Pass 6]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.48 sec. at Pass 7]

yosys> opt_expr

3.65. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

yosys> opt_merge -nomux

3.66. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.67. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \mod3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.68. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \mod3.
Performed a total of 0 changes.

yosys> opt_merge

3.69. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_share

3.70. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.71. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.72. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..
Removed 0 unused cells and 42 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.73. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.74. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.75. Printing statistics.

=== mod3 ===

   Number of wires:                 13
   Number of wire bits:             22
   Number of public wires:          11
   Number of public wire bits:      20
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  4
     $lut                            4


yosys> shregmap -minlen 8 -maxlen 20

3.76. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.77. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.78. Printing statistics.

=== mod3 ===

   Number of wires:                 13
   Number of wire bits:             22
   Number of public wires:          11
   Number of public wire bits:      20
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  4
     $lut                            4


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.79. Executing TECHMAP pass (map to technology primitives).

3.79.1. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.79.2. Executing Verilog-2005 frontend: /home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/home/users/khyber.runner/yosys_verific_runner/_work/yosys_verific_rs/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.79.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~140 debug messages>

yosys> opt_expr -mux_undef

3.80. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.
<suppressed ~57 debug messages>

yosys> simplemap

3.81. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.82. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

yosys> opt_merge

3.83. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
<suppressed ~150 debug messages>
Removed a total of 50 cells.

yosys> opt_dff -nodffe -nosdff

3.84. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.85. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

yosys> opt -nodffe -nosdff

3.86. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

3.86.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

yosys> opt_merge -nomux

3.86.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.86.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \mod3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.86.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \mod3.
Performed a total of 0 changes.

yosys> opt_merge

3.86.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

3.86.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.86.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..

yosys> opt_expr

3.86.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

3.86.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -script /home/users/temp_dir/yosys_IMBGVM/abc_tmp_2.scr

3.87. Executing ABC pass (technology mapping using ABC).

3.87.1. Extracting gate netlist of module `\mod3' to `<abc-temp-dir>/input.blif'..
Extracted 49 gates and 58 wires to a netlist network with 8 inputs and 2 outputs.

3.87.1.1. Executing ABC.
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.04 sec. at Pass 0]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.29 sec. at Pass 1]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.05 sec. at Pass 2]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.11 sec. at Pass 3]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.13 sec. at Pass 4]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   0.83 sec. at Pass 5]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   1.26 sec. at Pass 6]
DE:   #PIs =   8  #Luts =     4  Max Lvl =   2  Avg Lvl =   2.00  [   1.11 sec. at Pass 7]

yosys> opt_expr

3.88. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.

yosys> opt_merge -nomux

3.89. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.90. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \mod3..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.91. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \mod3.
Performed a total of 0 changes.

yosys> opt_merge

3.92. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\mod3'.
Removed a total of 0 cells.

yosys> opt_share

3.93. Executing OPT_SHARE pass.

yosys> opt_dff -nodffe -nosdff

3.94. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.95. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..
Removed 0 unused cells and 27 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.96. Executing OPT_EXPR pass (perform const folding).
Optimizing module mod3.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.97. Executing HIERARCHY pass (managing design hierarchy).

3.97.1. Analyzing design hierarchy..
Top module:  \mod3

3.97.2. Analyzing design hierarchy..
Top module:  \mod3
Removed 0 unused modules.

yosys> stat

3.98. Printing statistics.

=== mod3 ===

   Number of wires:                 13
   Number of wire bits:             22
   Number of public wires:          11
   Number of public wire bits:      20
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  4
     $lut                            4


yosys> opt_clean -purge

3.99. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \mod3..
Removed 0 unused cells and 9 unused wires.
<suppressed ~9 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.100. Executing Verilog backend.
Dumping module `\mod3'.

End of script. Logfile hash: bfc782026a, CPU: user 0.35s system 0.09s, MEM: 22.03 MB peak
Yosys 0.18+10 (git sha1 7a7a25778, gcc 9.1.0 -fPIC -Os)
Time spent: 99% 6x abc (105 sec), 0% 8x read_verilog (0 sec), ...
real 14.64
user 66.48
sys 39.36
