
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.64
 Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k bram_v2.v bram_v1.v

yosys> verific -vlog2k bram_v2.v bram_v1.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'bram_v2.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'bram_v1.v'
VERIFIC-WARNING [VERI-1206] bram_v1.v:39: overwriting previous definition of module 'BRAM'
VERIFIC-INFO [VERI-2142] bram_v2.v:39: previous definition of design element 'BRAM' is here
VERIFIC-WARNING [VERI-1206] bram_v1.v:71: overwriting previous definition of module 'BRAM_32x512'
VERIFIC-INFO [VERI-2142] bram_v2.v:71: previous definition of design element 'BRAM_32x512' is here
VERIFIC-WARNING [VERI-1206] bram_v1.v:104: overwriting previous definition of module 'BRAM_16x1024'
VERIFIC-INFO [VERI-2142] bram_v2.v:104: previous definition of design element 'BRAM_16x1024' is here
VERIFIC-WARNING [VERI-1206] bram_v1.v:137: overwriting previous definition of module 'BRAM_8x2048'
VERIFIC-INFO [VERI-2142] bram_v2.v:137: previous definition of design element 'BRAM_8x2048' is here
VERIFIC-WARNING [VERI-1206] bram_v1.v:169: overwriting previous definition of module 'BRAM_4x4096'
VERIFIC-INFO [VERI-2142] bram_v2.v:169: previous definition of design element 'BRAM_4x4096' is here

yosys> synth_rs -top BRAM -tech genesis -goal area -de -verilog synthesized.v

3. Executing synth_rs pass: v0.4.65

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top BRAM

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] bram_v1.v:1: compiling module 'BRAM'
VERIFIC-INFO [VERI-2571] bram_v1.v:22: extracting RAM for identifier 'memory'
Importing module BRAM.

3.4.1. Analyzing design hierarchy..
Top module:  \BRAM

3.4.2. Analyzing design hierarchy..
Top module:  \BRAM
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
<suppressed ~1 debug messages>

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).

yosys> demuxmap

3.8. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.9. Executing TRIBUF pass.

yosys> deminout

3.10. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.11. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.

yosys> opt_clean

3.12. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..
Removed 1 unused cells and 6 unused wires.
<suppressed ~4 debug messages>

yosys> check

3.13. Executing CHECK pass (checking for obvious problems).
Checking module BRAM...
Found and reported 0 problems.

yosys> opt_expr

3.14. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.

yosys> opt_merge -nomux

3.15. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.16. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \BRAM..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce

3.17. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \BRAM.
Performed a total of 0 changes.

yosys> opt_merge

3.18. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_share

3.19. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.20. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$rq_reg$bram_v1.v:30$36 ($aldff) from module BRAM.

yosys> opt_clean

3.21. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..

yosys> opt_expr

3.22. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.23. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.23.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.23.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.23.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.23.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..

yosys> fsm_opt

3.23.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.23.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.23.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.23.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.

yosys> opt_merge -nomux

3.25. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.26. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \BRAM..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce

3.27. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \BRAM.
Performed a total of 0 changes.

yosys> opt_merge

3.28. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_share

3.29. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.30. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$rq_reg$bram_v1.v:30$36 ($dff) from module BRAM (D = $verific$n39$16, Q = \rq).

yosys> opt_clean

3.31. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..
Removed 1 unused cells and 1 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.32. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.

yosys> opt_muxtree

3.33. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \BRAM..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce

3.34. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \BRAM.
Performed a total of 0 changes.

yosys> opt_merge

3.35. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_share

3.36. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.37. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.38. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..

yosys> opt_expr

3.39. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
MAX OPT ITERATION = 2

yosys> wreduce -keepdc

3.40. Executing WREDUCE pass (reducing word size of cells).
Removed top 28 address bits (of 32) from memory init port BRAM.$verific$memory$bram_v1.v:22$10 (memory).
Removed top 28 address bits (of 32) from memory init port BRAM.$verific$memory$bram_v1.v:22$11 (memory).
Removed top 28 address bits (of 32) from memory init port BRAM.$verific$memory$bram_v1.v:22$4 (memory).
Removed top 28 address bits (of 32) from memory init port BRAM.$verific$memory$bram_v1.v:22$5 (memory).
Removed top 28 address bits (of 32) from memory init port BRAM.$verific$memory$bram_v1.v:22$6 (memory).
Removed top 28 address bits (of 32) from memory init port BRAM.$verific$memory$bram_v1.v:22$7 (memory).
Removed top 28 address bits (of 32) from memory init port BRAM.$verific$memory$bram_v1.v:22$8 (memory).
Removed top 28 address bits (of 32) from memory init port BRAM.$verific$memory$bram_v1.v:22$9 (memory).

yosys> peepopt

3.41. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.42. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..

yosys> demuxmap

3.43. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> stat

3.44. Printing statistics.

=== BRAM ===

   Number of wires:                 14
   Number of wire bits:            185
   Number of public wires:           8
   Number of public wire bits:     117
   Number of memories:               1
   Number of memory bits:          288
   Number of processes:              0
   Number of cells:                 16
     $and                            1
     $dffe                           1
     $meminit                        8
     $memrd_v2                       1
     $memwr_v2                       1
     $mux                            1
     $not                            1
     $reduce_or                      2


yosys> wreduce t:$mul

3.45. Executing WREDUCE pass (reducing word size of cells).

yosys> rs_dsp_macc

3.46. Executing RS_DSP_MACC pass.

yosys> techmap -map +/mul2dsp.v -D DSP_A_MAXWIDTH=20 -D DSP_B_MAXWIDTH=18 -D DSP_A_MINWIDTH=11 -D DSP_B_MINWIDTH=10 -D DSP_NAME=$__RS_MUL20X18

3.47. Executing TECHMAP pass (map to technology primitives).

3.47.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.47.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/mul2dsp.v -D DSP_A_MAXWIDTH=10 -D DSP_B_MAXWIDTH=9 -D DSP_A_MINWIDTH=4 -D DSP_B_MINWIDTH=4 -D DSP_NAME=$__RS_MUL10X9

3.48. Executing TECHMAP pass (map to technology primitives).

3.48.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/mul2dsp.v' to AST representation.
Generating RTLIL representation for module `\_80_mul'.
Generating RTLIL representation for module `\_90_soft_mul'.
Successfully finished Verilog frontend.

3.48.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> chtype -set $mul t:$__soft_mul

yosys> techmap -map +/rapidsilicon/genesis/dsp_map.v -D USE_DSP_CFG_PARAMS=0

3.49. Executing TECHMAP pass (map to technology primitives).

3.49.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_MUL20X18'.
Generating RTLIL representation for module `\$__RS_MUL10X9'.
Successfully finished Verilog frontend.

3.49.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> rs_dsp_simd

3.50. Executing RS_DSP_SIMD pass.

yosys> techmap -map +/rapidsilicon/genesis/dsp_final_map.v

3.51. Executing TECHMAP pass (map to technology primitives).

3.51.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_final_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_final_map.v' to AST representation.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Successfully finished Verilog frontend.

3.51.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~6 debug messages>

yosys> rs_dsp_io_regs

3.52. Executing RS_DSP_IO_REGS pass.

yosys> alumacc

3.53. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module BRAM:
  created 0 $alu and 0 $macc cells.

yosys> opt_expr

3.54. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.

yosys> opt_merge -nomux

3.55. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.56. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \BRAM..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~1 debug messages>

yosys> opt_reduce

3.57. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \BRAM.
Performed a total of 0 changes.

yosys> opt_merge

3.58. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_share

3.59. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.60. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.61. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..

yosys> opt_expr

3.62. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
MAX OPT ITERATION = 1

yosys> stat

3.63. Printing statistics.

=== BRAM ===

   Number of wires:                 14
   Number of wire bits:            185
   Number of public wires:           8
   Number of public wire bits:     117
   Number of memories:               1
   Number of memory bits:          288
   Number of processes:              0
   Number of cells:                 16
     $and                            1
     $dffe                           1
     $meminit                        8
     $memrd_v2                       1
     $memwr_v2                       1
     $mux                            1
     $not                            1
     $reduce_or                      2


yosys> memory -nomap

3.64. Executing MEMORY pass.

yosys> opt_mem

3.64.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.64.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.64.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).
  Analyzing BRAM.memory write port 0.

yosys> memory_bmux2rom

3.64.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.64.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `\memory'[0] in module `\BRAM': merging output FF to cell.
    Write port 0: non-transparent.

yosys> opt_clean

3.64.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..
Removed 3 unused cells and 35 unused wires.
<suppressed ~4 debug messages>

yosys> memory_share

3.64.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.64.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.64.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..

yosys> memory_collect

3.64.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.65. Printing statistics.

=== BRAM ===

   Number of wires:                 11
   Number of wire bits:            120
   Number of public wires:           8
   Number of public wire bits:     117
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  4
     $and                            1
     $mem_v2                         1
     $not                            1
     $reduce_or                      1


yosys> muxpack

3.66. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> opt_clean

3.67. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..

yosys> memory_bram -rules +/rapidsilicon/genesis/brams.txt

3.68. Executing MEMORY_BRAM pass (mapping $mem cells to block memories).
Processing BRAM.memory:
  Properties: ports=2 bits=288 rports=1 wports=1 dbits=32 abits=4 words=9
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 1):
    Bram geometry: abits=10 dbits=36 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=1015 dwaste=4 bwaste=36576 waste=36576 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 1) rejected: requirement 'min efficiency 1' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 2):
    Bram geometry: abits=11 dbits=18 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=2039 dwaste=4 bwaste=36738 waste=36738 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 2) rejected: requirement 'min efficiency 1' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 3):
    Bram geometry: abits=12 dbits=9 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=4087 dwaste=4 bwaste=36819 waste=36819 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 3) rejected: requirement 'min efficiency 1' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 4):
    Bram geometry: abits=13 dbits=4 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=8183 dwaste=0 bwaste=32732 waste=32732 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 4) rejected: requirement 'min efficiency 1' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 5):
    Bram geometry: abits=14 dbits=2 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=16375 dwaste=0 bwaste=32750 waste=32750 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 5) rejected: requirement 'min efficiency 1' not met.
  Checking rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 6):
    Bram geometry: abits=15 dbits=1 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_TDP: awaste=32759 dwaste=0 bwaste=32759 waste=32759 efficiency=0
    Rule #1 for bram type $__RS_FACTOR_BRAM36_TDP (variant 6) rejected: requirement 'min efficiency 1' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 1):
    Bram geometry: abits=10 dbits=36 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=1015 dwaste=4 bwaste=36576 waste=36576 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 1) rejected: requirement 'min efficiency 1' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 2):
    Bram geometry: abits=11 dbits=18 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=2039 dwaste=4 bwaste=36738 waste=36738 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 2) rejected: requirement 'min efficiency 1' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 3):
    Bram geometry: abits=12 dbits=9 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=4087 dwaste=4 bwaste=36819 waste=36819 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 3) rejected: requirement 'min efficiency 1' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 4):
    Bram geometry: abits=13 dbits=4 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=8183 dwaste=0 bwaste=32732 waste=32732 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 4) rejected: requirement 'min efficiency 1' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 5):
    Bram geometry: abits=14 dbits=2 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=16375 dwaste=0 bwaste=32750 waste=32750 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 5) rejected: requirement 'min efficiency 1' not met.
  Checking rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 6):
    Bram geometry: abits=15 dbits=1 wports=0 rports=0
    Estimated number of duplicates for more read ports: dups=1
    Metrics for $__RS_FACTOR_BRAM36_SDP: awaste=32759 dwaste=0 bwaste=32759 waste=32759 efficiency=0
    Rule #2 for bram type $__RS_FACTOR_BRAM36_SDP (variant 6) rejected: requirement 'min efficiency 1' not met.
  No acceptable bram resources found.

yosys> techmap -map +/rapidsilicon/genesis/brams_map.v

3.69. Executing TECHMAP pass (map to technology primitives).

3.69.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/brams_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/brams_map.v' to AST representation.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_TDP'.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM18_TDP'.
/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/brams_map.v:236: Warning: Range [2:0] select out of bounds on signal `\DOP': Setting 1 MSB bits to undef.
Generating RTLIL representation for module `\$__RS_FACTOR_BRAM36_SDP'.
Successfully finished Verilog frontend.

3.69.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~5 debug messages>

yosys> pmuxtree

3.70. Executing PMUXTREE pass.

yosys> muxpack

3.71. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> memory_map

3.72. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory \memory in module \BRAM:
  created 9 $dff cells and 0 static cells of width 32.
Extracted data FF from read port 0 of BRAM.memory: $\memory$rdreg[0]
  read interface: 1 $dff and 15 $mux cells.
  write interface: 9 write mux blocks.

yosys> stat

3.73. Printing statistics.

=== BRAM ===

   Number of wires:                102
   Number of wire bits:           2009
   Number of public wires:          17
   Number of public wire bits:     405
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 70
     $and                           26
     $dff                            9
     $dffe                           1
     $eq                             8
     $mux                           24
     $not                            1
     $reduce_or                      1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.74. Executing TECHMAP pass (map to technology primitives).

3.74.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.74.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.74.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $eq.
No more expansions possible.
<suppressed ~141 debug messages>

yosys> stat

3.75. Printing statistics.

=== BRAM ===

   Number of wires:                121
   Number of wire bits:           2029
   Number of public wires:          17
   Number of public wire bits:     405
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1135
     $_AND_                         26
     $_DFFE_PP_                     32
     $_DFF_P_                      288
     $_MUX_                        768
     $_NOT_                          9
     $_OR_                           4
     $_XOR_                          8


yosys> opt_expr

3.76. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
<suppressed ~12 debug messages>

yosys> opt_merge -nomux

3.77. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_muxtree

3.78. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \BRAM..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.79. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \BRAM.
Performed a total of 0 changes.

yosys> opt_merge

3.80. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_share

3.81. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.82. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.83. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..
Removed 0 unused cells and 43 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.84. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
MAX OPT ITERATION = 1

yosys> opt_expr -full

3.85. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
<suppressed ~275 debug messages>

yosys> techmap -map +/techmap.v

3.86. Executing TECHMAP pass (map to technology primitives).

3.86.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.86.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.87. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.

yosys> opt_merge -nomux

3.88. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.89. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \BRAM..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.90. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \BRAM.
Performed a total of 0 changes.

yosys> opt_merge

3.91. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.92. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.93. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..
Removed 0 unused cells and 14 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.94. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
MAX OPT ITERATION = 1

yosys> abc -dff

3.95. Executing ABC pass (technology mapping using ABC).

3.95.1. Summary of detected clock domains:
  160 cells in clk=\clk, en=\rce, arst={ }, srst={ }
  739 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.95.2. Extracting gate netlist of module `\BRAM' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \rce
Extracted 160 gates and 323 wires to a netlist network with 163 inputs and 32 outputs.

3.95.2.1. Executing ABC.

3.95.3. Extracting gate netlist of module `\BRAM' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 739 gates and 782 wires to a netlist network with 43 inputs and 160 outputs.

3.95.3.1. Executing ABC.

yosys> abc -dff

3.96. Executing ABC pass (technology mapping using ABC).

3.96.1. Summary of detected clock domains:
  160 cells in clk=\clk, en=\rce, arst={ }, srst={ }
  728 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.96.2. Extracting gate netlist of module `\BRAM' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \rce
Extracted 160 gates and 323 wires to a netlist network with 163 inputs and 32 outputs.

3.96.2.1. Executing ABC.

3.96.3. Extracting gate netlist of module `\BRAM' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 728 gates and 771 wires to a netlist network with 43 inputs and 160 outputs.

3.96.3.1. Executing ABC.

yosys> abc -dff

3.97. Executing ABC pass (technology mapping using ABC).

3.97.1. Summary of detected clock domains:
  160 cells in clk=\clk, en=\rce, arst={ }, srst={ }
  727 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.97.2. Extracting gate netlist of module `\BRAM' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \rce
Extracted 160 gates and 323 wires to a netlist network with 163 inputs and 32 outputs.

3.97.2.1. Executing ABC.

3.97.3. Extracting gate netlist of module `\BRAM' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 727 gates and 770 wires to a netlist network with 43 inputs and 160 outputs.

3.97.3.1. Executing ABC.

yosys> abc -dff

3.98. Executing ABC pass (technology mapping using ABC).

3.98.1. Summary of detected clock domains:
  160 cells in clk=\clk, en=\rce, arst={ }, srst={ }
  727 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.98.2. Extracting gate netlist of module `\BRAM' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \rce
Extracted 160 gates and 323 wires to a netlist network with 163 inputs and 32 outputs.

3.98.2.1. Executing ABC.

3.98.3. Extracting gate netlist of module `\BRAM' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 727 gates and 770 wires to a netlist network with 43 inputs and 160 outputs.

3.98.3.1. Executing ABC.

yosys> opt_ffinv

3.99. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.

yosys> opt_merge -nomux

3.101. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.102. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \BRAM..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.103. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \BRAM.
Performed a total of 0 changes.

yosys> opt_merge

3.104. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_share

3.105. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.106. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4918 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[31], Q = $abc$4630$lo287).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4917 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[30], Q = $abc$4630$lo286).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4916 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[29], Q = $abc$4630$lo285).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4915 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[28], Q = $abc$4630$lo284).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4914 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[27], Q = $abc$4630$lo283).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4913 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[26], Q = $abc$4630$lo282).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4912 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[25], Q = $abc$4630$lo281).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4911 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[24], Q = $abc$4630$lo280).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4910 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[23], Q = $abc$4630$lo279).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4909 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[22], Q = $abc$4630$lo278).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4908 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[21], Q = $abc$4630$lo277).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4907 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[20], Q = $abc$4630$lo276).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4906 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[19], Q = $abc$4630$lo275).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4905 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[18], Q = $abc$4630$lo274).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4904 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[17], Q = $abc$4630$lo273).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4903 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[16], Q = $abc$4630$lo272).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4902 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[15], Q = $abc$4630$lo271).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4901 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[14], Q = $abc$4630$lo270).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4900 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[13], Q = $abc$4630$lo269).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4899 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[12], Q = $abc$4630$lo268).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4898 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[11], Q = $abc$4630$lo267).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4897 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[10], Q = $abc$4630$lo266).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4896 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[9], Q = $abc$4630$lo265).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4895 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[8], Q = $abc$4630$lo264).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4894 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[7], Q = $abc$4630$lo263).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4893 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[6], Q = $abc$4630$lo262).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4892 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[5], Q = $abc$4630$lo261).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4891 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[4], Q = $abc$4630$lo260).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4890 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[3], Q = $abc$4630$lo259).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4889 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[2], Q = $abc$4630$lo258).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4888 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[1], Q = $abc$4630$lo257).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4887 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[0], Q = $abc$4630$lo256).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4886 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[31], Q = $abc$4630$lo255).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4885 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[30], Q = $abc$4630$lo254).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4884 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[29], Q = $abc$4630$lo253).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4883 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[28], Q = $abc$4630$lo252).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4882 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[27], Q = $abc$4630$lo251).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4881 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[26], Q = $abc$4630$lo250).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4880 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[25], Q = $abc$4630$lo249).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4879 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[24], Q = $abc$4630$lo248).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4878 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[23], Q = $abc$4630$lo247).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4877 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[22], Q = $abc$4630$lo246).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4876 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[21], Q = $abc$4630$lo245).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4875 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[20], Q = $abc$4630$lo244).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4874 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[19], Q = $abc$4630$lo243).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4873 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[18], Q = $abc$4630$lo242).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4872 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[17], Q = $abc$4630$lo241).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4871 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[16], Q = $abc$4630$lo240).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4870 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[15], Q = $abc$4630$lo239).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4869 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[14], Q = $abc$4630$lo238).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4868 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[13], Q = $abc$4630$lo237).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4867 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[12], Q = $abc$4630$lo236).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4866 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[11], Q = $abc$4630$lo235).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4865 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[10], Q = $abc$4630$lo234).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4864 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[9], Q = $abc$4630$lo233).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4863 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[8], Q = $abc$4630$lo232).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4862 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[7], Q = $abc$4630$lo231).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4861 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[6], Q = $abc$4630$lo230).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4860 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[5], Q = $abc$4630$lo229).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4859 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[4], Q = $abc$4630$lo228).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4858 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[3], Q = $abc$4630$lo227).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4857 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[2], Q = $abc$4630$lo226).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4856 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[1], Q = $abc$4630$lo225).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4855 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[0], Q = $abc$4630$lo224).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4854 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[31], Q = $abc$4630$lo223).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4853 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[30], Q = $abc$4630$lo222).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4852 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[29], Q = $abc$4630$lo221).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4851 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[28], Q = $abc$4630$lo220).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4850 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[27], Q = $abc$4630$lo219).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4849 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[26], Q = $abc$4630$lo218).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4848 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[25], Q = $abc$4630$lo217).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4847 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[24], Q = $abc$4630$lo216).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4846 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[23], Q = $abc$4630$lo215).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4845 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[22], Q = $abc$4630$lo214).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4844 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[21], Q = $abc$4630$lo213).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4843 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[20], Q = $abc$4630$lo212).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4842 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[19], Q = $abc$4630$lo211).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4841 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[18], Q = $abc$4630$lo210).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4840 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[17], Q = $abc$4630$lo209).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4839 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[16], Q = $abc$4630$lo208).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4838 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[15], Q = $abc$4630$lo207).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4837 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[14], Q = $abc$4630$lo206).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4836 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[13], Q = $abc$4630$lo205).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4835 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[12], Q = $abc$4630$lo204).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4834 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[11], Q = $abc$4630$lo203).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4833 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[10], Q = $abc$4630$lo202).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4832 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[9], Q = $abc$4630$lo201).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4831 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[8], Q = $abc$4630$lo200).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4830 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[7], Q = $abc$4630$lo199).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4829 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[6], Q = $abc$4630$lo198).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4828 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[5], Q = $abc$4630$lo197).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4827 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[4], Q = $abc$4630$lo196).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4826 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[3], Q = $abc$4630$lo195).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4825 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[2], Q = $abc$4630$lo194).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4824 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[1], Q = $abc$4630$lo193).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4823 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[0], Q = $abc$4630$lo192).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4822 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[31], Q = $abc$4630$lo191).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4821 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[30], Q = $abc$4630$lo190).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4820 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[29], Q = $abc$4630$lo189).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4819 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[28], Q = $abc$4630$lo188).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4818 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[27], Q = $abc$4630$lo187).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4817 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[26], Q = $abc$4630$lo186).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4816 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[25], Q = $abc$4630$lo185).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4815 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[24], Q = $abc$4630$lo184).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4814 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[23], Q = $abc$4630$lo183).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4813 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[22], Q = $abc$4630$lo182).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4812 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[21], Q = $abc$4630$lo181).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4811 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[20], Q = $abc$4630$lo180).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4810 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[19], Q = $abc$4630$lo179).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4809 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[18], Q = $abc$4630$lo178).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4808 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[17], Q = $abc$4630$lo177).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4807 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[16], Q = $abc$4630$lo176).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4806 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[15], Q = $abc$4630$lo175).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4805 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[14], Q = $abc$4630$lo174).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4804 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[13], Q = $abc$4630$lo173).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4803 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[12], Q = $abc$4630$lo172).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4802 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[11], Q = $abc$4630$lo171).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4801 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[10], Q = $abc$4630$lo170).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4800 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[9], Q = $abc$4630$lo169).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4799 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[8], Q = $abc$4630$lo168).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4798 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[7], Q = $abc$4630$lo167).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4797 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[6], Q = $abc$4630$lo166).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4796 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[5], Q = $abc$4630$lo165).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4795 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[4], Q = $abc$4630$lo164).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4794 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[3], Q = $abc$4630$lo163).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4793 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[2], Q = $abc$4630$lo162).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4792 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[1], Q = $abc$4630$lo161).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4791 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[0], Q = $abc$4630$lo160).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4790 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[31], Q = $abc$4630$lo159).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4789 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[30], Q = $abc$4630$lo158).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4788 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[29], Q = $abc$4630$lo157).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4787 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[28], Q = $abc$4630$lo156).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4786 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[27], Q = $abc$4630$lo155).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4785 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[26], Q = $abc$4630$lo154).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4784 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[25], Q = $abc$4630$lo153).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4783 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[24], Q = $abc$4630$lo152).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4782 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[23], Q = $abc$4630$lo151).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4781 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[22], Q = $abc$4630$lo150).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4780 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[21], Q = $abc$4630$lo149).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4779 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[20], Q = $abc$4630$lo148).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4778 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[19], Q = $abc$4630$lo147).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4777 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[18], Q = $abc$4630$lo146).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4776 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[17], Q = $abc$4630$lo145).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4775 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[16], Q = $abc$4630$lo144).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4774 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[15], Q = $abc$4630$lo143).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4773 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[14], Q = $abc$4630$lo142).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4772 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[13], Q = $abc$4630$lo141).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4771 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[12], Q = $abc$4630$lo140).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4770 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[11], Q = $abc$4630$lo139).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4769 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[10], Q = $abc$4630$lo138).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4768 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[9], Q = $abc$4630$lo137).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4767 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[8], Q = $abc$4630$lo136).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4766 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[7], Q = $abc$4630$lo135).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4765 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[6], Q = $abc$4630$lo134).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4764 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[5], Q = $abc$4630$lo133).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4763 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[4], Q = $abc$4630$lo132).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4762 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[3], Q = $abc$4630$lo131).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4761 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[2], Q = $abc$4630$lo130).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4760 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[1], Q = $abc$4630$lo129).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4759 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[0], Q = $abc$4630$lo128).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4758 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[31], Q = $abc$4630$lo127).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4757 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[30], Q = $abc$4630$lo126).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4756 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[29], Q = $abc$4630$lo125).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4755 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[28], Q = $abc$4630$lo124).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4754 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[27], Q = $abc$4630$lo123).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4753 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[26], Q = $abc$4630$lo122).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4752 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[25], Q = $abc$4630$lo121).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4751 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[24], Q = $abc$4630$lo120).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4750 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[23], Q = $abc$4630$lo119).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4749 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[22], Q = $abc$4630$lo118).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4748 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[21], Q = $abc$4630$lo117).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4747 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[20], Q = $abc$4630$lo116).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4746 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[19], Q = $abc$4630$lo115).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4745 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[18], Q = $abc$4630$lo114).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4744 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[17], Q = $abc$4630$lo113).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4743 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[16], Q = $abc$4630$lo112).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4742 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[15], Q = $abc$4630$lo111).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4741 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[14], Q = $abc$4630$lo110).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4740 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[13], Q = $abc$4630$lo109).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4739 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[12], Q = $abc$4630$lo108).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4738 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[11], Q = $abc$4630$lo107).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4737 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[10], Q = $abc$4630$lo106).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4736 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[9], Q = $abc$4630$lo105).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4735 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[8], Q = $abc$4630$lo104).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4734 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[7], Q = $abc$4630$lo103).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4733 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[6], Q = $abc$4630$lo102).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4732 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[5], Q = $abc$4630$lo101).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4731 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[4], Q = $abc$4630$lo100).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4730 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[3], Q = $abc$4630$lo099).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4729 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[2], Q = $abc$4630$lo098).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4728 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[1], Q = $abc$4630$lo097).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4727 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[0], Q = $abc$4630$lo096).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4726 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[31], Q = $abc$4630$lo095).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4725 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[30], Q = $abc$4630$lo094).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4724 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[29], Q = $abc$4630$lo093).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4723 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[28], Q = $abc$4630$lo092).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4722 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[27], Q = $abc$4630$lo091).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4721 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[26], Q = $abc$4630$lo090).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4720 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[25], Q = $abc$4630$lo089).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4719 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[24], Q = $abc$4630$lo088).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4718 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[23], Q = $abc$4630$lo087).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4717 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[22], Q = $abc$4630$lo086).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4716 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[21], Q = $abc$4630$lo085).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4715 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[20], Q = $abc$4630$lo084).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4714 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[19], Q = $abc$4630$lo083).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4713 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[18], Q = $abc$4630$lo082).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4712 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[17], Q = $abc$4630$lo081).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4711 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[16], Q = $abc$4630$lo080).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4710 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[15], Q = $abc$4630$lo079).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4709 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[14], Q = $abc$4630$lo078).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4708 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[13], Q = $abc$4630$lo077).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4707 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[12], Q = $abc$4630$lo076).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4706 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[11], Q = $abc$4630$lo075).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4705 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[10], Q = $abc$4630$lo074).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4704 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[9], Q = $abc$4630$lo073).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4703 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[8], Q = $abc$4630$lo072).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4702 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[7], Q = $abc$4630$lo071).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4701 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[6], Q = $abc$4630$lo070).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4700 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[5], Q = $abc$4630$lo069).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4699 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[4], Q = $abc$4630$lo068).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4698 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[3], Q = $abc$4630$lo067).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4697 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[2], Q = $abc$4630$lo066).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4696 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[1], Q = $abc$4630$lo065).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4695 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[0], Q = $abc$4630$lo064).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4694 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[31], Q = $abc$4630$lo063).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4693 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[30], Q = $abc$4630$lo062).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4692 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[29], Q = $abc$4630$lo061).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4691 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[28], Q = $abc$4630$lo060).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4690 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[27], Q = $abc$4630$lo059).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4689 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[26], Q = $abc$4630$lo058).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4688 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[25], Q = $abc$4630$lo057).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4687 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[24], Q = $abc$4630$lo056).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4686 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[23], Q = $abc$4630$lo055).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4685 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[22], Q = $abc$4630$lo054).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4684 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[21], Q = $abc$4630$lo053).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4683 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[20], Q = $abc$4630$lo052).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4682 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[19], Q = $abc$4630$lo051).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4681 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[18], Q = $abc$4630$lo050).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4680 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[17], Q = $abc$4630$lo049).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4679 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[16], Q = $abc$4630$lo048).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4678 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[15], Q = $abc$4630$lo047).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4677 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[14], Q = $abc$4630$lo046).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4676 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[13], Q = $abc$4630$lo045).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4675 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[12], Q = $abc$4630$lo044).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4674 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[11], Q = $abc$4630$lo043).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4673 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[10], Q = $abc$4630$lo042).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4672 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[9], Q = $abc$4630$lo041).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4671 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[8], Q = $abc$4630$lo040).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4670 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[7], Q = $abc$4630$lo039).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4669 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[6], Q = $abc$4630$lo038).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4668 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[5], Q = $abc$4630$lo037).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4667 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[4], Q = $abc$4630$lo036).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4666 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[3], Q = $abc$4630$lo035).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4665 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[2], Q = $abc$4630$lo034).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4664 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[1], Q = $abc$4630$lo033).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4663 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[0], Q = $abc$4630$lo032).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4662 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[31], Q = $abc$4630$lo031).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4661 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[30], Q = $abc$4630$lo030).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4660 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[29], Q = $abc$4630$lo029).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4659 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[28], Q = $abc$4630$lo028).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4658 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[27], Q = $abc$4630$lo027).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4657 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[26], Q = $abc$4630$lo026).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4656 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[25], Q = $abc$4630$lo025).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4655 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[24], Q = $abc$4630$lo024).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4654 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[23], Q = $abc$4630$lo023).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4653 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[22], Q = $abc$4630$lo022).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4652 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[21], Q = $abc$4630$lo021).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4651 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[20], Q = $abc$4630$lo020).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4650 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[19], Q = $abc$4630$lo019).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4649 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[18], Q = $abc$4630$lo018).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4648 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[17], Q = $abc$4630$lo017).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4647 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[16], Q = $abc$4630$lo016).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4646 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[15], Q = $abc$4630$lo015).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4645 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[14], Q = $abc$4630$lo014).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4644 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[13], Q = $abc$4630$lo013).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4643 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[12], Q = $abc$4630$lo012).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4642 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[11], Q = $abc$4630$lo011).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4641 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[10], Q = $abc$4630$lo010).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4640 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[9], Q = $abc$4630$lo009).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4639 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[8], Q = $abc$4630$lo008).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4638 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[7], Q = $abc$4630$lo007).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4637 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[6], Q = $abc$4630$lo006).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4636 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[5], Q = $abc$4630$lo005).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4635 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[4], Q = $abc$4630$lo004).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4634 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[3], Q = $abc$4630$lo003).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4633 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[2], Q = $abc$4630$lo002).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4632 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[1], Q = $abc$4630$lo001).
Adding EN signal on $abc$4630$auto$blifparse.cc:362:parse_blif$4631 ($_DFF_P_) from module BRAM (D = $abc$4630$wd[0], Q = $abc$4630$lo000).

yosys> opt_clean

3.107. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..
Removed 288 unused cells and 4153 unused wires.
<suppressed ~297 debug messages>

yosys> opt_expr

3.108. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.

yosys> opt_muxtree

3.109. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \BRAM..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.110. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \BRAM.
Performed a total of 0 changes.

yosys> opt_merge

3.111. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_share

3.112. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.113. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.114. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..

yosys> opt_expr

3.115. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
MAX OPT ITERATION = 2

yosys> bmuxmap

3.116. Executing BMUXMAP pass.

yosys> demuxmap

3.117. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_Kso6l5/abc_tmp_1.scr

3.118. Executing ABC pass (technology mapping using ABC).

3.118.1. Extracting gate netlist of module `\BRAM' to `<abc-temp-dir>/input.blif'..
Extracted 279 gates and 581 wires to a netlist network with 302 inputs and 41 outputs.

3.118.1.1. Executing ABC.
DE:   #PIs = 302  #Luts =   108  Max Lvl =   3  Avg Lvl =   2.20  [   0.15 sec. at Pass 0]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   1.77 sec. at Pass 1]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   0.36 sec. at Pass 2]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   0.84 sec. at Pass 3]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   0.82 sec. at Pass 4]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   1.05 sec. at Pass 5]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   2.12 sec. at Pass 6]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   0.26 sec. at Pass 7]

yosys> opt_expr

3.119. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.

yosys> opt_merge -nomux

3.120. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.121. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \BRAM..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.122. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \BRAM.
Performed a total of 0 changes.

yosys> opt_merge

3.123. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_share

3.124. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.125. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.126. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..
Removed 0 unused cells and 581 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.127. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.128. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.129. Printing statistics.

=== BRAM ===

   Number of wires:                371
   Number of wire bits:            511
   Number of public wires:           9
   Number of public wire bits:     149
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                426
     $_DFFE_PN_                    288
     $_DFFE_PP_                     32
     $lut                          106


yosys> shregmap -minlen 8 -maxlen 20

3.130. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.131. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.132. Printing statistics.

=== BRAM ===

   Number of wires:                371
   Number of wire bits:            511
   Number of public wires:           9
   Number of public wire bits:     149
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                426
     $_DFFE_PP0N_                  288
     $_DFFE_PP0P_                   32
     $lut                          106


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.133. Executing TECHMAP pass (map to technology primitives).

3.133.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.133.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/davit/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.133.3. Continuing TECHMAP pass.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFFE_PP0N_ for cells of type $_DFFE_PP0N_.
Using extmapper simplemap for cells of type $lut.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1170 debug messages>

yosys> opt_expr -mux_undef

3.134. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
<suppressed ~3404 debug messages>

yosys> simplemap

3.135. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.136. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.

yosys> opt_merge

3.137. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
<suppressed ~4392 debug messages>
Removed a total of 1464 cells.

yosys> opt_dff -nodffe -nosdff

3.138. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.139. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..
Removed 0 unused cells and 2315 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
<suppressed ~480 debug messages>

yosys> opt_merge -nomux

3.141. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.142. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \BRAM..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.143. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \BRAM.
Performed a total of 0 changes.

yosys> opt_merge

3.144. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_share

3.145. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.146. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.147. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..
Removed 0 unused cells and 32 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.148. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_Kso6l5/abc_tmp_2.scr

3.149. Executing ABC pass (technology mapping using ABC).

3.149.1. Extracting gate netlist of module `\BRAM' to `<abc-temp-dir>/input.blif'..
Extracted 626 gates and 930 wires to a netlist network with 302 inputs and 41 outputs.

3.149.1.1. Executing ABC.
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   0.31 sec. at Pass 0]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   1.59 sec. at Pass 1]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   0.84 sec. at Pass 2]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   1.03 sec. at Pass 3]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   1.08 sec. at Pass 4]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   1.23 sec. at Pass 5]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   2.79 sec. at Pass 6]
DE:   #PIs = 302  #Luts =   106  Max Lvl =   2  Avg Lvl =   2.00  [   0.47 sec. at Pass 7]

yosys> opt_expr

3.150. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.

yosys> opt_merge -nomux

3.151. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.152. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \BRAM..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.153. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \BRAM.
Performed a total of 0 changes.

yosys> opt_merge

3.154. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\BRAM'.
Removed a total of 0 cells.

yosys> opt_share

3.155. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.156. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.157. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..
Removed 0 unused cells and 864 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.158. Executing OPT_EXPR pass (perform const folding).
Optimizing module BRAM.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.159. Executing HIERARCHY pass (managing design hierarchy).

3.159.1. Analyzing design hierarchy..
Top module:  \BRAM

3.159.2. Analyzing design hierarchy..
Top module:  \BRAM
Removed 0 unused modules.

yosys> stat

3.160. Printing statistics.

=== BRAM ===

   Number of wires:                371
   Number of wire bits:            511
   Number of public wires:           9
   Number of public wire bits:     149
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                426
     $lut                          106
     dffsre                        320


yosys> opt_clean -purge

3.161. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \BRAM..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.162. Executing Verilog backend.
Dumping module `\BRAM'.

Warnings: 6 unique messages, 6 total
End of script. Logfile hash: b17d3b9b95, CPU: user 1.55s system 0.05s, MEM: 46.14 MB peak
Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)
Time spent: 94% 6x abc (22 sec), 2% 25x opt_expr (0 sec), ...
real 30.36
user 21.31
sys 2.78
