
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.70
 Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k key_gen.v s6.v s7.v s5.v s4.v des.v s1.v desround.v wb_descontroller_top.v s3.v s2.v s8.v

yosys> verific -vlog2k key_gen.v s6.v s7.v s5.v s4.v des.v s1.v desround.v wb_descontroller_top.v s3.v s2.v s8.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_gen.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's6.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's7.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's5.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's4.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'des.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's1.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'desround.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'wb_descontroller_top.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's2.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's8.v'

yosys> synth_rs -top des_top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.69

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top des_top

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] wb_descontroller_top.v:46: compiling module 'des_top'
VERIFIC-INFO [VERI-1018] des.v:52: compiling module 'des'
VERIFIC-INFO [VERI-1018] desround.v:57: compiling module 'desround'
VERIFIC-INFO [VERI-1018] key_gen.v:53: compiling module 'key_gen'
VERIFIC-WARNING [VERI-2580] key_gen.v:194: latch inferred for net 'prev0'
VERIFIC-INFO [VERI-1018] s1.v:53: compiling module 's1'
VERIFIC-INFO [VERI-1018] s2.v:53: compiling module 's2'
VERIFIC-INFO [VERI-1018] s3.v:53: compiling module 's3'
VERIFIC-INFO [VERI-1018] s4.v:53: compiling module 's4'
VERIFIC-INFO [VERI-1018] s5.v:53: compiling module 's5'
VERIFIC-INFO [VERI-1018] s6.v:53: compiling module 's6'
VERIFIC-INFO [VERI-1018] s7.v:52: compiling module 's7'
VERIFIC-INFO [VERI-1018] s8.v:52: compiling module 's8'
VERIFIC-WARNING [VERI-1209] des.v:275: expression size 5 truncated to fit in target size 4
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:86: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:87: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:88: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:89: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:90: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:91: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:96: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:100: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:101: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:106: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:111: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:115: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:119: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:123: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:127: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:133: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:137: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:142: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:146: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:152: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] wb_descontroller_top.v:153: delay control is not supported for synthesis
Importing module des_top.
Importing module des.
Importing module desround.
Importing module key_gen.
Importing module s1.
Importing module s2.
Importing module s3.
Importing module s4.
Importing module s5.
Importing module s6.
Importing module s7.
Importing module s8.

3.4.1. Analyzing design hierarchy..
Top module:  \des_top
Used module:     \des
Used module:         \s8
Used module:         \s7
Used module:         \s6
Used module:         \s5
Used module:         \s4
Used module:         \s3
Used module:         \s2
Used module:         \s1
Used module:         \desround
Used module:             \key_gen

3.4.2. Analyzing design hierarchy..
Top module:  \des_top
Used module:     \des
Used module:         \s8
Used module:         \s7
Used module:         \s6
Used module:         \s5
Used module:         \s4
Used module:         \s3
Used module:         \s2
Used module:         \s1
Used module:         \desround
Used module:             \key_gen
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module s8.
Optimizing module s7.
Optimizing module s6.
Optimizing module s5.
Optimizing module s4.
Optimizing module s3.
Optimizing module s2.
Optimizing module s1.
Optimizing module key_gen.
<suppressed ~7 debug messages>
Optimizing module desround.
<suppressed ~3 debug messages>
Optimizing module des.
<suppressed ~7 debug messages>
Optimizing module des_top.
<suppressed ~5 debug messages>

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module des.
Deleting now unused module desround.
Deleting now unused module key_gen.
Deleting now unused module s1.
Deleting now unused module s2.
Deleting now unused module s3.
Deleting now unused module s4.
Deleting now unused module s5.
Deleting now unused module s6.
Deleting now unused module s7.
Deleting now unused module s8.
<suppressed ~11 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~9 debug messages>

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 13 unused cells and 991 unused wires.
<suppressed ~79 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module des_top...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
      Replacing known input bits on port B of cell $flatten\des.$verific$i216$des.v:268$761: \des.data_ready -> 1'1
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~21 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
    New ctrl vector for $pmux cell $flatten\des.$verific$select_227$des.v:277$775: { $flatten\des.$verific$n1202$309 $flatten\des.$verific$n1204$311 }
    New ctrl vector for $pmux cell $flatten\des.$verific$select_228$des.v:277$776: { $flatten\des.$verific$n1202$309 $auto$opt_reduce.cc:134:opt_pmux$1774 }
    New ctrl vector for $pmux cell $flatten\des.$verific$select_229$des.v:277$777: { $flatten\des.$verific$n1202$309 $auto$opt_reduce.cc:134:opt_pmux$1776 }
    New ctrl vector for $pmux cell $flatten\des.$verific$select_230$des.v:277$778: { $flatten\des.$verific$n1202$309 $auto$opt_reduce.cc:134:opt_pmux$1778 }
    New ctrl vector for $pmux cell $flatten\des.\rd1.\kg1.$verific$select_350$key_gen.v:165$1178: { $flatten\des.$verific$n1202$309 $auto$opt_reduce.cc:134:opt_pmux$1780 $flatten\des.\rd1.\kg1.$verific$n975$1114 }
    New ctrl vector for $pmux cell $verific$select_41$wb_descontroller_top.v:129$272: { $verific$n638$12 $verific$n639$13 $auto$opt_reduce.cc:134:opt_pmux$1782 }
    New ctrl vector for $pmux cell $verific$select_42$wb_descontroller_top.v:129$273: { $verific$n640$14 $verific$n641$15 $auto$opt_reduce.cc:134:opt_pmux$1784 }
  Optimizing cells in module \des_top.
Performed a total of 8 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~105 debug messages>
Removed a total of 35 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$wb_dat_o_reg$wb_descontroller_top.v:156$293 ($aldff) from module des_top.
Changing const-value async load to async reset on $verific$wb_ack_o_reg$wb_descontroller_top.v:156$292 ($aldff) from module des_top.
Changing const-value async load to async reset on $verific$key_o_reg$wb_descontroller_top.v:156$296 ($aldff) from module des_top.
Changing const-value async load to async reset on $verific$data_o_reg$wb_descontroller_top.v:156$297 ($aldff) from module des_top.
Changing const-value async load to async reset on $verific$cypher_data_reg_reg$wb_descontroller_top.v:156$295 ($aldff) from module des_top.
Changing const-value async load to async reset on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.\rd1.$verific$R_o_reg$desround.v:146$960 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.\rd1.$verific$L_o_reg$desround.v:146$959 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.\rd1.$verific$Key_o_reg$desround.v:146$961 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.$verific$stage1_iter_reg$des.v:141$744 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.$verific$ready_o_reg$des.v:141$742 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.$verific$data_ready_reg$des.v:141$745 ($aldff) from module des_top.
Changing const-value async load to async reset on $flatten\des.$verific$data_o_reg$des.v:141$743 ($aldff) from module des_top.
Setting constant 0-bit at position 4 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 1-bit at position 5 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 1-bit at position 6 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 7 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 8 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 9 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 10 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 11 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 12 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 13 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 14 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 15 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 16 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 17 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 18 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 19 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 20 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 21 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 22 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 23 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 24 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 25 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 26 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 27 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 28 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 29 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 30 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.
Setting constant 0-bit at position 31 on $verific$control_reg_reg$wb_descontroller_top.v:156$294 ($adff) from module des_top.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_muxtree

3.25. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~52 debug messages>

yosys> opt_reduce

3.26. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.28. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.29. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.31. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.32. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.32.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.32.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.32.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.32.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> fsm_opt

3.32.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.32.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.32.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.32.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.34. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~52 debug messages>

yosys> opt_reduce

3.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.38. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.39. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$wb_dat_o_reg$wb_descontroller_top.v:156$293 ($adff) from module des_top (D = $verific$n891$40, Q = \wb_dat_o).
Adding EN signal on $verific$key_o_reg$wb_descontroller_top.v:156$296 ($adff) from module des_top (D = $verific$n716$36 [31:0], Q = \key_o [31:0]).
Adding EN signal on $verific$key_o_reg$wb_descontroller_top.v:156$296 ($adff) from module des_top (D = $verific$n716$36 [63:32], Q = \key_o [63:32]).
Adding EN signal on $verific$data_o_reg$wb_descontroller_top.v:156$297 ($adff) from module des_top (D = $verific$n651$35 [31:0], Q = \data_o [31:0]).
Adding EN signal on $verific$data_o_reg$wb_descontroller_top.v:156$297 ($adff) from module des_top (D = $verific$n651$35 [63:32], Q = \data_o [63:32]).
Adding EN signal on $verific$cypher_data_reg_reg$wb_descontroller_top.v:156$295 ($adff) from module des_top (D = \des.data_o, Q = \cypher_data_reg).
Adding EN signal on $flatten\des.$verific$stage1_iter_reg$des.v:141$744 ($adff) from module des_top (D = \des.next_stage1_iter, Q = \des.stage1_iter).
Adding EN signal on $flatten\des.$verific$data_ready_reg$des.v:141$745 ($adff) from module des_top (D = $flatten\des.$verific$n1189$307, Q = \des.data_ready).
Adding EN signal on $auto$ff.cc:262:slice$1785 ($adff) from module des_top (D = { \wb_dat_i [3] \wb_dat_i [0] }, Q = { \control_reg [3] \control_reg [0] }).
Adding EN signal on $auto$ff.cc:262:slice$1785 ($adff) from module des_top (D = $verific$n1397$45 [1], Q = \control_reg [1]).

yosys> opt_clean

3.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 6 unused cells and 6 unused wires.
<suppressed ~8 debug messages>

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~10 debug messages>

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~51 debug messages>

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.46. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_muxtree

3.49. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~51 debug messages>

yosys> opt_reduce

3.50. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.51. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.52. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.53. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.55. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 3

yosys> wreduce -keepdc

3.56. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 4) from mux cell des_top.$verific$mux_83$wb_descontroller_top.v:154$263 ($mux).
Removed top 5 bits (of 8) from port B of cell des_top.$verific$equal_28$wb_descontroller_top.v:113$265 ($eq).
Removed top 4 bits (of 8) from port B of cell des_top.$verific$equal_29$wb_descontroller_top.v:117$266 ($eq).
Removed top 4 bits (of 8) from port B of cell des_top.$verific$equal_30$wb_descontroller_top.v:121$267 ($eq).
Removed top 3 bits (of 8) from port B of cell des_top.$verific$equal_31$wb_descontroller_top.v:125$268 ($eq).
Removed top 3 bits (of 8) from port B of cell des_top.$verific$equal_54$wb_descontroller_top.v:140$277 ($eq).
Removed top 3 bits (of 8) from port B of cell des_top.$verific$equal_55$wb_descontroller_top.v:144$278 ($eq).
Removed top 1 bits (of 4) from mux cell des_top.$verific$mux_85$wb_descontroller_top.v:129$286 ($mux).
Removed top 1 bits (of 2) from port B of cell des_top.$auto$opt_dff.cc:195:make_patterns_logic$1833 ($ne).
Removed top 3 bits (of 4) from port B of cell des_top.$flatten\des.\rd1.\kg1.$verific$equal_132$key_gen.v:86$1154 ($eq).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox1.$auto$bmuxmap.cc:60:execute$1735 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox1.$auto$bmuxmap.cc:60:execute$1727 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox1.$auto$bmuxmap.cc:60:execute$1723 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox1.$auto$bmuxmap.cc:60:execute$1719 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox1.$auto$bmuxmap.cc:60:execute$1716 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox1.$auto$bmuxmap.cc:60:execute$1711 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox1.$auto$bmuxmap.cc:60:execute$1708 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox2.$auto$bmuxmap.cc:60:execute$1667 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox2.$auto$bmuxmap.cc:60:execute$1665 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox2.$auto$bmuxmap.cc:60:execute$1659 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox2.$auto$bmuxmap.cc:60:execute$1653 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox2.$auto$bmuxmap.cc:60:execute$1647 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox2.$auto$bmuxmap.cc:60:execute$1646 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox2.$auto$bmuxmap.cc:60:execute$1645 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox2.$auto$bmuxmap.cc:60:execute$1644 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox3.$auto$bmuxmap.cc:60:execute$1588 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox3.$auto$bmuxmap.cc:60:execute$1579 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox3.$auto$bmuxmap.cc:60:execute$1576 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox3.$auto$bmuxmap.cc:60:execute$1575 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox3.$auto$bmuxmap.cc:60:execute$1572 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox3.$auto$bmuxmap.cc:60:execute$1571 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox3.$auto$bmuxmap.cc:60:execute$1570 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox3.$auto$bmuxmap.cc:60:execute$1568 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox3.$auto$bmuxmap.cc:60:execute$1567 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox4.$auto$bmuxmap.cc:60:execute$1513 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox4.$auto$bmuxmap.cc:60:execute$1511 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox4.$auto$bmuxmap.cc:60:execute$1507 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox4.$auto$bmuxmap.cc:60:execute$1506 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox4.$auto$bmuxmap.cc:60:execute$1502 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox4.$auto$bmuxmap.cc:60:execute$1501 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox4.$auto$bmuxmap.cc:60:execute$1500 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox4.$auto$bmuxmap.cc:60:execute$1499 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1459 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1458 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1454 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1452 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1451 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1450 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1443 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1440 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1438 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1436 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1435 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1433 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1431 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox5.$auto$bmuxmap.cc:60:execute$1430 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox6.$auto$bmuxmap.cc:60:execute$1388 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox6.$auto$bmuxmap.cc:60:execute$1386 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox6.$auto$bmuxmap.cc:60:execute$1382 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox6.$auto$bmuxmap.cc:60:execute$1375 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox6.$auto$bmuxmap.cc:60:execute$1374 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox6.$auto$bmuxmap.cc:60:execute$1368 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox6.$auto$bmuxmap.cc:60:execute$1360 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox7.$auto$bmuxmap.cc:60:execute$1318 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox7.$auto$bmuxmap.cc:60:execute$1317 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox7.$auto$bmuxmap.cc:60:execute$1315 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox7.$auto$bmuxmap.cc:60:execute$1312 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox7.$auto$bmuxmap.cc:60:execute$1310 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox7.$auto$bmuxmap.cc:60:execute$1309 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox7.$auto$bmuxmap.cc:60:execute$1306 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox7.$auto$bmuxmap.cc:60:execute$1304 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox7.$auto$bmuxmap.cc:60:execute$1303 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox7.$auto$bmuxmap.cc:60:execute$1298 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1253 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1252 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1251 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1248 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1244 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1243 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1241 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1237 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1236 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1234 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1233 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1232 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1230 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1229 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:60:execute$1224 ($mux).
Removed top 3 bits (of 4) from port B of cell des_top.$flatten\des.$verific$add_222$des.v:275$768 ($add).
Removed top 1 bits (of 128) from wire des_top.$flatten\des.\sbox2.$auto$bmuxmap.cc:58:execute$1635.
Removed top 2 bits (of 128) from wire des_top.$flatten\des.\sbox8.$auto$bmuxmap.cc:58:execute$1221.
Removed top 1 bits (of 4) from wire des_top.$verific$n1397$45.
Removed top 1 bits (of 4) from wire des_top.$verific$n1399$47.
Removed top 28 bits (of 32) from wire des_top.control_reg.

yosys> peepopt

3.57. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.59. Executing BMUXMAP pass.

yosys> demuxmap

3.60. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.61. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module des_top:
  creating $macc model for $flatten\des.$verific$add_222$des.v:275$768 ($add).
  creating $alu model for $macc $flatten\des.$verific$add_222$des.v:275$768.
  creating $alu cell for $flatten\des.$verific$add_222$des.v:275$768: $auto$alumacc.cc:485:replace_alu$1842
  created 1 $alu and 0 $macc cells.

yosys> opt_expr

3.62. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.63. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.64. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~51 debug messages>

yosys> opt_reduce

3.65. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.66. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_share

3.67. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.68. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.69. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.70. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_muxtree

3.71. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~54 debug messages>

yosys> opt_reduce

3.72. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.74. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.75. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.76. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.77. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 2

yosys> stat

3.78. Printing statistics.

=== des_top ===

   Number of wires:                230
   Number of wire bits:           4973
   Number of public wires:         120
   Number of public wire bits:    2513
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                559
     $adff                           7
     $adffe                         10
     $alu                            1
     $and                            5
     $eq                             9
     $logic_not                      2
     $mux                          483
     $ne                             3
     $not                           14
     $pmux                           8
     $reduce_and                     7
     $reduce_or                      8
     $xor                            2


yosys> memory -nomap

3.79. Executing MEMORY pass.

yosys> opt_mem

3.79.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.79.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.79.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.79.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.79.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.79.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> memory_share

3.79.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.79.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.79.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> memory_collect

3.79.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.80. Printing statistics.

=== des_top ===

   Number of wires:                230
   Number of wire bits:           4973
   Number of public wires:         120
   Number of public wire bits:    2513
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                559
     $adff                           7
     $adffe                         10
     $alu                            1
     $and                            5
     $eq                             9
     $logic_not                      2
     $mux                          483
     $ne                             3
     $not                           14
     $pmux                           8
     $reduce_and                     7
     $reduce_or                      8
     $xor                            2


yosys> muxpack

3.81. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~276 debug messages>

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> pmuxtree

3.83. Executing PMUXTREE pass.

yosys> muxpack

3.84. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting des_top.$auto$pmuxtree.cc:65:recursive_mux_generator$1919 ... des_top.$auto$pmuxtree.cc:65:recursive_mux_generator$1921 to a pmux with 2 cases.
Converted 2 (p)mux cells into 1 pmux cells.
<suppressed ~291 debug messages>

yosys> memory_map

3.85. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.86. Printing statistics.

=== des_top ===

   Number of wires:                271
   Number of wire bits:           6089
   Number of public wires:         120
   Number of public wire bits:    2513
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                591
     $adff                           7
     $adffe                         10
     $alu                            1
     $and                            5
     $eq                             9
     $logic_not                      2
     $mux                          502
     $ne                             3
     $not                           22
     $or                             4
     $pmux                           1
     $reduce_and                     7
     $reduce_or                     16
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.87. Executing TECHMAP pass (map to technology primitives).

3.87.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.87.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.87.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $or.
Using template $paramod$8fabc56b80a569262acfc42757a02ca0b8e91278\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $xor.
Using template $paramod$32a7b7b86c07519b7537abc18e96f0331f97914d\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000100 for cells of type $lcu.
No more expansions possible.
<suppressed ~944 debug messages>

yosys> stat

3.88. Printing statistics.

=== des_top ===

   Number of wires:                503
   Number of wire bits:           7898
   Number of public wires:         120
   Number of public wire bits:    2513
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3889
     $_AND_                         91
     $_DFFE_PP0P_                  231
     $_DFFE_PP1P_                    1
     $_DFF_PP0_                    187
     $_MUX_                       3047
     $_NOT_                         37
     $_OR_                         139
     $_XOR_                        156


yosys> opt_expr

3.89. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~1353 debug messages>

yosys> opt_merge -nomux

3.90. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~2370 debug messages>
Removed a total of 790 cells.

yosys> opt_muxtree

3.91. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.92. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.93. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.94. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.95. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.96. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 40 unused cells and 241 unused wires.
<suppressed ~41 debug messages>

yosys> opt_expr

3.97. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~11 debug messages>

yosys> opt_muxtree

3.98. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.99. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.100. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.101. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.102. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.103. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.104. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.105. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~243 debug messages>

yosys> techmap -map +/techmap.v

3.106. Executing TECHMAP pass (map to technology primitives).

3.106.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.106.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.107. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.108. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.109. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.110. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.111. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.112. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> abc -dff

3.115. Executing ABC pass (technology mapping using ABC).

3.115.1. Summary of detected clock domains:
  4 cells in clk=\clk, en=!$auto$rtlil.cc:2549:NotGate$6157, arst=\control_reg [0], srst={ }
  350 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1827, arst=\reset, srst={ }
  95 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1805, arst=\reset, srst={ }
  105 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1819, arst=\reset, srst={ }
  71 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1834, arst=\reset, srst={ }
  1052 cells in clk=\clk, en={ }, arst=\control_reg [0], srst={ }
  110 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1791, arst=\reset, srst={ }
  101 cells in clk=\clk, en=\des.ready_o, arst=\reset, srst={ }
  77 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1812, arst=\reset, srst={ }
  24 cells in clk=\clk, en=$auto$opt_dff.cc:194:make_patterns_logic$1823, arst=\control_reg [0], srst={ }
  65 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1798, arst=\reset, srst={ }
  19 cells in clk=\clk, en={ }, arst=\reset, srst={ }

3.115.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$auto$rtlil.cc:2549:NotGate$6157, asynchronously reset by \control_reg [0]
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 2 outputs.

3.115.2.1. Executing ABC.

3.115.3. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1827, asynchronously reset by \reset
Extracted 350 gates and 418 wires to a netlist network with 67 inputs and 60 outputs.

3.115.3.1. Executing ABC.

3.115.4. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1805, asynchronously reset by \reset
Extracted 95 gates and 164 wires to a netlist network with 68 inputs and 35 outputs.

3.115.4.1. Executing ABC.

3.115.5. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1819, asynchronously reset by \reset
Extracted 105 gates and 180 wires to a netlist network with 74 inputs and 38 outputs.

3.115.5.1. Executing ABC.

3.115.6. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1834, asynchronously reset by \reset
Extracted 71 gates and 198 wires to a netlist network with 126 inputs and 67 outputs.

3.115.6.1. Executing ABC.

3.115.7. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$6244$lo0
Extracted 1052 gates and 1238 wires to a netlist network with 184 inputs and 243 outputs.

3.115.7.1. Executing ABC.

3.115.8. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1791, asynchronously reset by \reset
Extracted 110 gates and 184 wires to a netlist network with 74 inputs and 33 outputs.

3.115.8.1. Executing ABC.

3.115.9. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7154$lo184, asynchronously reset by \reset
Extracted 101 gates and 169 wires to a netlist network with 68 inputs and 66 outputs.

3.115.9.1. Executing ABC.

3.115.10. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1812, asynchronously reset by \reset
Extracted 77 gates and 117 wires to a netlist network with 39 inputs and 36 outputs.

3.115.10.1. Executing ABC.

3.115.11. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1823, asynchronously reset by $abc$6244$lo0
Extracted 24 gates and 30 wires to a netlist network with 5 inputs and 10 outputs.

3.115.11.1. Executing ABC.

3.115.12. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1798, asynchronously reset by \reset
Extracted 65 gates and 101 wires to a netlist network with 35 inputs and 32 outputs.

3.115.12.1. Executing ABC.

3.115.13. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 19 gates and 28 wires to a netlist network with 9 inputs and 7 outputs.

3.115.13.1. Executing ABC.

yosys> abc -dff

3.116. Executing ABC pass (technology mapping using ABC).

3.116.1. Summary of detected clock domains:
  107 cells in clk=\clk, en=$abc$6975$auto$opt_dff.cc:219:make_patterns_logic$1819, arst=\reset, srst={ }
  3 cells in clk=\clk, en=!$abc$6239$auto$rtlil.cc:2549:NotGate$6157, arst=$abc$6244$lo0, srst={ }
  27 cells in clk=\clk, en=$abc$9138$auto$opt_dff.cc:194:make_patterns_logic$1823, arst=$abc$6244$lo0, srst={ }
  103 cells in clk=\clk, en=$abc$9032$auto$opt_dff.cc:219:make_patterns_logic$1812, arst=\reset, srst={ }
  9 cells in clk=\clk, en=$abc$7083$auto$opt_dff.cc:219:make_patterns_logic$1834, arst=\reset, srst={ }
  41 cells in clk=\clk, en=$abc$8727$auto$opt_dff.cc:219:make_patterns_logic$1791, arst=\reset, srst={ }
  133 cells in clk=\clk, en=$abc$7154$lo184, arst=\reset, srst={ }
  75 cells in clk=\clk, en=$abc$6877$auto$opt_dff.cc:219:make_patterns_logic$1805, arst=\reset, srst={ }
  234 cells in clk=\clk, en=$abc$6244$auto$opt_dff.cc:219:make_patterns_logic$1827, arst=\reset, srst={ }
  1707 cells in clk=\clk, en={ }, arst=$abc$6244$lo0, srst={ }
  72 cells in clk=\clk, en=$abc$9164$auto$opt_dff.cc:219:make_patterns_logic$1798, arst=\reset, srst={ }
  11 cells in clk=\clk, en={ }, arst=\reset, srst={ }

3.116.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$6975$auto$opt_dff.cc:219:make_patterns_logic$1819, asynchronously reset by \reset
Extracted 107 gates and 178 wires to a netlist network with 71 inputs and 39 outputs.

3.116.2.1. Executing ABC.

3.116.3. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$6239$auto$rtlil.cc:2549:NotGate$6157, asynchronously reset by $abc$6244$lo0
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 3 outputs.

3.116.3.1. Executing ABC.

3.116.4. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9138$auto$opt_dff.cc:194:make_patterns_logic$1823, asynchronously reset by $abc$6244$lo0
Extracted 27 gates and 31 wires to a netlist network with 4 inputs and 7 outputs.

3.116.4.1. Executing ABC.

3.116.5. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9032$auto$opt_dff.cc:219:make_patterns_logic$1812, asynchronously reset by \reset
Extracted 103 gates and 173 wires to a netlist network with 70 inputs and 37 outputs.

3.116.5.1. Executing ABC.

3.116.6. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7083$auto$opt_dff.cc:219:make_patterns_logic$1834, asynchronously reset by \reset
Extracted 9 gates and 15 wires to a netlist network with 6 inputs and 7 outputs.

3.116.6.1. Executing ABC.

3.116.7. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8727$auto$opt_dff.cc:219:make_patterns_logic$1791, asynchronously reset by \reset
Extracted 41 gates and 82 wires to a netlist network with 41 inputs and 35 outputs.

3.116.7.1. Executing ABC.

3.116.8. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7154$lo184, asynchronously reset by \reset
Extracted 133 gates and 205 wires to a netlist network with 72 inputs and 35 outputs.

3.116.8.1. Executing ABC.

3.116.9. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$6877$auto$opt_dff.cc:219:make_patterns_logic$1805, asynchronously reset by \reset
Extracted 75 gates and 118 wires to a netlist network with 43 inputs and 34 outputs.

3.116.9.1. Executing ABC.

3.116.10. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$6244$auto$opt_dff.cc:219:make_patterns_logic$1827, asynchronously reset by \reset
Extracted 234 gates and 301 wires to a netlist network with 67 inputs and 118 outputs.

3.116.10.1. Executing ABC.

3.116.11. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$9938$lo1
Extracted 1707 gates and 1947 wires to a netlist network with 240 inputs and 196 outputs.

3.116.11.1. Executing ABC.

3.116.12. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9164$auto$opt_dff.cc:219:make_patterns_logic$1798, asynchronously reset by \reset
Extracted 72 gates and 116 wires to a netlist network with 44 inputs and 32 outputs.

3.116.12.1. Executing ABC.

3.116.13. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 11 gates and 18 wires to a netlist network with 7 inputs and 5 outputs.

3.116.13.1. Executing ABC.

yosys> abc -dff

3.117. Executing ABC pass (technology mapping using ABC).

3.117.1. Summary of detected clock domains:
  225 cells in clk=\clk, en=$abc$9938$abc$6244$auto$opt_dff.cc:219:make_patterns_logic$1827, arst=\reset, srst={ }
  3 cells in clk=\clk, en=!$abc$9381$abc$6239$auto$rtlil.cc:2549:NotGate$6157, arst=$abc$9938$lo1, srst={ }
  20 cells in clk=\clk, en=$abc$9515$abc$7083$auto$opt_dff.cc:219:make_patterns_logic$1834, arst=\reset, srst={ }
  22 cells in clk=\clk, en=$abc$9387$abc$9138$auto$opt_dff.cc:194:make_patterns_logic$1823, arst=$abc$9938$lo1, srst={ }
  120 cells in clk=\clk, en=$abc$10177$lo098, arst=\reset, srst={ }
  97 cells in clk=\clk, en=$abc$9841$abc$6877$auto$opt_dff.cc:219:make_patterns_logic$1805, arst=\reset, srst={ }
  67 cells in clk=\clk, en=$abc$9526$abc$8727$auto$opt_dff.cc:219:make_patterns_logic$1791, arst=\reset, srst={ }
  95 cells in clk=\clk, en=$abc$9274$abc$6975$auto$opt_dff.cc:219:make_patterns_logic$1819, arst=\reset, srst={ }
  92 cells in clk=\clk, en=$abc$9410$abc$9032$auto$opt_dff.cc:219:make_patterns_logic$1812, arst=\reset, srst={ }
  1711 cells in clk=\clk, en={ }, arst=$abc$9938$lo1, srst={ }
  75 cells in clk=\clk, en=$abc$12102$abc$9164$auto$opt_dff.cc:219:make_patterns_logic$1798, arst=\reset, srst={ }
  12 cells in clk=\clk, en={ }, arst=\reset, srst={ }

3.117.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9938$abc$6244$auto$opt_dff.cc:219:make_patterns_logic$1827, asynchronously reset by \reset
Extracted 225 gates and 293 wires to a netlist network with 68 inputs and 163 outputs.

3.117.2.1. Executing ABC.

3.117.3. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$9381$abc$6239$auto$rtlil.cc:2549:NotGate$6157, asynchronously reset by $abc$12210$lo0
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 3 outputs.

3.117.3.1. Executing ABC.

3.117.4. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9515$abc$7083$auto$opt_dff.cc:219:make_patterns_logic$1834, asynchronously reset by \reset
Extracted 20 gates and 47 wires to a netlist network with 27 inputs and 18 outputs.

3.117.4.1. Executing ABC.

3.117.5. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9387$abc$9138$auto$opt_dff.cc:194:make_patterns_logic$1823, asynchronously reset by $abc$12210$lo0
Extracted 22 gates and 26 wires to a netlist network with 4 inputs and 7 outputs.

3.117.5.1. Executing ABC.

3.117.6. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$10177$lo098, asynchronously reset by \reset
Extracted 120 gates and 189 wires to a netlist network with 69 inputs and 51 outputs.

3.117.6.1. Executing ABC.

3.117.7. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9841$abc$6877$auto$opt_dff.cc:219:make_patterns_logic$1805, asynchronously reset by \reset
Extracted 97 gates and 165 wires to a netlist network with 68 inputs and 35 outputs.

3.117.7.1. Executing ABC.

3.117.8. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9526$abc$8727$auto$opt_dff.cc:219:make_patterns_logic$1791, asynchronously reset by \reset
Extracted 67 gates and 127 wires to a netlist network with 60 inputs and 35 outputs.

3.117.8.1. Executing ABC.

3.117.9. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9274$abc$6975$auto$opt_dff.cc:219:make_patterns_logic$1819, asynchronously reset by \reset
Extracted 95 gates and 160 wires to a netlist network with 65 inputs and 37 outputs.

3.117.9.1. Executing ABC.

3.117.10. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$9410$abc$9032$auto$opt_dff.cc:219:make_patterns_logic$1812, asynchronously reset by \reset
Extracted 92 gates and 153 wires to a netlist network with 61 inputs and 36 outputs.

3.117.10.1. Executing ABC.

3.117.11. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$12210$lo0
Extracted 1711 gates and 1963 wires to a netlist network with 252 inputs and 183 outputs.

3.117.11.1. Executing ABC.

3.117.12. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12102$abc$9164$auto$opt_dff.cc:219:make_patterns_logic$1798, asynchronously reset by \reset
Extracted 75 gates and 123 wires to a netlist network with 48 inputs and 31 outputs.

3.117.12.1. Executing ABC.

3.117.13. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 12 gates and 19 wires to a netlist network with 7 inputs and 5 outputs.

3.117.13.1. Executing ABC.

yosys> abc -dff

3.118. Executing ABC pass (technology mapping using ABC).

3.118.1. Summary of detected clock domains:
  169 cells in clk=\clk, en=$abc$12210$abc$9938$abc$6244$auto$opt_dff.cc:219:make_patterns_logic$1827, arst=\reset, srst={ }
  3 cells in clk=\clk, en=!$abc$12383$abc$9381$abc$6239$auto$rtlil.cc:2549:NotGate$6157, arst=$abc$12210$lo0, srst={ }
  15 cells in clk=\clk, en=$abc$12389$abc$9515$abc$7083$auto$opt_dff.cc:219:make_patterns_logic$1834, arst=\reset, srst={ }
  22 cells in clk=\clk, en=$abc$12411$abc$9387$abc$9138$auto$opt_dff.cc:194:make_patterns_logic$1823, arst=$abc$12210$lo0, srst={ }
  96 cells in clk=\clk, en=$abc$12873$abc$9274$abc$6975$auto$opt_dff.cc:219:make_patterns_logic$1819, arst=\reset, srst={ }
  124 cells in clk=\clk, en=$abc$13081$lo026, arst=\reset, srst={ }
  93 cells in clk=\clk, en=$abc$12758$abc$9526$abc$8727$auto$opt_dff.cc:219:make_patterns_logic$1791, arst=\reset, srst={ }
  96 cells in clk=\clk, en=$abc$12977$abc$9410$abc$9032$auto$opt_dff.cc:219:make_patterns_logic$1812, arst=\reset, srst={ }
  85 cells in clk=\clk, en=$abc$12660$abc$9841$abc$6877$auto$opt_dff.cc:219:make_patterns_logic$1805, arst=\reset, srst={ }
  1700 cells in clk=\clk, en={ }, arst=$abc$12210$lo0, srst={ }
  75 cells in clk=\clk, en=$abc$14994$abc$12102$abc$9164$auto$opt_dff.cc:219:make_patterns_logic$1798, arst=\reset, srst={ }
  12 cells in clk=\clk, en={ }, arst=\reset, srst={ }

3.118.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12210$abc$9938$abc$6244$auto$opt_dff.cc:219:make_patterns_logic$1827, asynchronously reset by \reset
Extracted 169 gates and 237 wires to a netlist network with 68 inputs and 163 outputs.

3.118.2.1. Executing ABC.

3.118.3. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by !$abc$12383$abc$9381$abc$6239$auto$rtlil.cc:2549:NotGate$6157, asynchronously reset by $abc$15101$lo0
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 3 outputs.

3.118.3.1. Executing ABC.

3.118.4. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12389$abc$9515$abc$7083$auto$opt_dff.cc:219:make_patterns_logic$1834, asynchronously reset by \reset
Extracted 15 gates and 30 wires to a netlist network with 15 inputs and 13 outputs.

3.118.4.1. Executing ABC.

3.118.5. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12411$abc$9387$abc$9138$auto$opt_dff.cc:194:make_patterns_logic$1823, asynchronously reset by $abc$15101$lo0
Extracted 22 gates and 26 wires to a netlist network with 4 inputs and 7 outputs.

3.118.5.1. Executing ABC.

3.118.6. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12873$abc$9274$abc$6975$auto$opt_dff.cc:219:make_patterns_logic$1819, asynchronously reset by \reset
Extracted 96 gates and 162 wires to a netlist network with 66 inputs and 39 outputs.

3.118.6.1. Executing ABC.

3.118.7. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13081$lo026, asynchronously reset by \reset
Extracted 124 gates and 194 wires to a netlist network with 70 inputs and 64 outputs.

3.118.7.1. Executing ABC.

3.118.8. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12758$abc$9526$abc$8727$auto$opt_dff.cc:219:make_patterns_logic$1791, asynchronously reset by \reset
Extracted 93 gates and 166 wires to a netlist network with 73 inputs and 36 outputs.

3.118.8.1. Executing ABC.

3.118.9. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12977$abc$9410$abc$9032$auto$opt_dff.cc:219:make_patterns_logic$1812, asynchronously reset by \reset
Extracted 96 gates and 163 wires to a netlist network with 67 inputs and 36 outputs.

3.118.9.1. Executing ABC.

3.118.10. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12660$abc$9841$abc$6877$auto$opt_dff.cc:219:make_patterns_logic$1805, asynchronously reset by \reset
Extracted 85 gates and 142 wires to a netlist network with 57 inputs and 34 outputs.

3.118.10.1. Executing ABC.

3.118.11. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by $abc$15101$lo0
Extracted 1700 gates and 1959 wires to a netlist network with 259 inputs and 179 outputs.

3.118.11.1. Executing ABC.

3.118.12. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$14994$abc$12102$abc$9164$auto$opt_dff.cc:219:make_patterns_logic$1798, asynchronously reset by \reset
Extracted 75 gates and 125 wires to a netlist network with 50 inputs and 31 outputs.

3.118.12.1. Executing ABC.

3.118.13. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 12 gates and 19 wires to a netlist network with 7 inputs and 5 outputs.

3.118.13.1. Executing ABC.

yosys> opt_ffinv

3.119. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.120. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~4 debug messages>

yosys> opt_merge -nomux

3.121. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_muxtree

3.122. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.123. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.124. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.125. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.126. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.127. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 12520 unused wires.
<suppressed ~75 debug messages>

yosys> opt_expr

3.128. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.129. Executing BMUXMAP pass.

yosys> demuxmap

3.130. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_c3e9mh/abc_tmp_1.scr

3.131. Executing ABC pass (technology mapping using ABC).

3.131.1. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Extracted 2049 gates and 2407 wires to a netlist network with 358 inputs and 289 outputs.

3.131.1.1. Executing ABC.
DE:   #PIs = 358  #Luts =   555  Max Lvl =   8  Avg Lvl =   4.08  [   0.30 sec. at Pass 0]
DE:   #PIs = 358  #Luts =   501  Max Lvl =   8  Avg Lvl =   3.79  [   8.29 sec. at Pass 1]
DE:   #PIs = 358  #Luts =   498  Max Lvl =   9  Avg Lvl =   3.79  [   1.66 sec. at Pass 2]
DE:   #PIs = 358  #Luts =   493  Max Lvl =   8  Avg Lvl =   3.72  [   3.16 sec. at Pass 3]
DE:   #PIs = 358  #Luts =   493  Max Lvl =   8  Avg Lvl =   3.72  [   2.04 sec. at Pass 4]
DE:   #PIs = 358  #Luts =   488  Max Lvl =   8  Avg Lvl =   3.73  [   4.57 sec. at Pass 5]
DE:   #PIs = 358  #Luts =   485  Max Lvl =   8  Avg Lvl =   3.73  [   1.64 sec. at Pass 6]
DE:   #PIs = 358  #Luts =   484  Max Lvl =   8  Avg Lvl =   3.73  [   2.09 sec. at Pass 7]
DE:   #PIs = 358  #Luts =   484  Max Lvl =   8  Avg Lvl =   3.73  [   1.49 sec. at Pass 8]
DE:   #PIs = 358  #Luts =   484  Max Lvl =   8  Avg Lvl =   3.73  [   4.25 sec. at Pass 9]
DE:   #PIs = 358  #Luts =   484  Max Lvl =   8  Avg Lvl =   3.73  [   4.12 sec. at Pass 10]
DE:   #PIs = 358  #Luts =   479  Max Lvl =   8  Avg Lvl =   3.58  [  21.68 sec. at Pass 11]
DE:   #PIs = 358  #Luts =   479  Max Lvl =   8  Avg Lvl =   3.58  [   3.88 sec. at Pass 12]
DE:   #PIs = 358  #Luts =   479  Max Lvl =   8  Avg Lvl =   3.58  [   1.92 sec. at Pass 13]
DE:   #PIs = 358  #Luts =   479  Max Lvl =   8  Avg Lvl =   3.58  [   2.77 sec. at Pass 14]
DE:   #PIs = 358  #Luts =   478  Max Lvl =   8  Avg Lvl =   3.56  [  21.16 sec. at Pass 15]
DE:   #PIs = 358  #Luts =   478  Max Lvl =   8  Avg Lvl =   3.56  [   1.47 sec. at Pass 16]
DE:   #PIs = 358  #Luts =   478  Max Lvl =   8  Avg Lvl =   3.56  [   3.52 sec. at Pass 17]
DE:   #PIs = 358  #Luts =   478  Max Lvl =   8  Avg Lvl =   3.56  [   1.92 sec. at Pass 18]
DE:   #PIs = 358  #Luts =   478  Max Lvl =   7  Avg Lvl =   3.52  [  17.40 sec. at Pass 19]
DE:   #PIs = 358  #Luts =   478  Max Lvl =   7  Avg Lvl =   3.52  [   2.62 sec. at Pass 20]
DE:   #PIs = 358  #Luts =   478  Max Lvl =   7  Avg Lvl =   3.52  [   1.50 sec. at Pass 21]
DE:   #PIs = 358  #Luts =   478  Max Lvl =   7  Avg Lvl =   3.52  [   2.68 sec. at Pass 22]
DE:   #PIs = 358  #Luts =   478  Max Lvl =   7  Avg Lvl =   3.52  [  25.34 sec. at Pass 23]
DE:   #PIs = 358  #Luts =   478  Max Lvl =   7  Avg Lvl =   3.52  [   0.79 sec. at Pass 24]

yosys> opt_expr

3.132. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.133. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.134. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.135. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.137. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.138. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.139. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 2351 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.141. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.142. Printing statistics.

=== des_top ===

   Number of wires:                790
   Number of wire bits:           1972
   Number of public wires:          41
   Number of public wire bits:    1223
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                889
     $_DFFE_PP0N_                    1
     $_DFFE_PP0P_                  223
     $_DFF_PP0_                    187
     $lut                          478


yosys> shregmap -minlen 8 -maxlen 20

3.143. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.144. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.145. Printing statistics.

=== des_top ===

   Number of wires:                790
   Number of wire bits:           1972
   Number of public wires:          41
   Number of public wire bits:    1223
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                889
     $_DFFE_PP0N_                    1
     $_DFFE_PP0P_                  223
     $_DFF_PP0_                    187
     $lut                          478


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.146. Executing TECHMAP pass (map to technology primitives).

3.146.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.146.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.146.3. Continuing TECHMAP pass.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0N_ for cells of type $_DFFE_PP0N_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1437 debug messages>

yosys> opt_expr -mux_undef

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~8108 debug messages>

yosys> simplemap

3.148. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.149. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~4698 debug messages>
Removed a total of 1566 cells.

yosys> opt_dff -nodffe -nosdff

3.151. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.152. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 3229 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.153. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~304 debug messages>

yosys> opt_merge -nomux

3.154. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.155. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.156. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.157. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.158. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.159. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.160. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 91 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.161. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_c3e9mh/abc_tmp_2.scr

3.162. Executing ABC pass (technology mapping using ABC).

3.162.1. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Extracted 1992 gates and 2353 wires to a netlist network with 359 inputs and 291 outputs.

3.162.1.1. Executing ABC.
DE:   #PIs = 359  #Luts =   480  Max Lvl =   7  Avg Lvl =   3.49  [   0.40 sec. at Pass 0]
DE:   #PIs = 359  #Luts =   480  Max Lvl =   6  Avg Lvl =   3.14  [   8.49 sec. at Pass 1]
DE:   #PIs = 359  #Luts =   480  Max Lvl =   6  Avg Lvl =   3.14  [   1.68 sec. at Pass 2]
DE:   #PIs = 359  #Luts =   480  Max Lvl =   6  Avg Lvl =   3.14  [   4.04 sec. at Pass 3]
DE:   #PIs = 359  #Luts =   480  Max Lvl =   6  Avg Lvl =   3.14  [   2.67 sec. at Pass 4]
DE:   #PIs = 359  #Luts =   480  Max Lvl =   6  Avg Lvl =   3.14  [   5.00 sec. at Pass 5]
DE:   #PIs = 359  #Luts =   480  Max Lvl =   6  Avg Lvl =   3.14  [  25.57 sec. at Pass 6]
DE:   #PIs = 359  #Luts =   480  Max Lvl =   6  Avg Lvl =   3.14  [   1.32 sec. at Pass 7]

yosys> opt_expr

3.163. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.164. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.165. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.166. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.167. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.168. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.169. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.170. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 1602 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.171. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.172. Executing HIERARCHY pass (managing design hierarchy).

3.172.1. Analyzing design hierarchy..
Top module:  \des_top

3.172.2. Analyzing design hierarchy..
Top module:  \des_top
Removed 0 unused modules.

yosys> stat

3.173. Printing statistics.

=== des_top ===

   Number of wires:                792
   Number of wire bits:           1974
   Number of public wires:          41
   Number of public wire bits:    1223
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                891
     $lut                          480
     dffsre                        411


yosys> opt_clean -purge

3.174. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 23 unused wires.
<suppressed ~23 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.175. Executing Verilog backend.
Dumping module `\des_top'.

Warnings: 23 unique messages, 23 total
End of script. Logfile hash: c33fbe6ca4, CPU: user 10.50s system 0.29s, MEM: 51.30 MB peak
Yosys 0.18+10 (git sha1 c98b0e94e, gcc 9.4.0 -fPIC -Os)
Time spent: 99% 6x abc (1445 sec), 0% 30x opt_expr (2 sec), ...
real 238.98
user 1394.37
sys 60.13
