
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.53
 Yosys 0.18+10 (git sha1 a3cbfccc4, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl tea64.vhd

yosys> verific -vhdl tea64.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 00:39:28 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'tea64.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.numeric_std' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/numeric_std.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_unsigned' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_unsigned.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_arith' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_arith.vdb'
VERIFIC-INFO [VHDL-1012] tea64.vhd:6: analyzing entity 'tea64'
VERIFIC-INFO [VHDL-1010] tea64.vhd:14: analyzing architecture 'behavioral'

yosys> synth_rs -top tea64 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.61

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_sim'.
Generating RTLIL representation for module `\dsp_t1_20x18x64'.
Generating RTLIL representation for module `\dsp_t1_10x9x32'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top tea64

3.3. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] tea64.vhd:6: processing 'tea64(Behavioral)'
Importing module tea64.

3.3.1. Analyzing design hierarchy..
Top module:  \tea64

3.3.2. Analyzing design hierarchy..
Top module:  \tea64
Removed 0 unused modules.

yosys> proc

3.4. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.4.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.4.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.4.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.4.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.4.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.4.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.4.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.4.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.4.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.4.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.4.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.4.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
<suppressed ~129 debug messages>

yosys> bmuxmap

3.5. Executing BMUXMAP pass.

yosys> demuxmap

3.6. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.7. Executing FLATTEN pass (flatten design).

yosys> bmuxmap

3.8. Executing BMUXMAP pass.

yosys> demuxmap

3.9. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic

3.10. Executing TRIBUF pass.

yosys> deminout

3.11. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.

yosys> opt_clean

3.13. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..
Removed 0 unused cells and 581 unused wires.
<suppressed ~523 debug messages>

yosys> check

3.14. Executing CHECK pass (checking for obvious problems).
Checking module tea64...
Found and reported 0 problems.

yosys> opt_expr

3.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.

yosys> opt_merge -nomux

3.16. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.17. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \tea64..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.18. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \tea64.
Performed a total of 0 changes.

yosys> opt_merge

3.19. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_share

3.20. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.21. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.22. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..

yosys> opt_expr

3.23. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.24. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.24.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.24.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.24.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..

yosys> fsm_opt

3.24.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.24.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.24.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.24.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.

yosys> opt_merge -nomux

3.26. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.27. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \tea64..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.28. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \tea64.
Performed a total of 0 changes.

yosys> opt_merge

3.29. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_share

3.30. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.31. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.32. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.34. Executing WREDUCE pass (reducing word size of cells).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_272$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$976 ($add).
Removed top 2 bits (of 32) from port B of cell tea64.$verific$add_277$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$981 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_282$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$985 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_292$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$994 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_297$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$999 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_302$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1003 ($add).
Removed top 3 bits (of 32) from port B of cell tea64.$verific$add_307$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1008 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_312$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1012 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_322$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1021 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_327$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1026 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_332$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1030 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_342$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1039 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_352$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1048 ($add).
Removed top 2 bits (of 32) from port B of cell tea64.$verific$add_357$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1053 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_362$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1057 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_372$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1066 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_377$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1071 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_382$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1075 ($add).
Removed top 4 bits (of 32) from port B of cell tea64.$verific$add_387$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1080 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_392$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1084 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_402$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1093 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_407$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1098 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_412$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1102 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_422$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1111 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_432$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1120 ($add).
Removed top 3 bits (of 32) from port B of cell tea64.$verific$add_437$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1125 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_442$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1129 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_452$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1138 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_457$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1143 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_462$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1147 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_472$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1156 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_482$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1165 ($add).
Removed top 2 bits (of 32) from port B of cell tea64.$verific$add_487$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1170 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_492$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1174 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_502$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1183 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_507$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1188 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_512$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1192 ($add).
Removed top 3 bits (of 32) from port B of cell tea64.$verific$add_517$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1197 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_522$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1201 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_532$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1210 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_537$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1215 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_542$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1219 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_552$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1228 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_562$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1237 ($add).
Removed top 2 bits (of 32) from port B of cell tea64.$verific$add_567$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1242 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_572$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1246 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_582$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1255 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_594$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1266 ($add).
Removed top 2 bits (of 32) from port B of cell tea64.$verific$add_601$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1273 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_606$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1277 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_618$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1288 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_625$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1295 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_630$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1299 ($add).
Removed top 3 bits (of 32) from port B of cell tea64.$verific$add_637$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1306 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_642$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1310 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_654$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1321 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_661$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1328 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_666$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1332 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_678$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1343 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_690$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1354 ($add).
Removed top 2 bits (of 32) from port B of cell tea64.$verific$add_697$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1361 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_702$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1365 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_714$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1376 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_721$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1383 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_726$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1387 ($add).
Removed top 4 bits (of 32) from port B of cell tea64.$verific$add_733$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1394 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_738$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1398 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_750$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1409 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_757$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1416 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_762$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1420 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_774$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1431 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_786$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1442 ($add).
Removed top 3 bits (of 32) from port B of cell tea64.$verific$add_793$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1449 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_798$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1453 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_810$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1464 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_817$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1471 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_822$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1475 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_834$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1486 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_846$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1497 ($add).
Removed top 2 bits (of 32) from port B of cell tea64.$verific$add_853$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1504 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_858$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1508 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_870$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1519 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_877$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1526 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_882$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1530 ($add).
Removed top 3 bits (of 32) from port B of cell tea64.$verific$add_889$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1537 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_894$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1541 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_906$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1552 ($add).
Removed top 1 bits (of 32) from port B of cell tea64.$verific$add_913$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1559 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_918$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1563 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_930$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1574 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_942$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1585 ($add).
Removed top 2 bits (of 32) from port B of cell tea64.$verific$add_949$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1592 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_954$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1596 ($add).
Removed top 5 bits (of 32) from port A of cell tea64.$verific$add_966$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1607 ($add).

yosys> peepopt

3.35. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.36. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..

yosys> bmuxmap

3.37. Executing BMUXMAP pass.

yosys> demuxmap

3.38. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.39. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module tea64:
  creating $macc model for $verific$add_10$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$716 ($add).
  creating $macc model for $verific$add_102$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$808 ($add).
  creating $macc model for $verific$add_106$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$812 ($add).
  creating $macc model for $verific$add_110$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$816 ($add).
  creating $macc model for $verific$add_114$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$820 ($add).
  creating $macc model for $verific$add_118$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$824 ($add).
  creating $macc model for $verific$add_122$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$828 ($add).
  creating $macc model for $verific$add_126$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$832 ($add).
  creating $macc model for $verific$add_130$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$836 ($add).
  creating $macc model for $verific$add_134$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$840 ($add).
  creating $macc model for $verific$add_138$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$844 ($add).
  creating $macc model for $verific$add_14$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$720 ($add).
  creating $macc model for $verific$add_142$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$848 ($add).
  creating $macc model for $verific$add_146$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$852 ($add).
  creating $macc model for $verific$add_150$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$856 ($add).
  creating $macc model for $verific$add_154$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$860 ($add).
  creating $macc model for $verific$add_158$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$864 ($add).
  creating $macc model for $verific$add_162$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$868 ($add).
  creating $macc model for $verific$add_166$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$872 ($add).
  creating $macc model for $verific$add_170$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$876 ($add).
  creating $macc model for $verific$add_174$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$880 ($add).
  creating $macc model for $verific$add_178$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$884 ($add).
  creating $macc model for $verific$add_18$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$724 ($add).
  creating $macc model for $verific$add_182$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$888 ($add).
  creating $macc model for $verific$add_186$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$892 ($add).
  creating $macc model for $verific$add_190$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$896 ($add).
  creating $macc model for $verific$add_194$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$900 ($add).
  creating $macc model for $verific$add_198$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$904 ($add).
  creating $macc model for $verific$add_202$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$908 ($add).
  creating $macc model for $verific$add_206$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$912 ($add).
  creating $macc model for $verific$add_210$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$916 ($add).
  creating $macc model for $verific$add_214$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$920 ($add).
  creating $macc model for $verific$add_218$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$924 ($add).
  creating $macc model for $verific$add_22$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$728 ($add).
  creating $macc model for $verific$add_222$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$928 ($add).
  creating $macc model for $verific$add_226$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$932 ($add).
  creating $macc model for $verific$add_230$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$936 ($add).
  creating $macc model for $verific$add_234$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$940 ($add).
  creating $macc model for $verific$add_238$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$944 ($add).
  creating $macc model for $verific$add_242$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$948 ($add).
  creating $macc model for $verific$add_246$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$952 ($add).
  creating $macc model for $verific$add_250$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$956 ($add).
  creating $macc model for $verific$add_254$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$960 ($add).
  creating $macc model for $verific$add_258$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$964 ($add).
  creating $macc model for $verific$add_26$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$732 ($add).
  creating $macc model for $verific$add_262$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$968 ($add).
  creating $macc model for $verific$add_267$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$973 ($add).
  creating $macc model for $verific$add_269$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$974 ($add).
  creating $macc model for $verific$add_272$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$976 ($add).
  creating $macc model for $verific$add_277$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$981 ($add).
  creating $macc model for $verific$add_279$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$983 ($add).
  creating $macc model for $verific$add_282$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$985 ($add).
  creating $macc model for $verific$add_287$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$990 ($add).
  creating $macc model for $verific$add_289$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$992 ($add).
  creating $macc model for $verific$add_292$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$994 ($add).
  creating $macc model for $verific$add_297$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$999 ($add).
  creating $macc model for $verific$add_299$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1001 ($add).
  creating $macc model for $verific$add_30$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$736 ($add).
  creating $macc model for $verific$add_302$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1003 ($add).
  creating $macc model for $verific$add_307$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1008 ($add).
  creating $macc model for $verific$add_309$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1010 ($add).
  creating $macc model for $verific$add_312$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1012 ($add).
  creating $macc model for $verific$add_317$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1017 ($add).
  creating $macc model for $verific$add_319$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1019 ($add).
  creating $macc model for $verific$add_322$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1021 ($add).
  creating $macc model for $verific$add_327$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1026 ($add).
  creating $macc model for $verific$add_329$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1028 ($add).
  creating $macc model for $verific$add_332$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1030 ($add).
  creating $macc model for $verific$add_337$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1035 ($add).
  creating $macc model for $verific$add_339$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1037 ($add).
  creating $macc model for $verific$add_34$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$740 ($add).
  creating $macc model for $verific$add_342$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1039 ($add).
  creating $macc model for $verific$add_347$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1044 ($add).
  creating $macc model for $verific$add_349$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1046 ($add).
  creating $macc model for $verific$add_352$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1048 ($add).
  creating $macc model for $verific$add_357$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1053 ($add).
  creating $macc model for $verific$add_359$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1055 ($add).
  creating $macc model for $verific$add_362$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1057 ($add).
  creating $macc model for $verific$add_367$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1062 ($add).
  creating $macc model for $verific$add_369$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1064 ($add).
  creating $macc model for $verific$add_372$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1066 ($add).
  creating $macc model for $verific$add_377$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1071 ($add).
  creating $macc model for $verific$add_379$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1073 ($add).
  creating $macc model for $verific$add_38$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$744 ($add).
  creating $macc model for $verific$add_382$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1075 ($add).
  creating $macc model for $verific$add_387$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1080 ($add).
  creating $macc model for $verific$add_389$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1082 ($add).
  creating $macc model for $verific$add_392$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1084 ($add).
  creating $macc model for $verific$add_397$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1089 ($add).
  creating $macc model for $verific$add_399$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1091 ($add).
  creating $macc model for $verific$add_402$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1093 ($add).
  creating $macc model for $verific$add_407$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1098 ($add).
  creating $macc model for $verific$add_409$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1100 ($add).
  creating $macc model for $verific$add_412$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1102 ($add).
  creating $macc model for $verific$add_417$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1107 ($add).
  creating $macc model for $verific$add_419$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1109 ($add).
  creating $macc model for $verific$add_42$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$748 ($add).
  creating $macc model for $verific$add_422$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1111 ($add).
  creating $macc model for $verific$add_427$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1116 ($add).
  creating $macc model for $verific$add_429$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1118 ($add).
  creating $macc model for $verific$add_432$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1120 ($add).
  creating $macc model for $verific$add_437$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1125 ($add).
  creating $macc model for $verific$add_439$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1127 ($add).
  creating $macc model for $verific$add_442$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1129 ($add).
  creating $macc model for $verific$add_447$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1134 ($add).
  creating $macc model for $verific$add_449$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1136 ($add).
  creating $macc model for $verific$add_452$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1138 ($add).
  creating $macc model for $verific$add_457$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1143 ($add).
  creating $macc model for $verific$add_459$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1145 ($add).
  creating $macc model for $verific$add_46$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$752 ($add).
  creating $macc model for $verific$add_462$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1147 ($add).
  creating $macc model for $verific$add_467$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1152 ($add).
  creating $macc model for $verific$add_469$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1154 ($add).
  creating $macc model for $verific$add_472$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1156 ($add).
  creating $macc model for $verific$add_477$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1161 ($add).
  creating $macc model for $verific$add_479$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1163 ($add).
  creating $macc model for $verific$add_482$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1165 ($add).
  creating $macc model for $verific$add_487$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1170 ($add).
  creating $macc model for $verific$add_489$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1172 ($add).
  creating $macc model for $verific$add_492$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1174 ($add).
  creating $macc model for $verific$add_497$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1179 ($add).
  creating $macc model for $verific$add_499$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1181 ($add).
  creating $macc model for $verific$add_50$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$756 ($add).
  creating $macc model for $verific$add_502$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1183 ($add).
  creating $macc model for $verific$add_507$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1188 ($add).
  creating $macc model for $verific$add_509$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1190 ($add).
  creating $macc model for $verific$add_512$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1192 ($add).
  creating $macc model for $verific$add_517$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1197 ($add).
  creating $macc model for $verific$add_519$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1199 ($add).
  creating $macc model for $verific$add_522$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1201 ($add).
  creating $macc model for $verific$add_527$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1206 ($add).
  creating $macc model for $verific$add_529$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1208 ($add).
  creating $macc model for $verific$add_532$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1210 ($add).
  creating $macc model for $verific$add_537$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1215 ($add).
  creating $macc model for $verific$add_539$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1217 ($add).
  creating $macc model for $verific$add_54$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$760 ($add).
  creating $macc model for $verific$add_542$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1219 ($add).
  creating $macc model for $verific$add_547$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1224 ($add).
  creating $macc model for $verific$add_549$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1226 ($add).
  creating $macc model for $verific$add_552$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1228 ($add).
  creating $macc model for $verific$add_557$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1233 ($add).
  creating $macc model for $verific$add_559$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1235 ($add).
  creating $macc model for $verific$add_562$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1237 ($add).
  creating $macc model for $verific$add_567$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1242 ($add).
  creating $macc model for $verific$add_569$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1244 ($add).
  creating $macc model for $verific$add_572$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1246 ($add).
  creating $macc model for $verific$add_577$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1251 ($add).
  creating $macc model for $verific$add_579$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1253 ($add).
  creating $macc model for $verific$add_58$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$764 ($add).
  creating $macc model for $verific$add_582$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1255 ($add).
  creating $macc model for $verific$add_589$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1262 ($add).
  creating $macc model for $verific$add_591$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1264 ($add).
  creating $macc model for $verific$add_594$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1266 ($add).
  creating $macc model for $verific$add_601$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1273 ($add).
  creating $macc model for $verific$add_603$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1275 ($add).
  creating $macc model for $verific$add_606$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1277 ($add).
  creating $macc model for $verific$add_613$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1284 ($add).
  creating $macc model for $verific$add_615$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1286 ($add).
  creating $macc model for $verific$add_618$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1288 ($add).
  creating $macc model for $verific$add_62$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$768 ($add).
  creating $macc model for $verific$add_625$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1295 ($add).
  creating $macc model for $verific$add_627$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1297 ($add).
  creating $macc model for $verific$add_630$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1299 ($add).
  creating $macc model for $verific$add_637$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1306 ($add).
  creating $macc model for $verific$add_639$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1308 ($add).
  creating $macc model for $verific$add_642$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1310 ($add).
  creating $macc model for $verific$add_649$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1317 ($add).
  creating $macc model for $verific$add_651$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1319 ($add).
  creating $macc model for $verific$add_654$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1321 ($add).
  creating $macc model for $verific$add_66$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$772 ($add).
  creating $macc model for $verific$add_661$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1328 ($add).
  creating $macc model for $verific$add_663$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1330 ($add).
  creating $macc model for $verific$add_666$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1332 ($add).
  creating $macc model for $verific$add_673$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1339 ($add).
  creating $macc model for $verific$add_675$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1341 ($add).
  creating $macc model for $verific$add_678$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1343 ($add).
  creating $macc model for $verific$add_685$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1350 ($add).
  creating $macc model for $verific$add_687$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1352 ($add).
  creating $macc model for $verific$add_690$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1354 ($add).
  creating $macc model for $verific$add_697$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1361 ($add).
  creating $macc model for $verific$add_699$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1363 ($add).
  creating $macc model for $verific$add_70$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$776 ($add).
  creating $macc model for $verific$add_702$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1365 ($add).
  creating $macc model for $verific$add_709$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1372 ($add).
  creating $macc model for $verific$add_711$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1374 ($add).
  creating $macc model for $verific$add_714$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1376 ($add).
  creating $macc model for $verific$add_721$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1383 ($add).
  creating $macc model for $verific$add_723$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1385 ($add).
  creating $macc model for $verific$add_726$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1387 ($add).
  creating $macc model for $verific$add_733$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1394 ($add).
  creating $macc model for $verific$add_735$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1396 ($add).
  creating $macc model for $verific$add_738$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1398 ($add).
  creating $macc model for $verific$add_74$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$780 ($add).
  creating $macc model for $verific$add_745$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1405 ($add).
  creating $macc model for $verific$add_747$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1407 ($add).
  creating $macc model for $verific$add_750$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1409 ($add).
  creating $macc model for $verific$add_757$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1416 ($add).
  creating $macc model for $verific$add_759$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1418 ($add).
  creating $macc model for $verific$add_762$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1420 ($add).
  creating $macc model for $verific$add_769$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1427 ($add).
  creating $macc model for $verific$add_771$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1429 ($add).
  creating $macc model for $verific$add_774$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1431 ($add).
  creating $macc model for $verific$add_78$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$784 ($add).
  creating $macc model for $verific$add_781$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1438 ($add).
  creating $macc model for $verific$add_783$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1440 ($add).
  creating $macc model for $verific$add_786$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1442 ($add).
  creating $macc model for $verific$add_793$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1449 ($add).
  creating $macc model for $verific$add_795$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1451 ($add).
  creating $macc model for $verific$add_798$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1453 ($add).
  creating $macc model for $verific$add_805$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1460 ($add).
  creating $macc model for $verific$add_807$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1462 ($add).
  creating $macc model for $verific$add_810$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1464 ($add).
  creating $macc model for $verific$add_817$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1471 ($add).
  creating $macc model for $verific$add_819$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1473 ($add).
  creating $macc model for $verific$add_82$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$788 ($add).
  creating $macc model for $verific$add_822$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1475 ($add).
  creating $macc model for $verific$add_829$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1482 ($add).
  creating $macc model for $verific$add_831$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1484 ($add).
  creating $macc model for $verific$add_834$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1486 ($add).
  creating $macc model for $verific$add_841$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1493 ($add).
  creating $macc model for $verific$add_843$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1495 ($add).
  creating $macc model for $verific$add_846$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1497 ($add).
  creating $macc model for $verific$add_853$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1504 ($add).
  creating $macc model for $verific$add_855$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1506 ($add).
  creating $macc model for $verific$add_858$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1508 ($add).
  creating $macc model for $verific$add_86$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$792 ($add).
  creating $macc model for $verific$add_865$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1515 ($add).
  creating $macc model for $verific$add_867$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1517 ($add).
  creating $macc model for $verific$add_870$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1519 ($add).
  creating $macc model for $verific$add_877$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1526 ($add).
  creating $macc model for $verific$add_879$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1528 ($add).
  creating $macc model for $verific$add_882$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1530 ($add).
  creating $macc model for $verific$add_889$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1537 ($add).
  creating $macc model for $verific$add_891$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1539 ($add).
  creating $macc model for $verific$add_894$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1541 ($add).
  creating $macc model for $verific$add_90$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$796 ($add).
  creating $macc model for $verific$add_901$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1548 ($add).
  creating $macc model for $verific$add_903$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1550 ($add).
  creating $macc model for $verific$add_906$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1552 ($add).
  creating $macc model for $verific$add_913$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1559 ($add).
  creating $macc model for $verific$add_915$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1561 ($add).
  creating $macc model for $verific$add_918$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1563 ($add).
  creating $macc model for $verific$add_925$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1570 ($add).
  creating $macc model for $verific$add_927$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1572 ($add).
  creating $macc model for $verific$add_930$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1574 ($add).
  creating $macc model for $verific$add_937$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1581 ($add).
  creating $macc model for $verific$add_939$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1583 ($add).
  creating $macc model for $verific$add_94$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$800 ($add).
  creating $macc model for $verific$add_942$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1585 ($add).
  creating $macc model for $verific$add_949$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1592 ($add).
  creating $macc model for $verific$add_951$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1594 ($add).
  creating $macc model for $verific$add_954$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1596 ($add).
  creating $macc model for $verific$add_961$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1603 ($add).
  creating $macc model for $verific$add_963$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1605 ($add).
  creating $macc model for $verific$add_966$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1607 ($add).
  creating $macc model for $verific$add_98$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$804 ($add).
  creating $alu model for $macc $verific$add_98$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$804.
  creating $alu model for $macc $verific$add_966$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1607.
  creating $alu model for $macc $verific$add_963$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1605.
  creating $alu model for $macc $verific$add_961$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1603.
  creating $alu model for $macc $verific$add_954$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1596.
  creating $alu model for $macc $verific$add_951$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1594.
  creating $alu model for $macc $verific$add_949$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1592.
  creating $alu model for $macc $verific$add_942$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1585.
  creating $alu model for $macc $verific$add_94$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$800.
  creating $alu model for $macc $verific$add_939$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1583.
  creating $alu model for $macc $verific$add_937$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1581.
  creating $alu model for $macc $verific$add_930$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1574.
  creating $alu model for $macc $verific$add_927$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1572.
  creating $alu model for $macc $verific$add_925$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1570.
  creating $alu model for $macc $verific$add_918$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1563.
  creating $alu model for $macc $verific$add_915$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1561.
  creating $alu model for $macc $verific$add_913$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1559.
  creating $alu model for $macc $verific$add_906$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1552.
  creating $alu model for $macc $verific$add_903$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1550.
  creating $alu model for $macc $verific$add_901$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1548.
  creating $alu model for $macc $verific$add_90$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$796.
  creating $alu model for $macc $verific$add_894$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1541.
  creating $alu model for $macc $verific$add_891$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1539.
  creating $alu model for $macc $verific$add_889$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1537.
  creating $alu model for $macc $verific$add_882$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1530.
  creating $alu model for $macc $verific$add_879$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1528.
  creating $alu model for $macc $verific$add_877$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1526.
  creating $alu model for $macc $verific$add_870$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1519.
  creating $alu model for $macc $verific$add_867$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1517.
  creating $alu model for $macc $verific$add_865$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1515.
  creating $alu model for $macc $verific$add_86$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$792.
  creating $alu model for $macc $verific$add_858$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1508.
  creating $alu model for $macc $verific$add_855$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1506.
  creating $alu model for $macc $verific$add_853$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1504.
  creating $alu model for $macc $verific$add_846$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1497.
  creating $alu model for $macc $verific$add_843$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1495.
  creating $alu model for $macc $verific$add_841$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1493.
  creating $alu model for $macc $verific$add_834$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1486.
  creating $alu model for $macc $verific$add_831$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1484.
  creating $alu model for $macc $verific$add_829$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1482.
  creating $alu model for $macc $verific$add_822$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1475.
  creating $alu model for $macc $verific$add_82$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$788.
  creating $alu model for $macc $verific$add_819$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1473.
  creating $alu model for $macc $verific$add_817$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1471.
  creating $alu model for $macc $verific$add_810$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1464.
  creating $alu model for $macc $verific$add_807$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1462.
  creating $alu model for $macc $verific$add_805$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1460.
  creating $alu model for $macc $verific$add_798$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1453.
  creating $alu model for $macc $verific$add_795$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1451.
  creating $alu model for $macc $verific$add_793$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1449.
  creating $alu model for $macc $verific$add_786$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1442.
  creating $alu model for $macc $verific$add_783$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1440.
  creating $alu model for $macc $verific$add_781$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1438.
  creating $alu model for $macc $verific$add_78$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$784.
  creating $alu model for $macc $verific$add_774$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1431.
  creating $alu model for $macc $verific$add_771$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1429.
  creating $alu model for $macc $verific$add_769$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1427.
  creating $alu model for $macc $verific$add_762$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1420.
  creating $alu model for $macc $verific$add_759$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1418.
  creating $alu model for $macc $verific$add_757$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1416.
  creating $alu model for $macc $verific$add_750$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1409.
  creating $alu model for $macc $verific$add_747$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1407.
  creating $alu model for $macc $verific$add_745$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1405.
  creating $alu model for $macc $verific$add_74$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$780.
  creating $alu model for $macc $verific$add_738$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1398.
  creating $alu model for $macc $verific$add_735$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1396.
  creating $alu model for $macc $verific$add_733$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1394.
  creating $alu model for $macc $verific$add_726$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1387.
  creating $alu model for $macc $verific$add_723$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1385.
  creating $alu model for $macc $verific$add_721$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1383.
  creating $alu model for $macc $verific$add_714$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1376.
  creating $alu model for $macc $verific$add_711$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1374.
  creating $alu model for $macc $verific$add_709$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1372.
  creating $alu model for $macc $verific$add_702$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1365.
  creating $alu model for $macc $verific$add_70$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$776.
  creating $alu model for $macc $verific$add_699$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1363.
  creating $alu model for $macc $verific$add_697$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1361.
  creating $alu model for $macc $verific$add_690$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1354.
  creating $alu model for $macc $verific$add_687$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1352.
  creating $alu model for $macc $verific$add_685$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1350.
  creating $alu model for $macc $verific$add_678$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1343.
  creating $alu model for $macc $verific$add_675$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1341.
  creating $alu model for $macc $verific$add_673$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1339.
  creating $alu model for $macc $verific$add_666$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1332.
  creating $alu model for $macc $verific$add_663$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1330.
  creating $alu model for $macc $verific$add_661$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1328.
  creating $alu model for $macc $verific$add_66$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$772.
  creating $alu model for $macc $verific$add_654$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1321.
  creating $alu model for $macc $verific$add_651$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1319.
  creating $alu model for $macc $verific$add_649$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1317.
  creating $alu model for $macc $verific$add_642$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1310.
  creating $alu model for $macc $verific$add_639$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1308.
  creating $alu model for $macc $verific$add_637$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1306.
  creating $alu model for $macc $verific$add_630$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1299.
  creating $alu model for $macc $verific$add_627$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1297.
  creating $alu model for $macc $verific$add_625$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1295.
  creating $alu model for $macc $verific$add_62$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$768.
  creating $alu model for $macc $verific$add_618$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1288.
  creating $alu model for $macc $verific$add_615$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1286.
  creating $alu model for $macc $verific$add_613$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1284.
  creating $alu model for $macc $verific$add_606$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1277.
  creating $alu model for $macc $verific$add_603$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1275.
  creating $alu model for $macc $verific$add_601$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1273.
  creating $alu model for $macc $verific$add_594$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1266.
  creating $alu model for $macc $verific$add_591$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1264.
  creating $alu model for $macc $verific$add_589$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1262.
  creating $alu model for $macc $verific$add_582$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1255.
  creating $alu model for $macc $verific$add_58$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$764.
  creating $alu model for $macc $verific$add_579$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1253.
  creating $alu model for $macc $verific$add_577$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1251.
  creating $alu model for $macc $verific$add_572$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1246.
  creating $alu model for $macc $verific$add_569$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1244.
  creating $alu model for $macc $verific$add_567$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1242.
  creating $alu model for $macc $verific$add_562$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1237.
  creating $alu model for $macc $verific$add_559$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1235.
  creating $alu model for $macc $verific$add_557$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1233.
  creating $alu model for $macc $verific$add_552$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1228.
  creating $alu model for $macc $verific$add_549$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1226.
  creating $alu model for $macc $verific$add_547$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1224.
  creating $alu model for $macc $verific$add_542$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1219.
  creating $alu model for $macc $verific$add_54$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$760.
  creating $alu model for $macc $verific$add_539$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1217.
  creating $alu model for $macc $verific$add_537$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1215.
  creating $alu model for $macc $verific$add_532$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1210.
  creating $alu model for $macc $verific$add_529$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1208.
  creating $alu model for $macc $verific$add_527$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1206.
  creating $alu model for $macc $verific$add_522$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1201.
  creating $alu model for $macc $verific$add_519$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1199.
  creating $alu model for $macc $verific$add_517$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1197.
  creating $alu model for $macc $verific$add_512$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1192.
  creating $alu model for $macc $verific$add_509$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1190.
  creating $alu model for $macc $verific$add_507$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1188.
  creating $alu model for $macc $verific$add_502$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1183.
  creating $alu model for $macc $verific$add_50$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$756.
  creating $alu model for $macc $verific$add_499$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1181.
  creating $alu model for $macc $verific$add_497$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1179.
  creating $alu model for $macc $verific$add_492$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1174.
  creating $alu model for $macc $verific$add_489$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1172.
  creating $alu model for $macc $verific$add_487$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1170.
  creating $alu model for $macc $verific$add_482$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1165.
  creating $alu model for $macc $verific$add_479$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1163.
  creating $alu model for $macc $verific$add_477$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1161.
  creating $alu model for $macc $verific$add_472$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1156.
  creating $alu model for $macc $verific$add_469$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1154.
  creating $alu model for $macc $verific$add_467$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1152.
  creating $alu model for $macc $verific$add_462$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1147.
  creating $alu model for $macc $verific$add_46$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$752.
  creating $alu model for $macc $verific$add_459$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1145.
  creating $alu model for $macc $verific$add_457$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1143.
  creating $alu model for $macc $verific$add_452$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1138.
  creating $alu model for $macc $verific$add_449$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1136.
  creating $alu model for $macc $verific$add_447$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1134.
  creating $alu model for $macc $verific$add_442$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1129.
  creating $alu model for $macc $verific$add_439$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1127.
  creating $alu model for $macc $verific$add_437$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1125.
  creating $alu model for $macc $verific$add_432$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1120.
  creating $alu model for $macc $verific$add_429$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1118.
  creating $alu model for $macc $verific$add_427$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1116.
  creating $alu model for $macc $verific$add_422$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1111.
  creating $alu model for $macc $verific$add_42$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$748.
  creating $alu model for $macc $verific$add_419$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1109.
  creating $alu model for $macc $verific$add_417$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1107.
  creating $alu model for $macc $verific$add_412$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1102.
  creating $alu model for $macc $verific$add_409$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1100.
  creating $alu model for $macc $verific$add_407$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1098.
  creating $alu model for $macc $verific$add_402$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1093.
  creating $alu model for $macc $verific$add_399$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1091.
  creating $alu model for $macc $verific$add_397$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1089.
  creating $alu model for $macc $verific$add_392$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1084.
  creating $alu model for $macc $verific$add_389$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1082.
  creating $alu model for $macc $verific$add_387$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1080.
  creating $alu model for $macc $verific$add_382$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1075.
  creating $alu model for $macc $verific$add_38$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$744.
  creating $alu model for $macc $verific$add_379$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1073.
  creating $alu model for $macc $verific$add_377$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1071.
  creating $alu model for $macc $verific$add_372$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1066.
  creating $alu model for $macc $verific$add_369$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1064.
  creating $alu model for $macc $verific$add_367$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1062.
  creating $alu model for $macc $verific$add_362$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1057.
  creating $alu model for $macc $verific$add_359$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1055.
  creating $alu model for $macc $verific$add_357$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1053.
  creating $alu model for $macc $verific$add_352$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1048.
  creating $alu model for $macc $verific$add_349$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1046.
  creating $alu model for $macc $verific$add_347$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1044.
  creating $alu model for $macc $verific$add_342$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1039.
  creating $alu model for $macc $verific$add_34$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$740.
  creating $alu model for $macc $verific$add_339$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1037.
  creating $alu model for $macc $verific$add_337$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1035.
  creating $alu model for $macc $verific$add_332$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1030.
  creating $alu model for $macc $verific$add_329$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1028.
  creating $alu model for $macc $verific$add_327$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1026.
  creating $alu model for $macc $verific$add_322$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1021.
  creating $alu model for $macc $verific$add_319$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1019.
  creating $alu model for $macc $verific$add_317$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1017.
  creating $alu model for $macc $verific$add_312$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1012.
  creating $alu model for $macc $verific$add_309$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1010.
  creating $alu model for $macc $verific$add_307$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1008.
  creating $alu model for $macc $verific$add_302$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1003.
  creating $alu model for $macc $verific$add_30$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$736.
  creating $alu model for $macc $verific$add_299$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1001.
  creating $alu model for $macc $verific$add_297$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$999.
  creating $alu model for $macc $verific$add_292$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$994.
  creating $alu model for $macc $verific$add_289$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$992.
  creating $alu model for $macc $verific$add_287$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$990.
  creating $alu model for $macc $verific$add_282$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$985.
  creating $alu model for $macc $verific$add_279$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$983.
  creating $alu model for $macc $verific$add_277$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$981.
  creating $alu model for $macc $verific$add_272$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$976.
  creating $alu model for $macc $verific$add_269$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$974.
  creating $alu model for $macc $verific$add_267$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$973.
  creating $alu model for $macc $verific$add_262$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$968.
  creating $alu model for $macc $verific$add_26$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$732.
  creating $alu model for $macc $verific$add_258$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$964.
  creating $alu model for $macc $verific$add_254$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$960.
  creating $alu model for $macc $verific$add_250$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$956.
  creating $alu model for $macc $verific$add_246$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$952.
  creating $alu model for $macc $verific$add_242$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$948.
  creating $alu model for $macc $verific$add_238$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$944.
  creating $alu model for $macc $verific$add_234$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$940.
  creating $alu model for $macc $verific$add_230$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$936.
  creating $alu model for $macc $verific$add_226$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$932.
  creating $alu model for $macc $verific$add_222$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$928.
  creating $alu model for $macc $verific$add_22$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$728.
  creating $alu model for $macc $verific$add_218$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$924.
  creating $alu model for $macc $verific$add_214$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$920.
  creating $alu model for $macc $verific$add_210$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$916.
  creating $alu model for $macc $verific$add_206$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$912.
  creating $alu model for $macc $verific$add_202$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$908.
  creating $alu model for $macc $verific$add_198$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$904.
  creating $alu model for $macc $verific$add_194$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$900.
  creating $alu model for $macc $verific$add_190$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$896.
  creating $alu model for $macc $verific$add_186$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$892.
  creating $alu model for $macc $verific$add_182$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$888.
  creating $alu model for $macc $verific$add_18$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$724.
  creating $alu model for $macc $verific$add_178$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$884.
  creating $alu model for $macc $verific$add_174$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$880.
  creating $alu model for $macc $verific$add_170$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$876.
  creating $alu model for $macc $verific$add_166$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$872.
  creating $alu model for $macc $verific$add_162$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$868.
  creating $alu model for $macc $verific$add_158$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$864.
  creating $alu model for $macc $verific$add_154$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$860.
  creating $alu model for $macc $verific$add_150$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$856.
  creating $alu model for $macc $verific$add_146$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$852.
  creating $alu model for $macc $verific$add_142$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$848.
  creating $alu model for $macc $verific$add_14$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$720.
  creating $alu model for $macc $verific$add_138$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$844.
  creating $alu model for $macc $verific$add_134$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$840.
  creating $alu model for $macc $verific$add_130$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$836.
  creating $alu model for $macc $verific$add_126$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$832.
  creating $alu model for $macc $verific$add_122$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$828.
  creating $alu model for $macc $verific$add_118$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$824.
  creating $alu model for $macc $verific$add_114$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$820.
  creating $alu model for $macc $verific$add_110$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$816.
  creating $alu model for $macc $verific$add_106$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$812.
  creating $alu model for $macc $verific$add_102$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$808.
  creating $alu model for $macc $verific$add_10$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$716.
  creating $alu cell for $verific$add_10$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$716: $auto$alumacc.cc:485:replace_alu$1613
  creating $alu cell for $verific$add_102$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$808: $auto$alumacc.cc:485:replace_alu$1616
  creating $alu cell for $verific$add_106$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$812: $auto$alumacc.cc:485:replace_alu$1619
  creating $alu cell for $verific$add_110$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$816: $auto$alumacc.cc:485:replace_alu$1622
  creating $alu cell for $verific$add_114$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$820: $auto$alumacc.cc:485:replace_alu$1625
  creating $alu cell for $verific$add_118$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$824: $auto$alumacc.cc:485:replace_alu$1628
  creating $alu cell for $verific$add_122$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$828: $auto$alumacc.cc:485:replace_alu$1631
  creating $alu cell for $verific$add_126$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$832: $auto$alumacc.cc:485:replace_alu$1634
  creating $alu cell for $verific$add_130$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$836: $auto$alumacc.cc:485:replace_alu$1637
  creating $alu cell for $verific$add_134$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$840: $auto$alumacc.cc:485:replace_alu$1640
  creating $alu cell for $verific$add_138$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$844: $auto$alumacc.cc:485:replace_alu$1643
  creating $alu cell for $verific$add_14$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$720: $auto$alumacc.cc:485:replace_alu$1646
  creating $alu cell for $verific$add_142$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$848: $auto$alumacc.cc:485:replace_alu$1649
  creating $alu cell for $verific$add_146$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$852: $auto$alumacc.cc:485:replace_alu$1652
  creating $alu cell for $verific$add_150$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$856: $auto$alumacc.cc:485:replace_alu$1655
  creating $alu cell for $verific$add_154$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$860: $auto$alumacc.cc:485:replace_alu$1658
  creating $alu cell for $verific$add_158$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$864: $auto$alumacc.cc:485:replace_alu$1661
  creating $alu cell for $verific$add_162$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$868: $auto$alumacc.cc:485:replace_alu$1664
  creating $alu cell for $verific$add_166$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$872: $auto$alumacc.cc:485:replace_alu$1667
  creating $alu cell for $verific$add_170$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$876: $auto$alumacc.cc:485:replace_alu$1670
  creating $alu cell for $verific$add_174$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$880: $auto$alumacc.cc:485:replace_alu$1673
  creating $alu cell for $verific$add_178$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$884: $auto$alumacc.cc:485:replace_alu$1676
  creating $alu cell for $verific$add_18$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$724: $auto$alumacc.cc:485:replace_alu$1679
  creating $alu cell for $verific$add_182$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$888: $auto$alumacc.cc:485:replace_alu$1682
  creating $alu cell for $verific$add_186$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$892: $auto$alumacc.cc:485:replace_alu$1685
  creating $alu cell for $verific$add_190$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$896: $auto$alumacc.cc:485:replace_alu$1688
  creating $alu cell for $verific$add_194$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$900: $auto$alumacc.cc:485:replace_alu$1691
  creating $alu cell for $verific$add_198$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$904: $auto$alumacc.cc:485:replace_alu$1694
  creating $alu cell for $verific$add_202$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$908: $auto$alumacc.cc:485:replace_alu$1697
  creating $alu cell for $verific$add_206$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$912: $auto$alumacc.cc:485:replace_alu$1700
  creating $alu cell for $verific$add_210$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$916: $auto$alumacc.cc:485:replace_alu$1703
  creating $alu cell for $verific$add_214$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$920: $auto$alumacc.cc:485:replace_alu$1706
  creating $alu cell for $verific$add_218$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$924: $auto$alumacc.cc:485:replace_alu$1709
  creating $alu cell for $verific$add_22$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$728: $auto$alumacc.cc:485:replace_alu$1712
  creating $alu cell for $verific$add_222$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$928: $auto$alumacc.cc:485:replace_alu$1715
  creating $alu cell for $verific$add_226$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$932: $auto$alumacc.cc:485:replace_alu$1718
  creating $alu cell for $verific$add_230$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$936: $auto$alumacc.cc:485:replace_alu$1721
  creating $alu cell for $verific$add_234$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$940: $auto$alumacc.cc:485:replace_alu$1724
  creating $alu cell for $verific$add_238$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$944: $auto$alumacc.cc:485:replace_alu$1727
  creating $alu cell for $verific$add_242$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$948: $auto$alumacc.cc:485:replace_alu$1730
  creating $alu cell for $verific$add_246$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$952: $auto$alumacc.cc:485:replace_alu$1733
  creating $alu cell for $verific$add_250$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$956: $auto$alumacc.cc:485:replace_alu$1736
  creating $alu cell for $verific$add_254$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$960: $auto$alumacc.cc:485:replace_alu$1739
  creating $alu cell for $verific$add_258$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$964: $auto$alumacc.cc:485:replace_alu$1742
  creating $alu cell for $verific$add_26$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$732: $auto$alumacc.cc:485:replace_alu$1745
  creating $alu cell for $verific$add_262$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$968: $auto$alumacc.cc:485:replace_alu$1748
  creating $alu cell for $verific$add_267$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$973: $auto$alumacc.cc:485:replace_alu$1751
  creating $alu cell for $verific$add_269$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$974: $auto$alumacc.cc:485:replace_alu$1754
  creating $alu cell for $verific$add_272$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$976: $auto$alumacc.cc:485:replace_alu$1757
  creating $alu cell for $verific$add_277$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$981: $auto$alumacc.cc:485:replace_alu$1760
  creating $alu cell for $verific$add_279$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$983: $auto$alumacc.cc:485:replace_alu$1763
  creating $alu cell for $verific$add_282$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$985: $auto$alumacc.cc:485:replace_alu$1766
  creating $alu cell for $verific$add_287$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$990: $auto$alumacc.cc:485:replace_alu$1769
  creating $alu cell for $verific$add_289$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$992: $auto$alumacc.cc:485:replace_alu$1772
  creating $alu cell for $verific$add_292$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$994: $auto$alumacc.cc:485:replace_alu$1775
  creating $alu cell for $verific$add_297$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$999: $auto$alumacc.cc:485:replace_alu$1778
  creating $alu cell for $verific$add_299$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1001: $auto$alumacc.cc:485:replace_alu$1781
  creating $alu cell for $verific$add_30$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$736: $auto$alumacc.cc:485:replace_alu$1784
  creating $alu cell for $verific$add_302$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1003: $auto$alumacc.cc:485:replace_alu$1787
  creating $alu cell for $verific$add_307$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1008: $auto$alumacc.cc:485:replace_alu$1790
  creating $alu cell for $verific$add_309$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1010: $auto$alumacc.cc:485:replace_alu$1793
  creating $alu cell for $verific$add_312$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1012: $auto$alumacc.cc:485:replace_alu$1796
  creating $alu cell for $verific$add_317$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1017: $auto$alumacc.cc:485:replace_alu$1799
  creating $alu cell for $verific$add_319$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1019: $auto$alumacc.cc:485:replace_alu$1802
  creating $alu cell for $verific$add_322$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1021: $auto$alumacc.cc:485:replace_alu$1805
  creating $alu cell for $verific$add_327$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1026: $auto$alumacc.cc:485:replace_alu$1808
  creating $alu cell for $verific$add_329$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1028: $auto$alumacc.cc:485:replace_alu$1811
  creating $alu cell for $verific$add_332$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1030: $auto$alumacc.cc:485:replace_alu$1814
  creating $alu cell for $verific$add_337$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1035: $auto$alumacc.cc:485:replace_alu$1817
  creating $alu cell for $verific$add_339$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1037: $auto$alumacc.cc:485:replace_alu$1820
  creating $alu cell for $verific$add_34$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$740: $auto$alumacc.cc:485:replace_alu$1823
  creating $alu cell for $verific$add_342$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1039: $auto$alumacc.cc:485:replace_alu$1826
  creating $alu cell for $verific$add_347$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1044: $auto$alumacc.cc:485:replace_alu$1829
  creating $alu cell for $verific$add_349$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1046: $auto$alumacc.cc:485:replace_alu$1832
  creating $alu cell for $verific$add_352$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1048: $auto$alumacc.cc:485:replace_alu$1835
  creating $alu cell for $verific$add_357$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1053: $auto$alumacc.cc:485:replace_alu$1838
  creating $alu cell for $verific$add_359$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1055: $auto$alumacc.cc:485:replace_alu$1841
  creating $alu cell for $verific$add_362$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1057: $auto$alumacc.cc:485:replace_alu$1844
  creating $alu cell for $verific$add_367$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1062: $auto$alumacc.cc:485:replace_alu$1847
  creating $alu cell for $verific$add_369$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1064: $auto$alumacc.cc:485:replace_alu$1850
  creating $alu cell for $verific$add_372$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1066: $auto$alumacc.cc:485:replace_alu$1853
  creating $alu cell for $verific$add_377$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1071: $auto$alumacc.cc:485:replace_alu$1856
  creating $alu cell for $verific$add_379$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1073: $auto$alumacc.cc:485:replace_alu$1859
  creating $alu cell for $verific$add_38$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$744: $auto$alumacc.cc:485:replace_alu$1862
  creating $alu cell for $verific$add_382$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1075: $auto$alumacc.cc:485:replace_alu$1865
  creating $alu cell for $verific$add_387$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1080: $auto$alumacc.cc:485:replace_alu$1868
  creating $alu cell for $verific$add_389$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1082: $auto$alumacc.cc:485:replace_alu$1871
  creating $alu cell for $verific$add_392$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1084: $auto$alumacc.cc:485:replace_alu$1874
  creating $alu cell for $verific$add_397$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1089: $auto$alumacc.cc:485:replace_alu$1877
  creating $alu cell for $verific$add_399$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1091: $auto$alumacc.cc:485:replace_alu$1880
  creating $alu cell for $verific$add_402$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1093: $auto$alumacc.cc:485:replace_alu$1883
  creating $alu cell for $verific$add_407$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1098: $auto$alumacc.cc:485:replace_alu$1886
  creating $alu cell for $verific$add_409$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1100: $auto$alumacc.cc:485:replace_alu$1889
  creating $alu cell for $verific$add_412$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1102: $auto$alumacc.cc:485:replace_alu$1892
  creating $alu cell for $verific$add_417$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1107: $auto$alumacc.cc:485:replace_alu$1895
  creating $alu cell for $verific$add_419$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1109: $auto$alumacc.cc:485:replace_alu$1898
  creating $alu cell for $verific$add_42$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$748: $auto$alumacc.cc:485:replace_alu$1901
  creating $alu cell for $verific$add_422$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1111: $auto$alumacc.cc:485:replace_alu$1904
  creating $alu cell for $verific$add_427$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1116: $auto$alumacc.cc:485:replace_alu$1907
  creating $alu cell for $verific$add_429$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1118: $auto$alumacc.cc:485:replace_alu$1910
  creating $alu cell for $verific$add_432$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1120: $auto$alumacc.cc:485:replace_alu$1913
  creating $alu cell for $verific$add_437$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1125: $auto$alumacc.cc:485:replace_alu$1916
  creating $alu cell for $verific$add_439$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1127: $auto$alumacc.cc:485:replace_alu$1919
  creating $alu cell for $verific$add_442$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1129: $auto$alumacc.cc:485:replace_alu$1922
  creating $alu cell for $verific$add_447$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1134: $auto$alumacc.cc:485:replace_alu$1925
  creating $alu cell for $verific$add_449$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1136: $auto$alumacc.cc:485:replace_alu$1928
  creating $alu cell for $verific$add_452$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1138: $auto$alumacc.cc:485:replace_alu$1931
  creating $alu cell for $verific$add_457$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1143: $auto$alumacc.cc:485:replace_alu$1934
  creating $alu cell for $verific$add_459$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1145: $auto$alumacc.cc:485:replace_alu$1937
  creating $alu cell for $verific$add_46$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$752: $auto$alumacc.cc:485:replace_alu$1940
  creating $alu cell for $verific$add_462$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1147: $auto$alumacc.cc:485:replace_alu$1943
  creating $alu cell for $verific$add_467$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1152: $auto$alumacc.cc:485:replace_alu$1946
  creating $alu cell for $verific$add_469$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1154: $auto$alumacc.cc:485:replace_alu$1949
  creating $alu cell for $verific$add_472$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1156: $auto$alumacc.cc:485:replace_alu$1952
  creating $alu cell for $verific$add_477$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1161: $auto$alumacc.cc:485:replace_alu$1955
  creating $alu cell for $verific$add_479$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1163: $auto$alumacc.cc:485:replace_alu$1958
  creating $alu cell for $verific$add_482$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1165: $auto$alumacc.cc:485:replace_alu$1961
  creating $alu cell for $verific$add_487$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1170: $auto$alumacc.cc:485:replace_alu$1964
  creating $alu cell for $verific$add_489$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1172: $auto$alumacc.cc:485:replace_alu$1967
  creating $alu cell for $verific$add_492$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1174: $auto$alumacc.cc:485:replace_alu$1970
  creating $alu cell for $verific$add_497$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1179: $auto$alumacc.cc:485:replace_alu$1973
  creating $alu cell for $verific$add_499$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1181: $auto$alumacc.cc:485:replace_alu$1976
  creating $alu cell for $verific$add_50$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$756: $auto$alumacc.cc:485:replace_alu$1979
  creating $alu cell for $verific$add_502$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1183: $auto$alumacc.cc:485:replace_alu$1982
  creating $alu cell for $verific$add_507$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1188: $auto$alumacc.cc:485:replace_alu$1985
  creating $alu cell for $verific$add_509$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1190: $auto$alumacc.cc:485:replace_alu$1988
  creating $alu cell for $verific$add_512$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1192: $auto$alumacc.cc:485:replace_alu$1991
  creating $alu cell for $verific$add_517$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1197: $auto$alumacc.cc:485:replace_alu$1994
  creating $alu cell for $verific$add_519$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1199: $auto$alumacc.cc:485:replace_alu$1997
  creating $alu cell for $verific$add_522$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1201: $auto$alumacc.cc:485:replace_alu$2000
  creating $alu cell for $verific$add_527$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1206: $auto$alumacc.cc:485:replace_alu$2003
  creating $alu cell for $verific$add_529$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1208: $auto$alumacc.cc:485:replace_alu$2006
  creating $alu cell for $verific$add_532$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1210: $auto$alumacc.cc:485:replace_alu$2009
  creating $alu cell for $verific$add_537$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1215: $auto$alumacc.cc:485:replace_alu$2012
  creating $alu cell for $verific$add_539$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1217: $auto$alumacc.cc:485:replace_alu$2015
  creating $alu cell for $verific$add_54$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$760: $auto$alumacc.cc:485:replace_alu$2018
  creating $alu cell for $verific$add_542$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1219: $auto$alumacc.cc:485:replace_alu$2021
  creating $alu cell for $verific$add_547$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1224: $auto$alumacc.cc:485:replace_alu$2024
  creating $alu cell for $verific$add_549$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1226: $auto$alumacc.cc:485:replace_alu$2027
  creating $alu cell for $verific$add_552$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1228: $auto$alumacc.cc:485:replace_alu$2030
  creating $alu cell for $verific$add_557$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1233: $auto$alumacc.cc:485:replace_alu$2033
  creating $alu cell for $verific$add_559$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1235: $auto$alumacc.cc:485:replace_alu$2036
  creating $alu cell for $verific$add_562$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1237: $auto$alumacc.cc:485:replace_alu$2039
  creating $alu cell for $verific$add_567$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1242: $auto$alumacc.cc:485:replace_alu$2042
  creating $alu cell for $verific$add_569$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1244: $auto$alumacc.cc:485:replace_alu$2045
  creating $alu cell for $verific$add_572$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1246: $auto$alumacc.cc:485:replace_alu$2048
  creating $alu cell for $verific$add_577$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1251: $auto$alumacc.cc:485:replace_alu$2051
  creating $alu cell for $verific$add_579$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1253: $auto$alumacc.cc:485:replace_alu$2054
  creating $alu cell for $verific$add_58$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$764: $auto$alumacc.cc:485:replace_alu$2057
  creating $alu cell for $verific$add_582$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1255: $auto$alumacc.cc:485:replace_alu$2060
  creating $alu cell for $verific$add_589$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1262: $auto$alumacc.cc:485:replace_alu$2063
  creating $alu cell for $verific$add_591$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1264: $auto$alumacc.cc:485:replace_alu$2066
  creating $alu cell for $verific$add_594$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1266: $auto$alumacc.cc:485:replace_alu$2069
  creating $alu cell for $verific$add_601$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1273: $auto$alumacc.cc:485:replace_alu$2072
  creating $alu cell for $verific$add_603$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1275: $auto$alumacc.cc:485:replace_alu$2075
  creating $alu cell for $verific$add_606$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1277: $auto$alumacc.cc:485:replace_alu$2078
  creating $alu cell for $verific$add_613$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1284: $auto$alumacc.cc:485:replace_alu$2081
  creating $alu cell for $verific$add_615$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1286: $auto$alumacc.cc:485:replace_alu$2084
  creating $alu cell for $verific$add_618$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1288: $auto$alumacc.cc:485:replace_alu$2087
  creating $alu cell for $verific$add_62$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$768: $auto$alumacc.cc:485:replace_alu$2090
  creating $alu cell for $verific$add_625$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1295: $auto$alumacc.cc:485:replace_alu$2093
  creating $alu cell for $verific$add_627$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1297: $auto$alumacc.cc:485:replace_alu$2096
  creating $alu cell for $verific$add_630$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1299: $auto$alumacc.cc:485:replace_alu$2099
  creating $alu cell for $verific$add_637$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1306: $auto$alumacc.cc:485:replace_alu$2102
  creating $alu cell for $verific$add_639$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1308: $auto$alumacc.cc:485:replace_alu$2105
  creating $alu cell for $verific$add_642$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1310: $auto$alumacc.cc:485:replace_alu$2108
  creating $alu cell for $verific$add_649$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1317: $auto$alumacc.cc:485:replace_alu$2111
  creating $alu cell for $verific$add_651$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1319: $auto$alumacc.cc:485:replace_alu$2114
  creating $alu cell for $verific$add_654$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1321: $auto$alumacc.cc:485:replace_alu$2117
  creating $alu cell for $verific$add_66$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$772: $auto$alumacc.cc:485:replace_alu$2120
  creating $alu cell for $verific$add_661$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1328: $auto$alumacc.cc:485:replace_alu$2123
  creating $alu cell for $verific$add_663$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1330: $auto$alumacc.cc:485:replace_alu$2126
  creating $alu cell for $verific$add_666$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1332: $auto$alumacc.cc:485:replace_alu$2129
  creating $alu cell for $verific$add_673$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1339: $auto$alumacc.cc:485:replace_alu$2132
  creating $alu cell for $verific$add_675$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1341: $auto$alumacc.cc:485:replace_alu$2135
  creating $alu cell for $verific$add_678$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1343: $auto$alumacc.cc:485:replace_alu$2138
  creating $alu cell for $verific$add_685$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1350: $auto$alumacc.cc:485:replace_alu$2141
  creating $alu cell for $verific$add_687$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1352: $auto$alumacc.cc:485:replace_alu$2144
  creating $alu cell for $verific$add_690$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1354: $auto$alumacc.cc:485:replace_alu$2147
  creating $alu cell for $verific$add_697$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1361: $auto$alumacc.cc:485:replace_alu$2150
  creating $alu cell for $verific$add_699$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1363: $auto$alumacc.cc:485:replace_alu$2153
  creating $alu cell for $verific$add_70$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$776: $auto$alumacc.cc:485:replace_alu$2156
  creating $alu cell for $verific$add_702$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1365: $auto$alumacc.cc:485:replace_alu$2159
  creating $alu cell for $verific$add_709$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1372: $auto$alumacc.cc:485:replace_alu$2162
  creating $alu cell for $verific$add_711$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1374: $auto$alumacc.cc:485:replace_alu$2165
  creating $alu cell for $verific$add_714$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1376: $auto$alumacc.cc:485:replace_alu$2168
  creating $alu cell for $verific$add_721$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1383: $auto$alumacc.cc:485:replace_alu$2171
  creating $alu cell for $verific$add_723$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1385: $auto$alumacc.cc:485:replace_alu$2174
  creating $alu cell for $verific$add_726$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1387: $auto$alumacc.cc:485:replace_alu$2177
  creating $alu cell for $verific$add_733$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1394: $auto$alumacc.cc:485:replace_alu$2180
  creating $alu cell for $verific$add_735$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1396: $auto$alumacc.cc:485:replace_alu$2183
  creating $alu cell for $verific$add_738$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1398: $auto$alumacc.cc:485:replace_alu$2186
  creating $alu cell for $verific$add_74$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$780: $auto$alumacc.cc:485:replace_alu$2189
  creating $alu cell for $verific$add_745$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1405: $auto$alumacc.cc:485:replace_alu$2192
  creating $alu cell for $verific$add_747$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1407: $auto$alumacc.cc:485:replace_alu$2195
  creating $alu cell for $verific$add_750$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1409: $auto$alumacc.cc:485:replace_alu$2198
  creating $alu cell for $verific$add_757$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1416: $auto$alumacc.cc:485:replace_alu$2201
  creating $alu cell for $verific$add_759$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1418: $auto$alumacc.cc:485:replace_alu$2204
  creating $alu cell for $verific$add_762$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1420: $auto$alumacc.cc:485:replace_alu$2207
  creating $alu cell for $verific$add_769$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1427: $auto$alumacc.cc:485:replace_alu$2210
  creating $alu cell for $verific$add_771$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1429: $auto$alumacc.cc:485:replace_alu$2213
  creating $alu cell for $verific$add_774$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1431: $auto$alumacc.cc:485:replace_alu$2216
  creating $alu cell for $verific$add_78$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$784: $auto$alumacc.cc:485:replace_alu$2219
  creating $alu cell for $verific$add_781$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1438: $auto$alumacc.cc:485:replace_alu$2222
  creating $alu cell for $verific$add_783$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1440: $auto$alumacc.cc:485:replace_alu$2225
  creating $alu cell for $verific$add_786$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1442: $auto$alumacc.cc:485:replace_alu$2228
  creating $alu cell for $verific$add_793$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1449: $auto$alumacc.cc:485:replace_alu$2231
  creating $alu cell for $verific$add_795$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1451: $auto$alumacc.cc:485:replace_alu$2234
  creating $alu cell for $verific$add_798$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1453: $auto$alumacc.cc:485:replace_alu$2237
  creating $alu cell for $verific$add_805$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1460: $auto$alumacc.cc:485:replace_alu$2240
  creating $alu cell for $verific$add_807$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1462: $auto$alumacc.cc:485:replace_alu$2243
  creating $alu cell for $verific$add_810$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1464: $auto$alumacc.cc:485:replace_alu$2246
  creating $alu cell for $verific$add_817$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1471: $auto$alumacc.cc:485:replace_alu$2249
  creating $alu cell for $verific$add_819$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1473: $auto$alumacc.cc:485:replace_alu$2252
  creating $alu cell for $verific$add_82$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$788: $auto$alumacc.cc:485:replace_alu$2255
  creating $alu cell for $verific$add_822$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1475: $auto$alumacc.cc:485:replace_alu$2258
  creating $alu cell for $verific$add_829$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1482: $auto$alumacc.cc:485:replace_alu$2261
  creating $alu cell for $verific$add_831$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1484: $auto$alumacc.cc:485:replace_alu$2264
  creating $alu cell for $verific$add_834$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1486: $auto$alumacc.cc:485:replace_alu$2267
  creating $alu cell for $verific$add_841$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1493: $auto$alumacc.cc:485:replace_alu$2270
  creating $alu cell for $verific$add_843$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1495: $auto$alumacc.cc:485:replace_alu$2273
  creating $alu cell for $verific$add_846$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1497: $auto$alumacc.cc:485:replace_alu$2276
  creating $alu cell for $verific$add_853$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1504: $auto$alumacc.cc:485:replace_alu$2279
  creating $alu cell for $verific$add_855$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1506: $auto$alumacc.cc:485:replace_alu$2282
  creating $alu cell for $verific$add_858$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1508: $auto$alumacc.cc:485:replace_alu$2285
  creating $alu cell for $verific$add_86$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$792: $auto$alumacc.cc:485:replace_alu$2288
  creating $alu cell for $verific$add_865$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1515: $auto$alumacc.cc:485:replace_alu$2291
  creating $alu cell for $verific$add_867$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1517: $auto$alumacc.cc:485:replace_alu$2294
  creating $alu cell for $verific$add_870$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1519: $auto$alumacc.cc:485:replace_alu$2297
  creating $alu cell for $verific$add_877$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1526: $auto$alumacc.cc:485:replace_alu$2300
  creating $alu cell for $verific$add_879$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1528: $auto$alumacc.cc:485:replace_alu$2303
  creating $alu cell for $verific$add_882$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1530: $auto$alumacc.cc:485:replace_alu$2306
  creating $alu cell for $verific$add_889$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1537: $auto$alumacc.cc:485:replace_alu$2309
  creating $alu cell for $verific$add_891$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1539: $auto$alumacc.cc:485:replace_alu$2312
  creating $alu cell for $verific$add_894$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1541: $auto$alumacc.cc:485:replace_alu$2315
  creating $alu cell for $verific$add_90$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$796: $auto$alumacc.cc:485:replace_alu$2318
  creating $alu cell for $verific$add_901$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1548: $auto$alumacc.cc:485:replace_alu$2321
  creating $alu cell for $verific$add_903$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1550: $auto$alumacc.cc:485:replace_alu$2324
  creating $alu cell for $verific$add_906$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1552: $auto$alumacc.cc:485:replace_alu$2327
  creating $alu cell for $verific$add_913$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1559: $auto$alumacc.cc:485:replace_alu$2330
  creating $alu cell for $verific$add_915$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1561: $auto$alumacc.cc:485:replace_alu$2333
  creating $alu cell for $verific$add_918$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1563: $auto$alumacc.cc:485:replace_alu$2336
  creating $alu cell for $verific$add_925$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1570: $auto$alumacc.cc:485:replace_alu$2339
  creating $alu cell for $verific$add_927$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1572: $auto$alumacc.cc:485:replace_alu$2342
  creating $alu cell for $verific$add_930$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1574: $auto$alumacc.cc:485:replace_alu$2345
  creating $alu cell for $verific$add_937$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1581: $auto$alumacc.cc:485:replace_alu$2348
  creating $alu cell for $verific$add_939$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1583: $auto$alumacc.cc:485:replace_alu$2351
  creating $alu cell for $verific$add_94$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$800: $auto$alumacc.cc:485:replace_alu$2354
  creating $alu cell for $verific$add_942$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1585: $auto$alumacc.cc:485:replace_alu$2357
  creating $alu cell for $verific$add_949$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1592: $auto$alumacc.cc:485:replace_alu$2360
  creating $alu cell for $verific$add_951$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1594: $auto$alumacc.cc:485:replace_alu$2363
  creating $alu cell for $verific$add_954$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1596: $auto$alumacc.cc:485:replace_alu$2366
  creating $alu cell for $verific$add_961$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1603: $auto$alumacc.cc:485:replace_alu$2369
  creating $alu cell for $verific$add_963$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1605: $auto$alumacc.cc:485:replace_alu$2372
  creating $alu cell for $verific$add_966$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$1607: $auto$alumacc.cc:485:replace_alu$2375
  creating $alu cell for $verific$add_98$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:838$804: $auto$alumacc.cc:485:replace_alu$2378
  created 256 $alu and 0 $macc cells.

yosys> opt_expr

3.40. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.

yosys> opt_merge -nomux

3.41. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \tea64..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \tea64.
Performed a total of 0 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.46. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
MAX OPT ITERATION = 1

yosys> stat

3.49. Printing statistics.

=== tea64 ===

   Number of wires:               1034
   Number of wire bits:          32480
   Number of public wires:         266
   Number of public wire bits:    8672
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                384
     $alu                          256
     $xor                          128


yosys> memory -nomap

3.50. Executing MEMORY pass.

yosys> opt_mem

3.50.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.50.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.50.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.50.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.50.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.50.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..

yosys> memory_share

3.50.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.50.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.50.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..

yosys> memory_collect

3.50.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.51. Printing statistics.

=== tea64 ===

   Number of wires:               1034
   Number of wire bits:          32480
   Number of public wires:         266
   Number of public wire bits:    8672
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                384
     $alu                          256
     $xor                          128


yosys> muxpack

3.52. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> opt_clean

3.53. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..

yosys> pmuxtree

3.54. Executing PMUXTREE pass.

yosys> muxpack

3.55. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> memory_map

3.56. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.57. Printing statistics.

=== tea64 ===

   Number of wires:               1034
   Number of wire bits:          32480
   Number of public wires:         266
   Number of public wire bits:    8672
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                384
     $alu                          256
     $xor                          128


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.58. Executing TECHMAP pass (map to technology primitives).

3.58.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.58.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.58.3. Continuing TECHMAP pass.
Using template $paramod$be80489e44a49c29884f59fd81c31ed03229cfc1\_80_rs_alu for cells of type $alu.
Using template $paramod$62a9e1f6b6a22c94f58bcb1cbfe24600db0272fe\_80_rs_alu for cells of type $alu.
Using template $paramod$e891e6b399cf52748460a311fafe476815d24bd7\_90_alu for cells of type $alu.
Using template $paramod$fbc7873bff55778c0b3173955b7e4bce1d9d6834\_90_alu for cells of type $alu.
Using template $paramod$a956358b3023cded48ed5b8b78d4da812e8a9ce4\_80_rs_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using template $paramod$623933ad3e90fc22092cd1f55770151cf78c2317\_90_alu for cells of type $alu.
Using template $paramod$165fdf60338663c1b1095d1639bc2761df5db061\_90_alu for cells of type $alu.
Using template $paramod$b4c4de06fc9a766c2ade48f1828e2f38f1d6a877\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $pos.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000100000 for cells of type $lcu.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~14096 debug messages>

yosys> stat

3.59. Printing statistics.

=== tea64 ===

   Number of wires:              13898
   Number of wire bits:         232104
   Number of public wires:         266
   Number of public wire bits:    8672
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              47808
     $_AND_                       7424
     $_MUX_                       8320
     $_NOT_                       7936
     $_OR_                        3712
     $_XOR_                      14528
     adder_carry                  5888


yosys> opt_expr

3.60. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
<suppressed ~15916 debug messages>

yosys> opt_merge -nomux

3.61. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
<suppressed ~17454 debug messages>
Removed a total of 5818 cells.

yosys> opt_muxtree

3.62. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \tea64..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.63. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \tea64.
Performed a total of 0 changes.

yosys> opt_merge

3.64. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_share

3.65. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.66. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.67. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..
Removed 2140 unused cells and 9686 unused wires.
<suppressed ~2141 debug messages>

yosys> opt_expr

3.68. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.

yosys> opt_muxtree

3.69. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \tea64..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.70. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \tea64.
Performed a total of 0 changes.

yosys> opt_merge

3.71. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_share

3.72. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.73. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.74. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..

yosys> opt_expr

3.75. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.76. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
<suppressed ~64 debug messages>

yosys> techmap -map +/techmap.v

3.77. Executing TECHMAP pass (map to technology primitives).

3.77.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.77.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.78. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.

yosys> opt_merge -nomux

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.80. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \tea64..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.81. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \tea64.
Performed a total of 0 changes.

yosys> opt_merge

3.82. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.83. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.84. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..

yosys> opt_expr

3.85. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
MAX OPT ITERATION = 1

yosys> abc -dff

3.86. Executing ABC pass (technology mapping using ABC).

3.86.1. Summary of detected clock domains:
  24974 cells in clk={ }, en={ }, arst={ }, srst={ }

3.86.2. Extracting gate netlist of module `\tea64' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 19086 gates and 24938 wires to a netlist network with 5852 inputs and 7360 outputs.

3.86.2.1. Executing ABC.

yosys> abc -dff

3.87. Executing ABC pass (technology mapping using ABC).

3.87.1. Summary of detected clock domains:
  20397 cells in clk={ }, en={ }, arst={ }, srst={ }

3.87.2. Extracting gate netlist of module `\tea64' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 14509 gates and 20361 wires to a netlist network with 5852 inputs and 7360 outputs.

3.87.2.1. Executing ABC.

yosys> abc -dff

3.88. Executing ABC pass (technology mapping using ABC).

3.88.1. Summary of detected clock domains:
  20348 cells in clk={ }, en={ }, arst={ }, srst={ }

3.88.2. Extracting gate netlist of module `\tea64' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 14460 gates and 20312 wires to a netlist network with 5852 inputs and 7360 outputs.

3.88.2.1. Executing ABC.

yosys> abc -dff

3.89. Executing ABC pass (technology mapping using ABC).

3.89.1. Summary of detected clock domains:
  20360 cells in clk={ }, en={ }, arst={ }, srst={ }

3.89.2. Extracting gate netlist of module `\tea64' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 14472 gates and 20324 wires to a netlist network with 5852 inputs and 7360 outputs.

3.89.2.1. Executing ABC.

yosys> opt_ffinv

3.90. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.91. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.

yosys> opt_merge -nomux

3.92. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.93. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \tea64..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.94. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \tea64.
Performed a total of 0 changes.

yosys> opt_merge

3.95. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_share

3.96. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.97. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.98. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..
Removed 0 unused cells and 78491 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.99. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.100. Executing BMUXMAP pass.

yosys> demuxmap

3.101. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_4P83m5/abc_tmp_1.scr

3.102. Executing ABC pass (technology mapping using ABC).

3.102.1. Extracting gate netlist of module `\tea64' to `<abc-temp-dir>/input.blif'..
Extracted 14455 gates and 20307 wires to a netlist network with 5852 inputs and 7360 outputs.

3.102.1.1. Executing ABC.
DE:   #PIs = 5852  #Luts =  8540  Max Lvl = 137  Avg Lvl =   6.97  [   0.55 sec. at Pass 0]
DE:   #PIs = 5852  #Luts =  8540  Max Lvl = 137  Avg Lvl =   6.97  [  27.77 sec. at Pass 1]
DE:   #PIs = 5852  #Luts =  8407  Max Lvl =  71  Avg Lvl =   5.39  [   4.60 sec. at Pass 2]
DE:   #PIs = 5852  #Luts =  8407  Max Lvl =  71  Avg Lvl =   5.39  [  10.19 sec. at Pass 3]
DE:   #PIs = 5852  #Luts =  8363  Max Lvl = 118  Avg Lvl =   6.00  [   9.64 sec. at Pass 4]
DE:   #PIs = 5852  #Luts =  8363  Max Lvl = 118  Avg Lvl =   6.00  [   9.90 sec. at Pass 5]
DE:   #PIs = 5852  #Luts =  8352  Max Lvl = 124  Avg Lvl =   5.96  [  11.05 sec. at Pass 6]
DE:   #PIs = 5852  #Luts =  8352  Max Lvl = 124  Avg Lvl =   5.96  [  10.16 sec. at Pass 7]
DE:   #PIs = 5852  #Luts =  8352  Max Lvl = 124  Avg Lvl =   5.96  [  12.17 sec. at Pass 8]
DE:   #PIs = 5852  #Luts =  8352  Max Lvl = 124  Avg Lvl =   5.96  [   7.41 sec. at Pass 9]
DE:   #PIs = 5852  #Luts =  8352  Max Lvl = 124  Avg Lvl =   5.96  [   1.91 sec. at Pass 10]

yosys> opt_expr

3.103. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.

yosys> opt_merge -nomux

3.104. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.105. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \tea64..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.106. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \tea64.
Performed a total of 0 changes.

yosys> opt_merge

3.107. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_share

3.108. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.109. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.110. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..
Removed 0 unused cells and 20307 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.111. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.112. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.113. Printing statistics.

=== tea64 ===

   Number of wires:               1962
   Number of wire bits:          25664
   Number of public wires:         266
   Number of public wire bits:    8672
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              14240
     $lut                         8352
     adder_carry                  5888


yosys> shregmap -minlen 8 -maxlen 20

3.114. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.115. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.116. Printing statistics.

=== tea64 ===

   Number of wires:               1962
   Number of wire bits:          25664
   Number of public wires:         266
   Number of public wire bits:    8672
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              14240
     $lut                         8352
     adder_carry                  5888


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.117. Executing TECHMAP pass (map to technology primitives).

3.117.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.117.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.117.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~8488 debug messages>

yosys> opt_expr -mux_undef

3.118. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
<suppressed ~44188 debug messages>

yosys> simplemap

3.119. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.120. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.

yosys> opt_merge

3.121. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
<suppressed ~79929 debug messages>
Removed a total of 26643 cells.

yosys> opt_dff -nodffe -nosdff

3.122. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.123. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..
Removed 0 unused cells and 12888 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.124. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
<suppressed ~118 debug messages>

yosys> opt_merge -nomux

3.125. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.126. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \tea64..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.127. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \tea64.
Performed a total of 0 changes.

yosys> opt_merge

3.128. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_share

3.129. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.130. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.131. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..

yosys> opt_expr

3.132. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_4P83m5/abc_tmp_2.scr

3.133. Executing ABC pass (technology mapping using ABC).

3.133.1. Extracting gate netlist of module `\tea64' to `<abc-temp-dir>/input.blif'..
Extracted 25491 gates and 31345 wires to a netlist network with 5852 inputs and 7360 outputs.

3.133.1.1. Executing ABC.
DE:   #PIs = 5852  #Luts =  8531  Max Lvl = 120  Avg Lvl =   5.98  [   0.71 sec. at Pass 0]
DE:   #PIs = 5852  #Luts =  8457  Max Lvl = 129  Avg Lvl =   6.49  [  24.33 sec. at Pass 1]
DE:   #PIs = 5852  #Luts =  8342  Max Lvl = 120  Avg Lvl =   5.78  [   6.23 sec. at Pass 2]
DE:   #PIs = 5852  #Luts =  8342  Max Lvl = 120  Avg Lvl =   5.78  [   7.70 sec. at Pass 3]
DE:   #PIs = 5852  #Luts =  8342  Max Lvl = 120  Avg Lvl =   5.78  [   9.87 sec. at Pass 4]
DE:   #PIs = 5852  #Luts =  8342  Max Lvl = 120  Avg Lvl =   5.78  [  10.29 sec. at Pass 5]
DE:   #PIs = 5852  #Luts =  8342  Max Lvl = 120  Avg Lvl =   5.78  [   2.48 sec. at Pass 6]

yosys> opt_expr

3.134. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.

yosys> opt_merge -nomux

3.135. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.136. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \tea64..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.137. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \tea64.
Performed a total of 0 changes.

yosys> opt_merge

3.138. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\tea64'.
Removed a total of 0 cells.

yosys> opt_share

3.139. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.140. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.141. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..
Removed 0 unused cells and 25380 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.142. Executing OPT_EXPR pass (perform const folding).
Optimizing module tea64.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.143. Executing HIERARCHY pass (managing design hierarchy).

3.143.1. Analyzing design hierarchy..
Top module:  \tea64

3.143.2. Analyzing design hierarchy..
Top module:  \tea64
Removed 0 unused modules.

yosys> stat

3.144. Printing statistics.

=== tea64 ===

   Number of wires:               1952
   Number of wire bits:          25654
   Number of public wires:         266
   Number of public wire bits:    8672
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              14230
     $lut                         8342
     adder_carry                  5888


yosys> opt_clean -purge

3.145. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \tea64..
Removed 0 unused cells and 137 unused wires.
<suppressed ~137 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.146. Executing Verilog backend.
Dumping module `\tea64'.

End of script. Logfile hash: af94e646f9, CPU: user 55.94s system 0.24s, MEM: 287.39 MB peak
Yosys 0.18+10 (git sha1 a3cbfccc4, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 92% 6x abc (663 sec), 2% 26x opt_expr (18 sec), ...
real 263.28
user 641.06
sys 73.17
